/*
 * PDB file: CoDMPServer_PC.pdb
 * Image architecture: i386 (0x014c)
 *
 * Dumped by pdbex tool v0.18, by wbenny
 */

enum _TAG_UNNAMED_1;
enum tagSYSKIND;
enum _TAG_UNNAMED_2;
enum eAttachmentGroup;
enum inflate_mode;
enum bdNATType;
enum tagBINDSTATUS;
enum ai_badplace_t;
enum D3D11_COMPARISON_FUNC;
enum NV_DP_DYNAMIC_RANGE;
enum _TAG_UNNAMED_3;
enum D3D11_FEATURE;
union vec3_t;
struct VehicleHover;
enum link_type_e;
enum D3D11_DEPTH_WRITE_MASK;
enum _NV_GPU_HDCP_FUSE_STATE;
struct ZBarrierBoard;
enum D3D11_STENCIL_OP;
enum _TAG_UNNAMED_4;
enum mz_zip_flags;
class bdMarketplace;
enum _TAG_UNNAMED_5;
enum gjk_entity_info_t::ENTITY_TYPE;
enum _TAG_UNNAMED_6;
enum tagURLZONE;
enum D3D11_BLEND;
struct gameTypeInfo;
struct mapStartLocInfo;
struct VehicleGunnerTags;
enum KillCamEntityType;
enum scriptInstance_t;
enum NV_MONITOR_CONN_TYPE;
enum _TAG_UNNAMED_7;
enum meansOfDeath_t;
enum rb_vehicle_model::rb_vehicle_model_flags_e;
struct PhysicsInputs;
enum _URLZONEREG;
enum _NVDRS_SETTING_TYPE;
enum D3D11_BLEND_OP;
enum _TAG_UNNAMED_8;
enum CIN_CALLBACK_TYPE;
enum D3D11_COLOR_WRITE_ENABLE;
class phys_free_list<rigid_body_constraint_point>::T_internal_base;
class phys_free_list<rigid_body_constraint_point>;
enum IKHandNames;
enum tagTYPEKIND;
enum _TAG_UNNAMED_9;
enum SphereEdgeTraceResult;
enum D3D11_MESSAGE_CATEGORY;
enum bdBitBufferDataType;
enum _TAG_UNNAMED_10;
enum D3D11_MESSAGE_SEVERITY;
enum NV_DP_LINK_RATE;
enum IKDebugColor;
enum D3D11_MESSAGE_ID;
class phys_vec3;

  BD_NAT_UNKNOWN = 0,
  BD_NAT_OPEN = 1,
  BD_NAT_MODERATE = 2,
  BD_NAT_STRICT = 3,
};

enum tagBINDSTATUS
{
  BINDSTATUS_FINDINGRESOURCE = 1,
  BINDSTATUS_CONNECTING = 2,
  BINDSTATUS_REDIRECTING = 3,
  BINDSTATUS_BEGINDOWNLOADDATA = 4,
  BINDSTATUS_DOWNLOADINGDATA = 5,
  BINDSTATUS_ENDDOWNLOADDATA = 6,
  BINDSTATUS_BEGINDOWNLOADCOMPONENTS = 7,
  BINDSTATUS_INSTALLINGCOMPONENTS = 8,
  BINDSTATUS_ENDDOWNLOADCOMPONENTS = 9,
  BINDSTATUS_USINGCACHEDCOPY = 10,
  BINDSTATUS_SENDINGREQUEST = 11,
  BINDSTATUS_CLASSIDAVAILABLE = 12,
  BINDSTATUS_MIMETYPEAVAILABLE = 13,
  BINDSTATUS_CACHEFILENAMEAVAILABLE = 14,
  BINDSTATUS_BEGINSYNCOPERATION = 15,
  BINDSTATUS_ENDSYNCOPERATION = 16,
  BINDSTATUS_BEGINUPLOADDATA = 17,
  BINDSTATUS_UPLOADINGDATA = 18,
  BINDSTATUS_ENDUPLOADDATA = 19,
  BINDSTATUS_PROTOCOLCLASSID = 20,
  BINDSTATUS_ENCODING = 21,
  BINDSTATUS_VERIFIEDMIMETYPEAVAILABLE = 22,
  BINDSTATUS_CLASSINSTALLLOCATION = 23,
  BINDSTATUS_DECODING = 24,
  BINDSTATUS_LOADINGMIMEHANDLER = 25,
  BINDSTATUS_CONTENTDISPOSITIONATTACH = 26,
  BINDSTATUS_FILTERREPORTMIMETYPE = 27,
  BINDSTATUS_CLSIDCANINSTANTIATE = 28,
  BINDSTATUS_IUNKNOWNAVAILABLE = 29,
  BINDSTATUS_DIRECTBIND = 30,
  BINDSTATUS_RAWMIMETYPE = 31,
  BINDSTATUS_PROXYDETECTING = 32,
  BINDSTATUS_ACCEPTRANGES = 33,
  BINDSTATUS_COOKIE_SENT = 34,
  BINDSTATUS_COMPACT_POLICY_RECEIVED = 35,
  BINDSTATUS_COOKIE_SUPPRESSED = 36,
  BINDSTATUS_COOKIE_STATE_UNKNOWN = 37,
  BINDSTATUS_COOKIE_STATE_ACCEPT = 38,
  BINDSTATUS_COOKIE_STATE_REJECT = 39,
  BINDSTATUS_COOKIE_STATE_PROMPT = 40,
  BINDSTATUS_COOKIE_STATE_LEASH = 41,
  BINDSTATUS_COOKIE_STATE_DOWNGRADE = 42,
  BINDSTATUS_POLICY_HREF = 43,
  BINDSTATUS_P3P_HEADER = 44,
  BINDSTATUS_SESSION_COOKIE_RECEIVED = 45,
  BINDSTATUS_PERSISTENT_COOKIE_RECEIVED = 46,
  BINDSTATUS_SESSION_COOKIES_ALLOWED = 47,
  BINDSTATUS_CACHECONTROL = 48,
  BINDSTATUS_CONTENTDISPOSITIONFILENAME = 49,
  BINDSTATUS_MIMETEXTPLAINMISMATCH = 50,
  BINDSTATUS_PUBLISHERAVAILABLE = 51,
  BINDSTATUS_DISPLAYNAMEAVAILABLE = 52,
  BINDSTATUS_SSLUX_NAVBLOCKED = 53,
  BINDSTATUS_SERVER_MIMETYPEAVAILABLE = 54,
  BINDSTATUS_SNIFFED_CLASSIDAVAILABLE = 55,
  BINDSTATUS_64BIT_PROGRESS = 56,
};

enum ai_badplace_t
{
  AI_BADPLACE_NONE = 0,
  AI_BADPLACE_NORMAL = 1,
  AI_BADPLACE_REALLYBAD = 2,
};

enum D3D11_COMPARISON_FUNC
{
  D3D11_COMPARISON_NEVER = 1,
  D3D11_COMPARISON_LESS = 2,
  D3D11_COMPARISON_EQUAL = 3,
  D3D11_COMPARISON_LESS_EQUAL = 4,
  D3D11_COMPARISON_GREATER = 5,
  D3D11_COMPARISON_NOT_EQUAL = 6,
  D3D11_COMPARISON_GREATER_EQUAL = 7,
  D3D11_COMPARISON_ALWAYS = 8,
};

enum NV_DP_DYNAMIC_RANGE
{
  NV_DP_DYNAMIC_RANGE_VESA = 0,
  NV_DP_DYNAMIC_RANGE_CEA = 1,
};

typedef enum _TAG_UNNAMED_3
{
  XANIM_VERSION = 19,
  XMODEL_VERSION = 64,
  XMODEL_PIECES_VERSION = 1,
} TAG_UNNAMED_3, *PTAG_UNNAMED_3;

enum D3D11_FEATURE
{
  D3D11_FEATURE_THREADING = 0,
  D3D11_FEATURE_DOUBLES = 1,
  D3D11_FEATURE_FORMAT_SUPPORT = 2,
  D3D11_FEATURE_FORMAT_SUPPORT2 = 3,
  D3D11_FEATURE_D3D10_X_HARDWARE_OPTIONS = 4,
};

union vec3_t
{
  union
  {
    struct
    {
      /* 0x0000 */ float x;
      /* 0x0004 */ float y;
      /* 0x0008 */ float z;
    }; /* size: 0x000c */
    /* 0x0000 */ float v[3];
  }; /* size: 0x000c */
}; /* size: 0x000c */

struct VehicleHover
{
  /* 0x0000 */ float hoverRadius;
  /* 0x0004 */ float hoverSpeed;
  /* 0x0008 */ float hoverAccel;
  /* 0x000c */ union vec3_t hoverGoalPos;
  /* 0x0018 */ int useHoverAccelForAngles;
}; /* size: 0x001c */

enum link_type_e
{
  PITCH_CTRL = 0,
  YAW_CTRL = 1,
  ROLL_CTRL = 2,
  SWIM_CTRL = 3,
  FULL_CTRL = 4,
  COMPASS_CTRL = 5,
};

enum D3D11_DEPTH_WRITE_MASK
{
  D3D11_DEPTH_WRITE_MASK_ZERO = 0,
  D3D11_DEPTH_WRITE_MASK_ALL = 1,
};

typedef enum _NV_GPU_HDCP_FUSE_STATE
{
  NV_GPU_HDCP_FUSE_STATE_UNKNOWN = 0,
  NV_GPU_HDCP_FUSE_STATE_DISABLED = 1,
  NV_GPU_HDCP_FUSE_STATE_ENABLED = 2,
} NV_GPU_HDCP_FUSE_STATE, *PNV_GPU_HDCP_FUSE_STATE;

struct ZBarrierBoard
{
  /* 0x0000 */ struct XModel* pBoardModel;
  /* 0x0004 */ struct XModel* pAlternateBoardModel;
  /* 0x0008 */ struct XModel* pUpgradedBoardModel;
  /* 0x000c */ const char* pTearAnim;
  /* 0x0010 */ const char* pBoardAnim;
  /* 0x0014 */ const struct FxEffectDef* repairEffect1;
  /* 0x0018 */ const struct FxEffectDef* repairEffect2;
  /* 0x001c */ union vec3_t repairEffect1Offset;
  /* 0x0028 */ union vec3_t repairEffect2Offset;
  /* 0x0034 */ unsigned int boardRepairSound;
  /* 0x0038 */ unsigned int boardRepairHoverSound;
  /* 0x003c */ unsigned int pauseAndRepeatRepSound;
  /* 0x0040 */ float minPause;
  /* 0x0044 */ float maxPause;
  /* 0x0048 */ unsigned short zombieBoardTearStateName;
  /* 0x004a */ unsigned short zombieBoardTearSubStateName;
  /* 0x004c */ unsigned int numRepsToPullProBoard;
}; /* size: 0x0050 */

enum D3D11_STENCIL_OP
{
  D3D11_STENCIL_OP_KEEP = 1,
  D3D11_STENCIL_OP_ZERO = 2,
  D3D11_STENCIL_OP_REPLACE = 3,
  D3D11_STENCIL_OP_INCR_SAT = 4,
  D3D11_STENCIL_OP_DECR_SAT = 5,
  D3D11_STENCIL_OP_INVERT = 6,
  D3D11_STENCIL_OP_INCR = 7,
  D3D11_STENCIL_OP_DECR = 8,
};

typedef enum _TAG_UNNAMED_4
{
  RIOTSHIELD_DEFAULT_MODEL = 0,
  RIOTSHIELD_RED_MODEL = 1,
} TAG_UNNAMED_4, *PTAG_UNNAMED_4;

enum mz_zip_flags
{
  MZ_ZIP_FLAG_CASE_SENSITIVE = 256,
  MZ_ZIP_FLAG_IGNORE_PATH = 512,
  MZ_ZIP_FLAG_COMPRESSED_DATA = 1024,
  MZ_ZIP_FLAG_DO_NOT_SORT_CENTRAL_DIRECTORY = 2048,
};

class bdMarketplace
{
  /* 0x0000 */ class bdRemoteTaskManager* m_remoteTaskManager;
}; /* size: 0x0004 */

typedef enum _TAG_UNNAMED_5
{
  VAR_TYPE_MASK = 127,
  VAR_HAS_CHILDREN_MASK = 128,
} TAG_UNNAMED_5, *PTAG_UNNAMED_5;

enum gjk_entity_info_t::ENTITY_TYPE
{
  ET_GENT = 0,
  ET_CENT = 1,
  ET_DENT = 2,
  ET_GLASS = 3,
  ET_NONE = 4,
};

typedef enum _TAG_UNNAMED_6
{
  TINFL_FLAG_PARSE_ZLIB_HEADER = 1,
  TINFL_FLAG_HAS_MORE_INPUT = 2,
  TINFL_FLAG_USING_NON_WRAPPING_OUTPUT_BUF = 4,
  TINFL_FLAG_COMPUTE_ADLER32 = 8,
} TAG_UNNAMED_6, *PTAG_UNNAMED_6;

enum tagURLZONE
{
  URLZONE_INVALID = -1,
  URLZONE_PREDEFINED_MIN = 0,
  URLZONE_LOCAL_MACHINE = 0,
  URLZONE_INTRANET = 1,
  URLZONE_TRUSTED = 2,
  URLZONE_INTERNET = 3,
  URLZONE_UNTRUSTED = 4,
  URLZONE_PREDEFINED_MAX = 999,
  URLZONE_USER_MIN = 1000,
  URLZONE_USER_MAX = 10000,
};

enum D3D11_BLEND
{
  D3D11_BLEND_ZERO = 1,
  D3D11_BLEND_ONE = 2,
  D3D11_BLEND_SRC_COLOR = 3,
  D3D11_BLEND_INV_SRC_COLOR = 4,
  D3D11_BLEND_SRC_ALPHA = 5,
  D3D11_BLEND_INV_SRC_ALPHA = 6,
  D3D11_BLEND_DEST_ALPHA = 7,
  D3D11_BLEND_INV_DEST_ALPHA = 8,
  D3D11_BLEND_DEST_COLOR = 9,
  D3D11_BLEND_INV_DEST_COLOR = 10,
  D3D11_BLEND_SRC_ALPHA_SAT = 11,
  D3D11_BLEND_BLEND_FACTOR = 14,
  D3D11_BLEND_INV_BLEND_FACTOR = 15,
  D3D11_BLEND_SRC1_COLOR = 16,
  D3D11_BLEND_INV_SRC1_COLOR = 17,
  D3D11_BLEND_SRC1_ALPHA = 18,
  D3D11_BLEND_INV_SRC1_ALPHA = 19,
};

struct gameTypeInfo
{
  /* 0x0000 */ char gameType[12];
  /* 0x000c */ char gameTypeName[32];
  /* 0x002c */ char gameTypeShortName[32];
  /* 0x004c */ char gameTypeNameCaps[32];
  /* 0x006c */ int splitscreen;
}; /* size: 0x0070 */

struct mapStartLocInfo
{
  /* 0x0000 */ char startLoc[12];
  /* 0x000c */ char startLocName[32];
  /* 0x002c */ char mapLoadName[24];
  /* 0x0044 */ int numGameModes;
  /* 0x0048 */ struct gameTypeInfo gameModes[16];
}; /* size: 0x0748 */

struct VehicleGunnerTags
{
  /* 0x0000 */ int turret;
  /* 0x0004 */ int barrel;
  /* 0x0008 */ int flash;
  /* 0x000c */ int flash2;
}; /* size: 0x0010 */

enum KillCamEntityType
{
  KC_NO_ENTITY = 0,
  KC_HELICOPTER = 1,
  KC_DESTRUCTIBLE = 2,
  KC_SCRIPTED = 3,
  KC_EXPLOSIVE = 4,
  KC_FAST_EXPLOSIVE = 5,
  KC_ROCKET = 6,
  KC_DRONE = 7,
  KC_DOG = 8,
  KC_ARTILLERY = 9,
  KC_VEHICLE = 10,
  KC_TURRET = 11,
};

enum scriptInstance_t
{
  SCRIPTINSTANCE_SERVER = 0,
  SCRIPTINSTANCE_CLIENT = 1,
  SCRIPT_INSTANCE_MAX = 2,
};

enum NV_MONITOR_CONN_TYPE
{
  NV_MONITOR_CONN_TYPE_UNINITIALIZED = 0,
  NV_MONITOR_CONN_TYPE_VGA = 1,
  NV_MONITOR_CONN_TYPE_COMPONENT = 2,
  NV_MONITOR_CONN_TYPE_SVIDEO = 3,
  NV_MONITOR_CONN_TYPE_HDMI = 4,
  NV_MONITOR_CONN_TYPE_DVI = 5,
  NV_MONITOR_CONN_TYPE_LVDS = 6,
  NV_MONITOR_CONN_TYPE_DP = 7,
  NV_MONITOR_CONN_TYPE_COMPOSITE = 8,
  NV_MONITOR_CONN_TYPE_UNKNOWN = -1,
};

typedef enum _TAG_UNNAMED_7
{
  HW_CURSOR_ARROW = 0,
  HW_CURSOR_GRABOPEN = 1,
  HW_CURSOR_GRABCLOSE = 2,
  HW_CURSOR_GRABOPENZM = 3,
  HW_CURSOR_GRABCLOSEZM = 4,
  HW_CURSOR_COUNT = 5,
} TAG_UNNAMED_7, *PTAG_UNNAMED_7;

enum meansOfDeath_t
{
  MOD_UNKNOWN = 0,
  MOD_PISTOL_BULLET = 1,
  MOD_RIFLE_BULLET = 2,
  MOD_GRENADE = 3,
  MOD_GRENADE_SPLASH = 4,
  MOD_PROJECTILE = 5,
  MOD_PROJECTILE_SPLASH = 6,
  MOD_MELEE = 7,
  MOD_BAYONET = 8,
  MOD_HEAD_SHOT = 9,
  MOD_CRUSH = 10,
  MOD_TELEFRAG = 11,
  MOD_FALLING = 12,
  MOD_SUICIDE = 13,
  MOD_TRIGGER_HURT = 14,
  MOD_EXPLOSIVE = 15,
  MOD_IMPACT = 16,
  MOD_BURNED = 17,
  MOD_HIT_BY_OBJECT = 18,
  MOD_DROWN = 19,
  MOD_GAS = 20,
  MOD_NUM = 21,
};

enum rb_vehicle_model::rb_vehicle_model_flags_e
{
  FLAG_IS_POWER_BRAKING = 1,
  FLAG_IS_BRAKING = 2,
  FLAG_IS_FORWARD_ACCELERATION = 4,
  FLAG_IS_REVERSE_ACCELERATION = 8,
  FLAG_IS_COASTING = 16,
};

struct PhysicsInputs
{
  /* 0x0000 */ union vec3_t vVelocity;
  /* 0x000c */ unsigned short groundEntNum;
  /* 0x000e */ char Padding_0[2];
  /* 0x0010 */ int bHasGroundPlane;
  /* 0x0014 */ float groundplaneSlope;
  /* 0x0018 */ int iFootstepTimer;
}; /* size: 0x001c */

typedef enum _URLZONEREG
{
  URLZONEREG_DEFAULT = 0,
  URLZONEREG_HKLM = 1,
  URLZONEREG_HKCU = 2,
} URLZONEREG, *PURLZONEREG;

typedef enum _NVDRS_SETTING_TYPE
{
  NVDRS_DWORD_TYPE = 0,
  NVDRS_BINARY_TYPE = 1,
  NVDRS_STRING_TYPE = 2,
  NVDRS_WSTRING_TYPE = 3,
} NVDRS_SETTING_TYPE, *PNVDRS_SETTING_TYPE;

enum D3D11_BLEND_OP
{
  D3D11_BLEND_OP_ADD = 1,
  D3D11_BLEND_OP_SUBTRACT = 2,
  D3D11_BLEND_OP_REV_SUBTRACT = 3,
  D3D11_BLEND_OP_MIN = 4,
  D3D11_BLEND_OP_MAX = 5,
};

typedef enum _TAG_UNNAMED_8
{
  CMDBUF_LIT_BSP = 0,
  CMDBUF_LIT_BSP_END = 0,
  CMDBUF_LIT_STATIC_MODEL = 1,
  CMDBUF_LIT_STATIC_MODEL_END = 1,
  CMDBUF_LIT = 2,
  CMDBUF_LIT_END = 2,
  CMDBUF_LIT_BSP_POST_RESOLVE = 3,
  CMDBUF_LIT_STATIC_MODEL_POST_RESOLVE = 4,
  CMDBUF_LIT_POST_RESOLVE = 5,
  CMDBUF_LIT_SONAR = 6,
  CMDBUF_LIGHT_MAP_BSP = 7,
  CMDBUF_LIGHT_MAP_BSP_END = 8,
  CMDBUF_LIGHT_MAP_STATIC_MODEL = 9,
  CMDBUF_LIGHT_MAP_STATIC_MODEL_END = 10,
  CMDBUF_LIGHT_MAP = 11,
  CMDBUF_LIGHT_MAP_END = 12,
  CMDBUF_LIGHT_MAP_BSP_POST_RESOLVE = 13,
  CMDBUF_LIGHT_MAP_STATIC_MODEL_POST_RESOLVE = 14,
  CMDBUF_LIGHT_MAP_POST_RESOLVE = 15,
  CMDBUF_DEPTH_HACK = 16,
  CMDBUF_TRANS = 17,
  CMDBUF_TRANS_POST_FX = 18,
  CMDBUF_LIT_QUASI_OPAQUE = 19,
  CMDBUF_EMISSIVE_OPAQUE = 20,
  CMDBUF_EMISSIVE_FX = 21,
  CMDBUF_VIEWMODEL_FX = 22,
  CMDBUF_SUPERFLARE = 23,
  CMDBUF_VIEWMODEL_TRANS = 24,
  CMDBUF_POST_BLUR = 25,
  CMDBUF_SUN_SHADOW_MAP0 = 26,
  CMDBUF_SUN_SHADOW_MAP1 = 27,
  CMDBUF_SPOT_SHADOW_MAP0 = 28,
  CMDBUF_SPOT_SHADOW_MAP1 = 29,
  CMDBUF_SPOT_SHADOW_MAP2 = 30,
  CMDBUF_SPOT_SHADOW_MAP3 = 31,
  CMDBUF_PREPASS = 32,
  CMDBUF_COUNT = 33,
} TAG_UNNAMED_8, *PTAG_UNNAMED_8;

enum CIN_CALLBACK_TYPE
{
  CINEMATIC_CALLBACK_INVALID = 0,
  CINEMATIC_CALLBACK_CSCR = 1,
  CINEMATIC_CALLBACK_IMMEDIATE = 2,
  CINEMATIC_CALLBACK_TYPE_COUNT = 3,
};

enum D3D11_COLOR_WRITE_ENABLE
{
  D3D11_COLOR_WRITE_ENABLE_RED = 1,
  D3D11_COLOR_WRITE_ENABLE_GREEN = 2,
  D3D11_COLOR_WRITE_ENABLE_BLUE = 4,
  D3D11_COLOR_WRITE_ENABLE_ALPHA = 8,
  D3D11_COLOR_WRITE_ENABLE_ALL = 15,
};

class phys_free_list<rigid_body_constraint_point>::T_internal_base
{
  /* 0x0000 */ class phys_free_list<rigid_body_constraint_point>::T_internal_base* m_prev_T_internal;
  /* 0x0004 */ class phys_free_list<rigid_body_constraint_point>::T_internal_base* m_next_T_internal;
}; /* size: 0x0008 */

class phys_free_list<rigid_body_constraint_point>
{
  /* 0x0000 */ class phys_free_list<rigid_body_constraint_point>::T_internal_base m_dummy_head;
  /* 0x0008 */ int m_list_count;
  /* 0x000c */ int m_list_count_high_water;
  /* 0x0010 */ class rigid_body_constraint_point* m_ptr_list[256];
  /* 0x0410 */ int m_ptr_list_count;
}; /* size: 0x0414 */

enum IKHandNames
{
  IKHAND_LEFT = 0,
  IKHAND_RIGHT = 1,
  IKHAND_COUNT = 2,
};

enum tagTYPEKIND
{
  TKIND_ENUM = 0,
  TKIND_RECORD = 1,
  TKIND_MODULE = 2,
  TKIND_INTERFACE = 3,
  TKIND_DISPATCH = 4,
  TKIND_COCLASS = 5,
  TKIND_ALIAS = 6,
  TKIND_UNION = 7,
  TKIND_MAX = 8,
};

typedef enum _TAG_UNNAMED_9
{
  PRIM_POINTLIST = 1,
  PRIM_LINELIST = 2,
  PRIM_LINESTRIP = 3,
  PRIM_TRIANGLELIST = 4,
  PRIM_TRIANGLESTRIP = 5,
  PRIM_TRIANGLEFAN = -1,
  PRIM_QUADLIST = -1,
  PRIM_QUADSTRIP = -1,
  PRIM_RECTLIST = -1,
} TAG_UNNAMED_9, *PTAG_UNNAMED_9;

enum SphereEdgeTraceResult
{
  SPHERE_HITS_EDGE = 0,
  SPHERE_MISSES_EDGE = 1,
  SPHERE_MAY_HIT_V0 = 2,
  SPHERE_MAY_HIT_V1 = 3,
};

enum D3D11_MESSAGE_CATEGORY
{
  D3D11_MESSAGE_CATEGORY_APPLICATION_DEFINED = 0,
  D3D11_MESSAGE_CATEGORY_MISCELLANEOUS = 1,
  D3D11_MESSAGE_CATEGORY_INITIALIZATION = 2,
  D3D11_MESSAGE_CATEGORY_CLEANUP = 3,
  D3D11_MESSAGE_CATEGORY_COMPILATION = 4,
  D3D11_MESSAGE_CATEGORY_STATE_CREATION = 5,
  D3D11_MESSAGE_CATEGORY_STATE_SETTING = 6,
  D3D11_MESSAGE_CATEGORY_STATE_GETTING = 7,
  D3D11_MESSAGE_CATEGORY_RESOURCE_MANIPULATION = 8,
  D3D11_MESSAGE_CATEGORY_EXECUTION = 9,
};

enum bdBitBufferDataType
{
  BD_BB_NO_TYPE = 0,
  BD_BB_BOOL_TYPE = 1,
  BD_BB_SIGNED_CHAR8_TYPE = 2,
  BD_BB_UNSIGNED_CHAR8_TYPE = 3,
  BD_BB_WCHAR16_TYPE = 4,
  BD_BB_SIGNED_INTEGER16_TYPE = 5,
  BD_BB_UNSIGNED_INTEGER16_TYPE = 6,
  BD_BB_SIGNED_INTEGER32_TYPE = 7,
  BD_BB_UNSIGNED_INTEGER32_TYPE = 8,
  BD_BB_SIGNED_INTEGER64_TYPE = 9,
  BD_BB_UNSIGNED_INTEGER64_TYPE = 10,
  BD_BB_RANGED_SIGNED_INTEGER32_TYPE = 11,
  BD_BB_RANGED_UNSIGNED_INTEGER32_TYPE = 12,
  BD_BB_FLOAT32_TYPE = 13,
  BD_BB_FLOAT64_TYPE = 14,
  BD_BB_RANGED_FLOAT32_TYPE = 15,
  BD_BB_SIGNED_CHAR8_STRING_TYPE = 16,
  BD_BB_UNSIGNED_CHAR8_STRING_TYPE = 17,
  BD_BB_MBSTRING_TYPE = 18,
  BD_BB_BLOB_TYPE = 19,
  BD_BB_NAN_TYPE = 20,
  BD_BB_FULL_TYPE = 21,
  BD_BB_MAX_TYPE = 32,
};

typedef enum _TAG_UNNAMED_10
{
  FLAG_IS_BPI = 1,
  FLAG_IS_BPG = 2,
  FLAG_IS_BPI_ENV = 4,
  FLAG_IS_IN_CLUSTER = 16,
  FLAG_ON_ENV_LIST = 32,
  FLAG_ON_BPG_LIST = 64,
  FLAG_IS_AUTO_ACTIVATE = 128,
  BPB_FIRST_UNUSED_FLAG = 512,
} TAG_UNNAMED_10, *PTAG_UNNAMED_10;

enum D3D11_MESSAGE_SEVERITY
{
  D3D11_MESSAGE_SEVERITY_CORRUPTION = 0,
  D3D11_MESSAGE_SEVERITY_ERROR = 1,
  D3D11_MESSAGE_SEVERITY_WARNING = 2,
  D3D11_MESSAGE_SEVERITY_INFO = 3,
};

enum NV_DP_LINK_RATE
{
  NV_DP_1_62GBPS = 6,
  NV_DP_2_70GBPS = 10,
};

enum IKDebugColor
{
  IK_DEBUG_COLOR_RED = 0,
  IK_DEBUG_COLOR_GREEN = 1,
  IK_DEBUG_COLOR_BLUE = 2,
  IK_DEBUG_COLOR_LIGHT_CYAN = 3,
};

enum D3D11_MESSAGE_ID
{
  D3D11_MESSAGE_ID_UNKNOWN = 0,
  D3D11_MESSAGE_ID_DEVICE_IASETVERTEXBUFFERS_HAZARD = 1,
  D3D11_MESSAGE_ID_DEVICE_IASETINDEXBUFFER_HAZARD = 2,
  D3D11_MESSAGE_ID_DEVICE_VSSETSHADERRESOURCES_HAZARD = 3,
  D3D11_MESSAGE_ID_DEVICE_VSSETCONSTANTBUFFERS_HAZARD = 4,
  D3D11_MESSAGE_ID_DEVICE_GSSETSHADERRESOURCES_HAZARD = 5,
  D3D11_MESSAGE_ID_DEVICE_GSSETCONSTANTBUFFERS_HAZARD = 6,
  D3D11_MESSAGE_ID_DEVICE_PSSETSHADERRESOURCES_HAZARD = 7,
  D3D11_MESSAGE_ID_DEVICE_PSSETCONSTANTBUFFERS_HAZARD = 8,
  D3D11_MESSAGE_ID_DEVICE_OMSETRENDERTARGETS_HAZARD = 9,
  D3D11_MESSAGE_ID_DEVICE_SOSETTARGETS_HAZARD = 10,
  D3D11_MESSAGE_ID_STRING_FROM_APPLICATION = 11,
  D3D11_MESSAGE_ID_CORRUPTED_THIS = 12,
  D3D11_MESSAGE_ID_CORRUPTED_PARAMETER1 = 13,
  D3D11_MESSAGE_ID_CORRUPTED_PARAMETER2 = 14,
  D3D11_MESSAGE_ID_CORRUPTED_PARAMETER3 = 15,
  D3D11_MESSAGE_ID_CORRUPTED_PARAMETER4 = 16,
  D3D11_MESSAGE_ID_CORRUPTED_PARAMETER5 = 17,
  D3D11_MESSAGE_ID_CORRUPTED_PARAMETER6 = 18,
  D3D11_MESSAGE_ID_CORRUPTED_PARAMETER7 = 19,
  D3D11_MESSAGE_ID_CORRUPTED_PARAMETER8 = 20,
  D3D11_MESSAGE_ID_CORRUPTED_PARAMETER9 = 21,
  D3D11_MESSAGE_ID_CORRUPTED_PARAMETER10 = 22,
  D3D11_MESSAGE_ID_CORRUPTED_PARAMETER11 = 23,
  D3D11_MESSAGE_ID_CORRUPTED_PARAMETER12 = 24,
  D3D11_MESSAGE_ID_CORRUPTED_PARAMETER13 = 25,
  D3D11_MESSAGE_ID_CORRUPTED_PARAMETER14 = 26,
  D3D11_MESSAGE_ID_CORRUPTED_PARAMETER15 = 27,
  D3D11_MESSAGE_ID_CORRUPTED_MULTITHREADING = 28,
  D3D11_MESSAGE_ID_MESSAGE_REPORTING_OUTOFMEMORY = 29,
  D3D11_MESSAGE_ID_IASETINPUTLAYOUT_UNBINDDELETINGOBJECT = 30,
  D3D11_MESSAGE_ID_IASETVERTEXBUFFERS_UNBINDDELETINGOBJECT = 31,
  D3D11_MESSAGE_ID_IASETINDEXBUFFER_UNBINDDELETINGOBJECT = 32,
  D3D11_MESSAGE_ID_VSSETSHADER_UNBINDDELETINGOBJECT = 33,
  D3D11_MESSAGE_ID_VSSETSHADERRESOURCES_UNBINDDELETINGOBJECT = 34,
  D3D11_MESSAGE_ID_VSSETCONSTANTBUFFERS_UNBINDDELETINGOBJECT = 35,
  D3D11_MESSAGE_ID_VSSETSAMPLERS_UNBINDDELETINGOBJECT = 36,
  D3D11_MESSAGE_ID_GSSETSHADER_UNBINDDELETINGOBJECT = 37,
  D3D11_MESSAGE_ID_GSSETSHADERRESOURCES_UNBINDDELETINGOBJECT = 38,
  D3D11_MESSAGE_ID_GSSETCONSTANTBUFFERS_UNBINDDELETINGOBJECT = 39,
  D3D11_MESSAGE_ID_GSSETSAMPLERS_UNBINDDELETINGOBJECT = 40,
  D3D11_MESSAGE_ID_SOSETTARGETS_UNBINDDELETINGOBJECT = 41,
  D3D11_MESSAGE_ID_PSSETSHADER_UNBINDDELETINGOBJECT = 42,
  D3D11_MESSAGE_ID_PSSETSHADERRESOURCES_UNBINDDELETINGOBJECT = 43,
  D3D11_MESSAGE_ID_PSSETCONSTANTBUFFERS_UNBINDDELETINGOBJECT = 44,
  D3D11_MESSAGE_ID_PSSETSAMPLERS_UNBINDDELETINGOBJECT = 45,
  D3D11_MESSAGE_ID_RSSETSTATE_UNBINDDELETINGOBJECT = 46,
  D3D11_MESSAGE_ID_OMSETBLENDSTATE_UNBINDDELETINGOBJECT = 47,
  D3D11_MESSAGE_ID_OMSETDEPTHSTENCILSTATE_UNBINDDELETINGOBJECT = 48,
  D3D11_MESSAGE_ID_OMSETRENDERTARGETS_UNBINDDELETINGOBJECT = 49,
  D3D11_MESSAGE_ID_SETPREDICATION_UNBINDDELETINGOBJECT = 50,
  D3D11_MESSAGE_ID_GETPRIVATEDATA_MOREDATA = 51,
  D3D11_MESSAGE_ID_SETPRIVATEDATA_INVALIDFREEDATA = 52,
  D3D11_MESSAGE_ID_SETPRIVATEDATA_INVALIDIUNKNOWN = 53,
  D3D11_MESSAGE_ID_SETPRIVATEDATA_INVALIDFLAGS = 54,
  D3D11_MESSAGE_ID_SETPRIVATEDATA_CHANGINGPARAMS = 55,
  D3D11_MESSAGE_ID_SETPRIVATEDATA_OUTOFMEMORY = 56,
  D3D11_MESSAGE_ID_CREATEBUFFER_UNRECOGNIZEDFORMAT = 57,
  D3D11_MESSAGE_ID_CREATEBUFFER_INVALIDSAMPLES = 58,
  D3D11_MESSAGE_ID_CREATEBUFFER_UNRECOGNIZEDUSAGE = 59,
  D3D11_MESSAGE_ID_CREATEBUFFER_UNRECOGNIZEDBINDFLAGS = 60,
  D3D11_MESSAGE_ID_CREATEBUFFER_UNRECOGNIZEDCPUACCESSFLAGS = 61,
  D3D11_MESSAGE_ID_CREATEBUFFER_UNRECOGNIZEDMISCFLAGS = 62,
  D3D11_MESSAGE_ID_CREATEBUFFER_INVALIDCPUACCESSFLAGS = 63,
  D3D11_MESSAGE_ID_CREATEBUFFER_INVALIDBINDFLAGS = 64,
  D3D11_MESSAGE_ID_CREATEBUFFER_INVALIDINITIALDATA = 65,
  D3D11_MESSAGE_ID_CREATEBUFFER_INVALIDDIMENSIONS = 66,
  D3D11_MESSAGE_ID_CREATEBUFFER_INVALIDMIPLEVELS = 67,
  D3D11_MESSAGE_ID_CREATEBUFFER_INVALIDMISCFLAGS = 68,
  D3D11_MESSAGE_ID_CREATEBUFFER_INVALIDARG_RETURN = 69,
  D3D11_MESSAGE_ID_CREATEBUFFER_OUTOFMEMORY_RETURN = 70,
  D3D11_MESSAGE_ID_CREATEBUFFER_NULLDESC = 71,
  D3D11_MESSAGE_ID_CREATEBUFFER_INVALIDCONSTANTBUFFERBINDINGS = 72,
  D3D11_MESSAGE_ID_CREATEBUFFER_LARGEALLOCATION = 73,
  D3D11_MESSAGE_ID_CREATETEXTURE1D_UNRECOGNIZEDFORMAT = 74,
  D3D11_MESSAGE_ID_CREATETEXTURE1D_UNSUPPORTEDFORMAT = 75,
  D3D11_MESSAGE_ID_CREATETEXTURE1D_INVALIDSAMPLES = 76,
  D3D11_MESSAGE_ID_CREATETEXTURE1D_UNRECOGNIZEDUSAGE = 77,
  D3D11_MESSAGE_ID_CREATETEXTURE1D_UNRECOGNIZEDBINDFLAGS = 78,
  D3D11_MESSAGE_ID_CREATETEXTURE1D_UNRECOGNIZEDCPUACCESSFLAGS = 79,
  D3D11_MESSAGE_ID_CREATETEXTURE1D_UNRECOGNIZEDMISCFLAGS = 80,
  D3D11_MESSAGE_ID_CREATETEXTURE1D_INVALIDCPUACCESSFLAGS = 81,
  D3D11_MESSAGE_ID_CREATETEXTURE1D_INVALIDBINDFLAGS = 82,
  D3D11_MESSAGE_ID_CREATETEXTURE1D_INVALIDINITIALDATA = 83,
  D3D11_MESSAGE_ID_CREATETEXTURE1D_INVALIDDIMENSIONS = 84,
  D3D11_MESSAGE_ID_CREATETEXTURE1D_INVALIDMIPLEVELS = 85,
  D3D11_MESSAGE_ID_CREATETEXTURE1D_INVALIDMISCFLAGS = 86,
  D3D11_MESSAGE_ID_CREATETEXTURE1D_INVALIDARG_RETURN = 87,
  D3D11_MESSAGE_ID_CREATETEXTURE1D_OUTOFMEMORY_RETURN = 88,
  D3D11_MESSAGE_ID_CREATETEXTURE1D_NULLDESC = 89,
  D3D11_MESSAGE_ID_CREATETEXTURE1D_LARGEALLOCATION = 90,
  D3D11_MESSAGE_ID_CREATETEXTURE2D_UNRECOGNIZEDFORMAT = 91,
  D3D11_MESSAGE_ID_CREATETEXTURE2D_UNSUPPORTEDFORMAT = 92,
  D3D11_MESSAGE_ID_CREATETEXTURE2D_INVALIDSAMPLES = 93,
  D3D11_MESSAGE_ID_CREATETEXTURE2D_UNRECOGNIZEDUSAGE = 94,
  D3D11_MESSAGE_ID_CREATETEXTURE2D_UNRECOGNIZEDBINDFLAGS = 95,
  D3D11_MESSAGE_ID_CREATETEXTURE2D_UNRECOGNIZEDCPUACCESSFLAGS = 96,
  D3D11_MESSAGE_ID_CREATETEXTURE2D_UNRECOGNIZEDMISCFLAGS = 97,
  D3D11_MESSAGE_ID_CREATETEXTURE2D_INVALIDCPUACCESSFLAGS = 98,
  D3D11_MESSAGE_ID_CREATETEXTURE2D_INVALIDBINDFLAGS = 99,
  D3D11_MESSAGE_ID_CREATETEXTURE2D_INVALIDINITIALDATA = 100,
  D3D11_MESSAGE_ID_CREATETEXTURE2D_INVALIDDIMENSIONS = 101,
  D3D11_MESSAGE_ID_CREATETEXTURE2D_INVALIDMIPLEVELS = 102,
  D3D11_MESSAGE_ID_CREATETEXTURE2D_INVALIDMISCFLAGS = 103,
  D3D11_MESSAGE_ID_CREATETEXTURE2D_INVALIDARG_RETURN = 104,
  D3D11_MESSAGE_ID_CREATETEXTURE2D_OUTOFMEMORY_RETURN = 105,
  D3D11_MESSAGE_ID_CREATETEXTURE2D_NULLDESC = 106,
  D3D11_MESSAGE_ID_CREATETEXTURE2D_LARGEALLOCATION = 107,
  D3D11_MESSAGE_ID_CREATETEXTURE3D_UNRECOGNIZEDFORMAT = 108,
  D3D11_MESSAGE_ID_CREATETEXTURE3D_UNSUPPORTEDFORMAT = 109,
  D3D11_MESSAGE_ID_CREATETEXTURE3D_INVALIDSAMPLES = 110,
  D3D11_MESSAGE_ID_CREATETEXTURE3D_UNRECOGNIZEDUSAGE = 111,
  D3D11_MESSAGE_ID_CREATETEXTURE3D_UNRECOGNIZEDBINDFLAGS = 112,
  D3D11_MESSAGE_ID_CREATETEXTURE3D_UNRECOGNIZEDCPUACCESSFLAGS = 113,
  D3D11_MESSAGE_ID_CREATETEXTURE3D_UNRECOGNIZEDMISCFLAGS = 114,
  D3D11_MESSAGE_ID_CREATETEXTURE3D_INVALIDCPUACCESSFLAGS = 115,
  D3D11_MESSAGE_ID_CREATETEXTURE3D_INVALIDBINDFLAGS = 116,
  D3D11_MESSAGE_ID_CREATETEXTURE3D_INVALIDINITIALDATA = 117,
  D3D11_MESSAGE_ID_CREATETEXTURE3D_INVALIDDIMENSIONS = 118,
  D3D11_MESSAGE_ID_CREATETEXTURE3D_INVALIDMIPLEVELS = 119,
  D3D11_MESSAGE_ID_CREATETEXTURE3D_INVALIDMISCFLAGS = 120,
  D3D11_MESSAGE_ID_CREATETEXTURE3D_INVALIDARG_RETURN = 121,
  D3D11_MESSAGE_ID_CREATETEXTURE3D_OUTOFMEMORY_RETURN = 122,
  D3D11_MESSAGE_ID_CREATETEXTURE3D_NULLDESC = 123,
  D3D11_MESSAGE_ID_CREATETEXTURE3D_LARGEALLOCATION = 124,
  D3D11_MESSAGE_ID_CREATESHADERRESOURCEVIEW_UNRECOGNIZEDFORMAT = 125,
  D3D11_MESSAGE_ID_CREATESHADERRESOURCEVIEW_INVALIDDESC = 126,
  D3D11_MESSAGE_ID_CREATESHADERRESOURCEVIEW_INVALIDFORMAT = 127,
  D3D11_MESSAGE_ID_CREATESHADERRESOURCEVIEW_INVALIDDIMENSIONS = 128,
  D3D11_MESSAGE_ID_CREATESHADERRESOURCEVIEW_INVALIDRESOURCE = 129,
  D3D11_MESSAGE_ID_CREATESHADERRESOURCEVIEW_TOOMANYOBJECTS = 130,
  D3D11_MESSAGE_ID_CREATESHADERRESOURCEVIEW_INVALIDARG_RETURN = 131,
  D3D11_MESSAGE_ID_CREATESHADERRESOURCEVIEW_OUTOFMEMORY_RETURN = 132,
  D3D11_MESSAGE_ID_CREATERENDERTARGETVIEW_UNRECOGNIZEDFORMAT = 133,
  D3D11_MESSAGE_ID_CREATERENDERTARGETVIEW_UNSUPPORTEDFORMAT = 134,
  D3D11_MESSAGE_ID_CREATERENDERTARGETVIEW_INVALIDDESC = 135,
  D3D11_MESSAGE_ID_CREATERENDERTARGETVIEW_INVALIDFORMAT = 136,
  D3D11_MESSAGE_ID_CREATERENDERTARGETVIEW_INVALIDDIMENSIONS = 137,
  D3D11_MESSAGE_ID_CREATERENDERTARGETVIEW_INVALIDRESOURCE = 138,
  D3D11_MESSAGE_ID_CREATERENDERTARGETVIEW_TOOMANYOBJECTS = 139,
  D3D11_MESSAGE_ID_CREATERENDERTARGETVIEW_INVALIDARG_RETURN = 140,
  D3D11_MESSAGE_ID_CREATERENDERTARGETVIEW_OUTOFMEMORY_RETURN = 141,
  D3D11_MESSAGE_ID_CREATEDEPTHSTENCILVIEW_UNRECOGNIZEDFORMAT = 142,
  D3D11_MESSAGE_ID_CREATEDEPTHSTENCILVIEW_INVALIDDESC = 143,
  D3D11_MESSAGE_ID_CREATEDEPTHSTENCILVIEW_INVALIDFORMAT = 144,
  D3D11_MESSAGE_ID_CREATEDEPTHSTENCILVIEW_INVALIDDIMENSIONS = 145,
  D3D11_MESSAGE_ID_CREATEDEPTHSTENCILVIEW_INVALIDRESOURCE = 146,
  D3D11_MESSAGE_ID_CREATEDEPTHSTENCILVIEW_TOOMANYOBJECTS = 147,
  D3D11_MESSAGE_ID_CREATEDEPTHSTENCILVIEW_INVALIDARG_RETURN = 148,
  D3D11_MESSAGE_ID_CREATEDEPTHSTENCILVIEW_OUTOFMEMORY_RETURN = 149,
  D3D11_MESSAGE_ID_CREATEINPUTLAYOUT_OUTOFMEMORY = 150,
  D3D11_MESSAGE_ID_CREATEINPUTLAYOUT_TOOMANYELEMENTS = 151,
  D3D11_MESSAGE_ID_CREATEINPUTLAYOUT_INVALIDFORMAT = 152,
  D3D11_MESSAGE_ID_CREATEINPUTLAYOUT_INCOMPATIBLEFORMAT = 153,
  D3D11_MESSAGE_ID_CREATEINPUTLAYOUT_INVALIDSLOT = 154,
  D3D11_MESSAGE_ID_CREATEINPUTLAYOUT_INVALIDINPUTSLOTCLASS = 155,
  D3D11_MESSAGE_ID_CREATEINPUTLAYOUT_STEPRATESLOTCLASSMISMATCH = 156,
  D3D11_MESSAGE_ID_CREATEINPUTLAYOUT_INVALIDSLOTCLASSCHANGE = 157,
  D3D11_MESSAGE_ID_CREATEINPUTLAYOUT_INVALIDSTEPRATECHANGE = 158,
  D3D11_MESSAGE_ID_CREATEINPUTLAYOUT_INVALIDALIGNMENT = 159,
  D3D11_MESSAGE_ID_CREATEINPUTLAYOUT_DUPLICATESEMANTIC = 160,
  D3D11_MESSAGE_ID_CREATEINPUTLAYOUT_UNPARSEABLEINPUTSIGNATURE = 161,
  D3D11_MESSAGE_ID_CREATEINPUTLAYOUT_NULLSEMANTIC = 162,
  D3D11_MESSAGE_ID_CREATEINPUTLAYOUT_MISSINGELEMENT = 163,
  D3D11_MESSAGE_ID_CREATEINPUTLAYOUT_NULLDESC = 164,
  D3D11_MESSAGE_ID_CREATEVERTEXSHADER_OUTOFMEMORY = 165,
  D3D11_MESSAGE_ID_CREATEVERTEXSHADER_INVALIDSHADERBYTECODE = 166,
  D3D11_MESSAGE_ID_CREATEVERTEXSHADER_INVALIDSHADERTYPE = 167,
  D3D11_MESSAGE_ID_CREATEGEOMETRYSHADER_OUTOFMEMORY = 168,
  D3D11_MESSAGE_ID_CREATEGEOMETRYSHADER_INVALIDSHADERBYTECODE = 169,
  D3D11_MESSAGE_ID_CREATEGEOMETRYSHADER_INVALIDSHADERTYPE = 170,
  D3D11_MESSAGE_ID_CREATEGEOMETRYSHADERWITHSTREAMOUTPUT_OUTOFMEMORY = 171,
  D3D11_MESSAGE_ID_CREATEGEOMETRYSHADERWITHSTREAMOUTPUT_INVALIDSHADERBYTECODE = 172,
  D3D11_MESSAGE_ID_CREATEGEOMETRYSHADERWITHSTREAMOUTPUT_INVALIDSHADERTYPE = 173,
  D3D11_MESSAGE_ID_CREATEGEOMETRYSHADERWITHSTREAMOUTPUT_INVALIDNUMENTRIES = 174,
  D3D11_MESSAGE_ID_CREATEGEOMETRYSHADERWITHSTREAMOUTPUT_OUTPUTSTREAMSTRIDEUNUSED = 175,
  D3D11_MESSAGE_ID_CREATEGEOMETRYSHADERWITHSTREAMOUTPUT_UNEXPECTEDDECL = 176,
  D3D11_MESSAGE_ID_CREATEGEOMETRYSHADERWITHSTREAMOUTPUT_EXPECTEDDECL = 177,
  D3D11_MESSAGE_ID_CREATEGEOMETRYSHADERWITHSTREAMOUTPUT_OUTPUTSLOT0EXPECTED = 178,
  D3D11_MESSAGE_ID_CREATEGEOMETRYSHADERWITHSTREAMOUTPUT_INVALIDOUTPUTSLOT = 179,
  D3D11_MESSAGE_ID_CREATEGEOMETRYSHADERWITHSTREAMOUTPUT_ONLYONEELEMENTPERSLOT = 180,
  D3D11_MESSAGE_ID_CREATEGEOMETRYSHADERWITHSTREAMOUTPUT_INVALIDCOMPONENTCOUNT = 181,
  D3D11_MESSAGE_ID_CREATEGEOMETRYSHADERWITHSTREAMOUTPUT_INVALIDSTARTCOMPONENTANDCOMPONENTCOUNT = 182,
  D3D11_MESSAGE_ID_CREATEGEOMETRYSHADERWITHSTREAMOUTPUT_INVALIDGAPDEFINITION = 183,
  D3D11_MESSAGE_ID_CREATEGEOMETRYSHADERWITHSTREAMOUTPUT_REPEATEDOUTPUT = 184,
  D3D11_MESSAGE_ID_CREATEGEOMETRYSHADERWITHSTREAMOUTPUT_INVALIDOUTPUTSTREAMSTRIDE = 185,
  D3D11_MESSAGE_ID_CREATEGEOMETRYSHADERWITHSTREAMOUTPUT_MISSINGSEMANTIC = 186,
  D3D11_MESSAGE_ID_CREATEGEOMETRYSHADERWITHSTREAMOUTPUT_MASKMISMATCH = 187,
  D3D11_MESSAGE_ID_CREATEGEOMETRYSHADERWITHSTREAMOUTPUT_CANTHAVEONLYGAPS = 188,
  D3D11_MESSAGE_ID_CREATEGEOMETRYSHADERWITHSTREAMOUTPUT_DECLTOOCOMPLEX = 189,
  D3D11_MESSAGE_ID_CREATEGEOMETRYSHADERWITHSTREAMOUTPUT_MISSINGOUTPUTSIGNATURE = 190,
  D3D11_MESSAGE_ID_CREATEPIXELSHADER_OUTOFMEMORY = 191,
  D3D11_MESSAGE_ID_CREATEPIXELSHADER_INVALIDSHADERBYTECODE = 192,
  D3D11_MESSAGE_ID_CREATEPIXELSHADER_INVALIDSHADERTYPE = 193,
  D3D11_MESSAGE_ID_CREATERASTERIZERSTATE_INVALIDFILLMODE = 194,
  D3D11_MESSAGE_ID_CREATERASTERIZERSTATE_INVALIDCULLMODE = 195,
  D3D11_MESSAGE_ID_CREATERASTERIZERSTATE_INVALIDDEPTHBIASCLAMP = 196,
  D3D11_MESSAGE_ID_CREATERASTERIZERSTATE_INVALIDSLOPESCALEDDEPTHBIAS = 197,
  D3D11_MESSAGE_ID_CREATERASTERIZERSTATE_TOOMANYOBJECTS = 198,
  D3D11_MESSAGE_ID_CREATERASTERIZERSTATE_NULLDESC = 199,
  D3D11_MESSAGE_ID_CREATEDEPTHSTENCILSTATE_INVALIDDEPTHWRITEMASK = 200,
  D3D11_MESSAGE_ID_CREATEDEPTHSTENCILSTATE_INVALIDDEPTHFUNC = 201,
  D3D11_MESSAGE_ID_CREATEDEPTHSTENCILSTATE_INVALIDFRONTFACESTENCILFAILOP = 202,
  D3D11_MESSAGE_ID_CREATEDEPTHSTENCILSTATE_INVALIDFRONTFACESTENCILZFAILOP = 203,
  D3D11_MESSAGE_ID_CREATEDEPTHSTENCILSTATE_INVALIDFRONTFACESTENCILPASSOP = 204,
  D3D11_MESSAGE_ID_CREATEDEPTHSTENCILSTATE_INVALIDFRONTFACESTENCILFUNC = 205,
  D3D11_MESSAGE_ID_CREATEDEPTHSTENCILSTATE_INVALIDBACKFACESTENCILFAILOP = 206,
  D3D11_MESSAGE_ID_CREATEDEPTHSTENCILSTATE_INVALIDBACKFACESTENCILZFAILOP = 207,
  D3D11_MESSAGE_ID_CREATEDEPTHSTENCILSTATE_INVALIDBACKFACESTENCILPASSOP = 208,
  D3D11_MESSAGE_ID_CREATEDEPTHSTENCILSTATE_INVALIDBACKFACESTENCILFUNC = 209,
  D3D11_MESSAGE_ID_CREATEDEPTHSTENCILSTATE_TOOMANYOBJECTS = 210,
  D3D11_MESSAGE_ID_CREATEDEPTHSTENCILSTATE_NULLDESC = 211,
  D3D11_MESSAGE_ID_CREATEBLENDSTATE_INVALIDSRCBLEND = 212,
  D3D11_MESSAGE_ID_CREATEBLENDSTATE_INVALIDDESTBLEND = 213,
  D3D11_MESSAGE_ID_CREATEBLENDSTATE_INVALIDBLENDOP = 214,
  D3D11_MESSAGE_ID_CREATEBLENDSTATE_INVALIDSRCBLENDALPHA = 215,
  D3D11_MESSAGE_ID_CREATEBLENDSTATE_INVALIDDESTBLENDALPHA = 216,
  D3D11_MESSAGE_ID_CREATEBLENDSTATE_INVALIDBLENDOPALPHA = 217,
  D3D11_MESSAGE_ID_CREATEBLENDSTATE_INVALIDRENDERTARGETWRITEMASK = 218,
  D3D11_MESSAGE_ID_CREATEBLENDSTATE_TOOMANYOBJECTS = 219,
  D3D11_MESSAGE_ID_CREATEBLENDSTATE_NULLDESC = 220,
  D3D11_MESSAGE_ID_CREATESAMPLERSTATE_INVALIDFILTER = 221,
  D3D11_MESSAGE_ID_CREATESAMPLERSTATE_INVALIDADDRESSU = 222,
  D3D11_MESSAGE_ID_CREATESAMPLERSTATE_INVALIDADDRESSV = 223,
  D3D11_MESSAGE_ID_CREATESAMPLERSTATE_INVALIDADDRESSW = 224,
  D3D11_MESSAGE_ID_CREATESAMPLERSTATE_INVALIDMIPLODBIAS = 225,
  D3D11_MESSAGE_ID_CREATESAMPLERSTATE_INVALIDMAXANISOTROPY = 226,
  D3D11_MESSAGE_ID_CREATESAMPLERSTATE_INVALIDCOMPARISONFUNC = 227,
  D3D11_MESSAGE_ID_CREATESAMPLERSTATE_INVALIDMINLOD = 228,
  D3D11_MESSAGE_ID_CREATESAMPLERSTATE_INVALIDMAXLOD = 229,
  D3D11_MESSAGE_ID_CREATESAMPLERSTATE_TOOMANYOBJECTS = 230,
  D3D11_MESSAGE_ID_CREATESAMPLERSTATE_NULLDESC = 231,
  D3D11_MESSAGE_ID_CREATEQUERYORPREDICATE_INVALIDQUERY = 232,
  D3D11_MESSAGE_ID_CREATEQUERYORPREDICATE_INVALIDMISCFLAGS = 233,
  D3D11_MESSAGE_ID_CREATEQUERYORPREDICATE_UNEXPECTEDMISCFLAG = 234,
  D3D11_MESSAGE_ID_CREATEQUERYORPREDICATE_NULLDESC = 235,
  D3D11_MESSAGE_ID_DEVICE_IASETPRIMITIVETOPOLOGY_TOPOLOGY_UNRECOGNIZED = 236,
  D3D11_MESSAGE_ID_DEVICE_IASETPRIMITIVETOPOLOGY_TOPOLOGY_UNDEFINED = 237,
  D3D11_MESSAGE_ID_IASETVERTEXBUFFERS_INVALIDBUFFER = 238,
  D3D11_MESSAGE_ID_DEVICE_IASETVERTEXBUFFERS_OFFSET_TOO_LARGE = 239,
  D3D11_MESSAGE_ID_DEVICE_IASETVERTEXBUFFERS_BUFFERS_EMPTY = 240,
  D3D11_MESSAGE_ID_IASETINDEXBUFFER_INVALIDBUFFER = 241,
  D3D11_MESSAGE_ID_DEVICE_IASETINDEXBUFFER_FORMAT_INVALID = 242,
  D3D11_MESSAGE_ID_DEVICE_IASETINDEXBUFFER_OFFSET_TOO_LARGE = 243,
  D3D11_MESSAGE_ID_DEVICE_IASETINDEXBUFFER_OFFSET_UNALIGNED = 244,
  D3D11_MESSAGE_ID_DEVICE_VSSETSHADERRESOURCES_VIEWS_EMPTY = 245,
  D3D11_MESSAGE_ID_VSSETCONSTANTBUFFERS_INVALIDBUFFER = 246,
  D3D11_MESSAGE_ID_DEVICE_VSSETCONSTANTBUFFERS_BUFFERS_EMPTY = 247,
  D3D11_MESSAGE_ID_DEVICE_VSSETSAMPLERS_SAMPLERS_EMPTY = 248,
  D3D11_MESSAGE_ID_DEVICE_GSSETSHADERRESOURCES_VIEWS_EMPTY = 249,
  D3D11_MESSAGE_ID_GSSETCONSTANTBUFFERS_INVALIDBUFFER = 250,
  D3D11_MESSAGE_ID_DEVICE_GSSETCONSTANTBUFFERS_BUFFERS_EMPTY = 251,
  D3D11_MESSAGE_ID_DEVICE_GSSETSAMPLERS_SAMPLERS_EMPTY = 252,
  D3D11_MESSAGE_ID_SOSETTARGETS_INVALIDBUFFER = 253,
  D3D11_MESSAGE_ID_DEVICE_SOSETTARGETS_OFFSET_UNALIGNED = 254,
  D3D11_MESSAGE_ID_DEVICE_PSSETSHADERRESOURCES_VIEWS_EMPTY = 255,
  D3D11_MESSAGE_ID_PSSETCONSTANTBUFFERS_INVALIDBUFFER = 256,
  D3D11_MESSAGE_ID_DEVICE_PSSETCONSTANTBUFFERS_BUFFERS_EMPTY = 257,
  D3D11_MESSAGE_ID_DEVICE_PSSETSAMPLERS_SAMPLERS_EMPTY = 258,
  D3D11_MESSAGE_ID_DEVICE_RSSETVIEWPORTS_INVALIDVIEWPORT = 259,
  D3D11_MESSAGE_ID_DEVICE_RSSETSCISSORRECTS_INVALIDSCISSOR = 260,
  D3D11_MESSAGE_ID_CLEARRENDERTARGETVIEW_DENORMFLUSH = 261,
  D3D11_MESSAGE_ID_CLEARDEPTHSTENCILVIEW_DENORMFLUSH = 262,
  D3D11_MESSAGE_ID_CLEARDEPTHSTENCILVIEW_INVALID = 263,
  D3D11_MESSAGE_ID_DEVICE_IAGETVERTEXBUFFERS_BUFFERS_EMPTY = 264,
  D3D11_MESSAGE_ID_DEVICE_VSGETSHADERRESOURCES_VIEWS_EMPTY = 265,
  D3D11_MESSAGE_ID_DEVICE_VSGETCONSTANTBUFFERS_BUFFERS_EMPTY = 266,
  D3D11_MESSAGE_ID_DEVICE_VSGETSAMPLERS_SAMPLERS_EMPTY = 267,
  D3D11_MESSAGE_ID_DEVICE_GSGETSHADERRESOURCES_VIEWS_EMPTY = 268,
  D3D11_MESSAGE_ID_DEVICE_GSGETCONSTANTBUFFERS_BUFFERS_EMPTY = 269,
  D3D11_MESSAGE_ID_DEVICE_GSGETSAMPLERS_SAMPLERS_EMPTY = 270,
  D3D11_MESSAGE_ID_DEVICE_SOGETTARGETS_BUFFERS_EMPTY = 271,
  D3D11_MESSAGE_ID_DEVICE_PSGETSHADERRESOURCES_VIEWS_EMPTY = 272,
  D3D11_MESSAGE_ID_DEVICE_PSGETCONSTANTBUFFERS_BUFFERS_EMPTY = 273,
  D3D11_MESSAGE_ID_DEVICE_PSGETSAMPLERS_SAMPLERS_EMPTY = 274,
  D3D11_MESSAGE_ID_DEVICE_RSGETVIEWPORTS_VIEWPORTS_EMPTY = 275,
  D3D11_MESSAGE_ID_DEVICE_RSGETSCISSORRECTS_RECTS_EMPTY = 276,
  D3D11_MESSAGE_ID_DEVICE_GENERATEMIPS_RESOURCE_INVALID = 277,
  D3D11_MESSAGE_ID_COPYSUBRESOURCEREGION_INVALIDDESTINATIONSUBRESOURCE = 278,
  D3D11_MESSAGE_ID_COPYSUBRESOURCEREGION_INVALIDSOURCESUBRESOURCE = 279,
  D3D11_MESSAGE_ID_COPYSUBRESOURCEREGION_INVALIDSOURCEBOX = 280,
  D3D11_MESSAGE_ID_COPYSUBRESOURCEREGION_INVALIDSOURCE = 281,
  D3D11_MESSAGE_ID_COPYSUBRESOURCEREGION_INVALIDDESTINATIONSTATE = 282,
  D3D11_MESSAGE_ID_COPYSUBRESOURCEREGION_INVALIDSOURCESTATE = 283,
  D3D11_MESSAGE_ID_COPYRESOURCE_INVALIDSOURCE = 284,
  D3D11_MESSAGE_ID_COPYRESOURCE_INVALIDDESTINATIONSTATE = 285,
  D3D11_MESSAGE_ID_COPYRESOURCE_INVALIDSOURCESTATE = 286,
  D3D11_MESSAGE_ID_UPDATESUBRESOURCE_INVALIDDESTINATIONSUBRESOURCE = 287,
  D3D11_MESSAGE_ID_UPDATESUBRESOURCE_INVALIDDESTINATIONBOX = 288,
  D3D11_MESSAGE_ID_UPDATESUBRESOURCE_INVALIDDESTINATIONSTATE = 289,
  D3D11_MESSAGE_ID_DEVICE_RESOLVESUBRESOURCE_DESTINATION_INVALID = 290,
  D3D11_MESSAGE_ID_DEVICE_RESOLVESUBRESOURCE_DESTINATION_SUBRESOURCE_INVALID = 291,
  D3D11_MESSAGE_ID_DEVICE_RESOLVESUBRESOURCE_SOURCE_INVALID = 292,
  D3D11_MESSAGE_ID_DEVICE_RESOLVESUBRESOURCE_SOURCE_SUBRESOURCE_INVALID = 293,
  D3D11_MESSAGE_ID_DEVICE_RESOLVESUBRESOURCE_FORMAT_INVALID = 294,
  D3D11_MESSAGE_ID_BUFFER_MAP_INVALIDMAPTYPE = 295,
  D3D11_MESSAGE_ID_BUFFER_MAP_INVALIDFLAGS = 296,
  D3D11_MESSAGE_ID_BUFFER_MAP_ALREADYMAPPED = 297,
  D3D11_MESSAGE_ID_BUFFER_MAP_DEVICEREMOVED_RETURN = 298,
  D3D11_MESSAGE_ID_BUFFER_UNMAP_NOTMAPPED = 299,
  D3D11_MESSAGE_ID_TEXTURE1D_MAP_INVALIDMAPTYPE = 300,
  D3D11_MESSAGE_ID_TEXTURE1D_MAP_INVALIDSUBRESOURCE = 301,
  D3D11_MESSAGE_ID_TEXTURE1D_MAP_INVALIDFLAGS = 302,
  D3D11_MESSAGE_ID_TEXTURE1D_MAP_ALREADYMAPPED = 303,
  D3D11_MESSAGE_ID_TEXTURE1D_MAP_DEVICEREMOVED_RETURN = 304,
  D3D11_MESSAGE_ID_TEXTURE1D_UNMAP_INVALIDSUBRESOURCE = 305,
  D3D11_MESSAGE_ID_TEXTURE1D_UNMAP_NOTMAPPED = 306,
  D3D11_MESSAGE_ID_TEXTURE2D_MAP_INVALIDMAPTYPE = 307,
  D3D11_MESSAGE_ID_TEXTURE2D_MAP_INVALIDSUBRESOURCE = 308,
  D3D11_MESSAGE_ID_TEXTURE2D_MAP_INVALIDFLAGS = 309,
  D3D11_MESSAGE_ID_TEXTURE2D_MAP_ALREADYMAPPED = 310,
  D3D11_MESSAGE_ID_TEXTURE2D_MAP_DEVICEREMOVED_RETURN = 311,
  D3D11_MESSAGE_ID_TEXTURE2D_UNMAP_INVALIDSUBRESOURCE = 312,
  D3D11_MESSAGE_ID_TEXTURE2D_UNMAP_NOTMAPPED = 313,
  D3D11_MESSAGE_ID_TEXTURE3D_MAP_INVALIDMAPTYPE = 314,
  D3D11_MESSAGE_ID_TEXTURE3D_MAP_INVALIDSUBRESOURCE = 315,
  D3D11_MESSAGE_ID_TEXTURE3D_MAP_INVALIDFLAGS = 316,
  D3D11_MESSAGE_ID_TEXTURE3D_MAP_ALREADYMAPPED = 317,
  D3D11_MESSAGE_ID_TEXTURE3D_MAP_DEVICEREMOVED_RETURN = 318,
  D3D11_MESSAGE_ID_TEXTURE3D_UNMAP_INVALIDSUBRESOURCE = 319,
  D3D11_MESSAGE_ID_TEXTURE3D_UNMAP_NOTMAPPED = 320,
  D3D11_MESSAGE_ID_CHECKFORMATSUPPORT_FORMAT_DEPRECATED = 321,
  D3D11_MESSAGE_ID_CHECKMULTISAMPLEQUALITYLEVELS_FORMAT_DEPRECATED = 322,
  D3D11_MESSAGE_ID_SETEXCEPTIONMODE_UNRECOGNIZEDFLAGS = 323,
  D3D11_MESSAGE_ID_SETEXCEPTIONMODE_INVALIDARG_RETURN = 324,
  D3D11_MESSAGE_ID_SETEXCEPTIONMODE_DEVICEREMOVED_RETURN = 325,
  D3D11_MESSAGE_ID_REF_SIMULATING_INFINITELY_FAST_HARDWARE = 326,
  D3D11_MESSAGE_ID_REF_THREADING_MODE = 327,
  D3D11_MESSAGE_ID_REF_UMDRIVER_EXCEPTION = 328,
  D3D11_MESSAGE_ID_REF_KMDRIVER_EXCEPTION = 329,
  D3D11_MESSAGE_ID_REF_HARDWARE_EXCEPTION = 330,
  D3D11_MESSAGE_ID_REF_ACCESSING_INDEXABLE_TEMP_OUT_OF_RANGE = 331,
  D3D11_MESSAGE_ID_REF_PROBLEM_PARSING_SHADER = 332,
  D3D11_MESSAGE_ID_REF_OUT_OF_MEMORY = 333,
  D3D11_MESSAGE_ID_REF_INFO = 334,
  D3D11_MESSAGE_ID_DEVICE_DRAW_VERTEXPOS_OVERFLOW = 335,
  D3D11_MESSAGE_ID_DEVICE_DRAWINDEXED_INDEXPOS_OVERFLOW = 336,
  D3D11_MESSAGE_ID_DEVICE_DRAWINSTANCED_VERTEXPOS_OVERFLOW = 337,
  D3D11_MESSAGE_ID_DEVICE_DRAWINSTANCED_INSTANCEPOS_OVERFLOW = 338,
  D3D11_MESSAGE_ID_DEVICE_DRAWINDEXEDINSTANCED_INSTANCEPOS_OVERFLOW = 339,
  D3D11_MESSAGE_ID_DEVICE_DRAWINDEXEDINSTANCED_INDEXPOS_OVERFLOW = 340,
  D3D11_MESSAGE_ID_DEVICE_DRAW_VERTEX_SHADER_NOT_SET = 341,
  D3D11_MESSAGE_ID_DEVICE_SHADER_LINKAGE_SEMANTICNAME_NOT_FOUND = 342,
  D3D11_MESSAGE_ID_DEVICE_SHADER_LINKAGE_REGISTERINDEX = 343,
  D3D11_MESSAGE_ID_DEVICE_SHADER_LINKAGE_COMPONENTTYPE = 344,
  D3D11_MESSAGE_ID_DEVICE_SHADER_LINKAGE_REGISTERMASK = 345,
  D3D11_MESSAGE_ID_DEVICE_SHADER_LINKAGE_SYSTEMVALUE = 346,
  D3D11_MESSAGE_ID_DEVICE_SHADER_LINKAGE_NEVERWRITTEN_ALWAYSREADS = 347,
  D3D11_MESSAGE_ID_DEVICE_DRAW_VERTEX_BUFFER_NOT_SET = 348,
  D3D11_MESSAGE_ID_DEVICE_DRAW_INPUTLAYOUT_NOT_SET = 349,
  D3D11_MESSAGE_ID_DEVICE_DRAW_CONSTANT_BUFFER_NOT_SET = 350,
  D3D11_MESSAGE_ID_DEVICE_DRAW_CONSTANT_BUFFER_TOO_SMALL = 351,
  D3D11_MESSAGE_ID_DEVICE_DRAW_SAMPLER_NOT_SET = 352,
  D3D11_MESSAGE_ID_DEVICE_DRAW_SHADERRESOURCEVIEW_NOT_SET = 353,
  D3D11_MESSAGE_ID_DEVICE_DRAW_VIEW_DIMENSION_MISMATCH = 354,
  D3D11_MESSAGE_ID_DEVICE_DRAW_VERTEX_BUFFER_STRIDE_TOO_SMALL = 355,
  D3D11_MESSAGE_ID_DEVICE_DRAW_VERTEX_BUFFER_TOO_SMALL = 356,
  D3D11_MESSAGE_ID_DEVICE_DRAW_INDEX_BUFFER_NOT_SET = 357,
  D3D11_MESSAGE_ID_DEVICE_DRAW_INDEX_BUFFER_FORMAT_INVALID = 358,
  D3D11_MESSAGE_ID_DEVICE_DRAW_INDEX_BUFFER_TOO_SMALL = 359,
  D3D11_MESSAGE_ID_DEVICE_DRAW_GS_INPUT_PRIMITIVE_MISMATCH = 360,
  D3D11_MESSAGE_ID_DEVICE_DRAW_RESOURCE_RETURN_TYPE_MISMATCH = 361,
  D3D11_MESSAGE_ID_DEVICE_DRAW_POSITION_NOT_PRESENT = 362,
  D3D11_MESSAGE_ID_DEVICE_DRAW_OUTPUT_STREAM_NOT_SET = 363,
  D3D11_MESSAGE_ID_DEVICE_DRAW_BOUND_RESOURCE_MAPPED = 364,
  D3D11_MESSAGE_ID_DEVICE_DRAW_INVALID_PRIMITIVETOPOLOGY = 365,
  D3D11_MESSAGE_ID_DEVICE_DRAW_VERTEX_OFFSET_UNALIGNED = 366,
  D3D11_MESSAGE_ID_DEVICE_DRAW_VERTEX_STRIDE_UNALIGNED = 367,
  D3D11_MESSAGE_ID_DEVICE_DRAW_INDEX_OFFSET_UNALIGNED = 368,
  D3D11_MESSAGE_ID_DEVICE_DRAW_OUTPUT_STREAM_OFFSET_UNALIGNED = 369,
  D3D11_MESSAGE_ID_DEVICE_DRAW_RESOURCE_FORMAT_LD_UNSUPPORTED = 370,
  D3D11_MESSAGE_ID_DEVICE_DRAW_RESOURCE_FORMAT_SAMPLE_UNSUPPORTED = 371,
  D3D11_MESSAGE_ID_DEVICE_DRAW_RESOURCE_FORMAT_SAMPLE_C_UNSUPPORTED = 372,
  D3D11_MESSAGE_ID_DEVICE_DRAW_RESOURCE_MULTISAMPLE_UNSUPPORTED = 373,
  D3D11_MESSAGE_ID_DEVICE_DRAW_SO_TARGETS_BOUND_WITHOUT_SOURCE = 374,
  D3D11_MESSAGE_ID_DEVICE_DRAW_SO_STRIDE_LARGER_THAN_BUFFER = 375,
  D3D11_MESSAGE_ID_DEVICE_DRAW_OM_RENDER_TARGET_DOES_NOT_SUPPORT_BLENDING = 376,
  D3D11_MESSAGE_ID_DEVICE_DRAW_OM_DUAL_SOURCE_BLENDING_CAN_ONLY_HAVE_RENDER_TARGET_0 = 377,
  D3D11_MESSAGE_ID_DEVICE_REMOVAL_PROCESS_AT_FAULT = 378,
  D3D11_MESSAGE_ID_DEVICE_REMOVAL_PROCESS_POSSIBLY_AT_FAULT = 379,
  D3D11_MESSAGE_ID_DEVICE_REMOVAL_PROCESS_NOT_AT_FAULT = 380,
  D3D11_MESSAGE_ID_DEVICE_OPEN_SHARED_RESOURCE_INVALIDARG_RETURN = 381,
  D3D11_MESSAGE_ID_DEVICE_OPEN_SHARED_RESOURCE_OUTOFMEMORY_RETURN = 382,
  D3D11_MESSAGE_ID_DEVICE_OPEN_SHARED_RESOURCE_BADINTERFACE_RETURN = 383,
  D3D11_MESSAGE_ID_DEVICE_DRAW_VIEWPORT_NOT_SET = 384,
  D3D11_MESSAGE_ID_CREATEINPUTLAYOUT_TRAILING_DIGIT_IN_SEMANTIC = 385,
  D3D11_MESSAGE_ID_CREATEGEOMETRYSHADERWITHSTREAMOUTPUT_TRAILING_DIGIT_IN_SEMANTIC = 386,
  D3D11_MESSAGE_ID_DEVICE_RSSETVIEWPORTS_DENORMFLUSH = 387,
  D3D11_MESSAGE_ID_OMSETRENDERTARGETS_INVALIDVIEW = 388,
  D3D11_MESSAGE_ID_DEVICE_SETTEXTFILTERSIZE_INVALIDDIMENSIONS = 389,
  D3D11_MESSAGE_ID_DEVICE_DRAW_SAMPLER_MISMATCH = 390,
  D3D11_MESSAGE_ID_CREATEINPUTLAYOUT_TYPE_MISMATCH = 391,
  D3D11_MESSAGE_ID_BLENDSTATE_GETDESC_LEGACY = 392,
  D3D11_MESSAGE_ID_SHADERRESOURCEVIEW_GETDESC_LEGACY = 393,
  D3D11_MESSAGE_ID_CREATEQUERY_OUTOFMEMORY_RETURN = 394,
  D3D11_MESSAGE_ID_CREATEPREDICATE_OUTOFMEMORY_RETURN = 395,
  D3D11_MESSAGE_ID_CREATECOUNTER_OUTOFRANGE_COUNTER = 396,
  D3D11_MESSAGE_ID_CREATECOUNTER_SIMULTANEOUS_ACTIVE_COUNTERS_EXHAUSTED = 397,
  D3D11_MESSAGE_ID_CREATECOUNTER_UNSUPPORTED_WELLKNOWN_COUNTER = 398,
  D3D11_MESSAGE_ID_CREATECOUNTER_OUTOFMEMORY_RETURN = 399,
  D3D11_MESSAGE_ID_CREATECOUNTER_NONEXCLUSIVE_RETURN = 400,
  D3D11_MESSAGE_ID_CREATECOUNTER_NULLDESC = 401,
  D3D11_MESSAGE_ID_CHECKCOUNTER_OUTOFRANGE_COUNTER = 402,
  D3D11_MESSAGE_ID_CHECKCOUNTER_UNSUPPORTED_WELLKNOWN_COUNTER = 403,
  D3D11_MESSAGE_ID_SETPREDICATION_INVALID_PREDICATE_STATE = 404,
  D3D11_MESSAGE_ID_QUERY_BEGIN_UNSUPPORTED = 405,
  D3D11_MESSAGE_ID_PREDICATE_BEGIN_DURING_PREDICATION = 406,
  D3D11_MESSAGE_ID_QUERY_BEGIN_DUPLICATE = 407,
  D3D11_MESSAGE_ID_QUERY_BEGIN_ABANDONING_PREVIOUS_RESULTS = 408,
  D3D11_MESSAGE_ID_PREDICATE_END_DURING_PREDICATION = 409,
  D3D11_MESSAGE_ID_QUERY_END_ABANDONING_PREVIOUS_RESULTS = 410,
  D3D11_MESSAGE_ID_QUERY_END_WITHOUT_BEGIN = 411,
  D3D11_MESSAGE_ID_QUERY_GETDATA_INVALID_DATASIZE = 412,
  D3D11_MESSAGE_ID_QUERY_GETDATA_INVALID_FLAGS = 413,
  D3D11_MESSAGE_ID_QUERY_GETDATA_INVALID_CALL = 414,
  D3D11_MESSAGE_ID_DEVICE_DRAW_PS_OUTPUT_TYPE_MISMATCH = 415,
  D3D11_MESSAGE_ID_DEVICE_DRAW_RESOURCE_FORMAT_GATHER_UNSUPPORTED = 416,
  D3D11_MESSAGE_ID_DEVICE_DRAW_INVALID_USE_OF_CENTER_MULTISAMPLE_PATTERN = 417,
  D3D11_MESSAGE_ID_DEVICE_IASETVERTEXBUFFERS_STRIDE_TOO_LARGE = 418,
  D3D11_MESSAGE_ID_DEVICE_IASETVERTEXBUFFERS_INVALIDRANGE = 419,
  D3D11_MESSAGE_ID_CREATEINPUTLAYOUT_EMPTY_LAYOUT = 420,
  D3D11_MESSAGE_ID_DEVICE_DRAW_RESOURCE_SAMPLE_COUNT_MISMATCH = 421,
  D3D11_MESSAGE_ID_D3D10_MESSAGES_END = 422,
  D3D11_MESSAGE_ID_D3D10L9_MESSAGES_START = 0x100000,
  D3D11_MESSAGE_ID_CREATEDEPTHSTENCILSTATE_STENCIL_NO_TWO_SIDED = 0x100001,
  D3D11_MESSAGE_ID_CREATERASTERIZERSTATE_DepthBiasClamp_NOT_SUPPORTED = 0x100002,
  D3D11_MESSAGE_ID_CREATESAMPLERSTATE_NO_COMPARISON_SUPPORT = 0x100003,
  D3D11_MESSAGE_ID_CREATESAMPLERSTATE_EXCESSIVE_ANISOTROPY = 0x100004,
  D3D11_MESSAGE_ID_CREATESAMPLERSTATE_BORDER_OUT_OF_RANGE = 0x100005,
  D3D11_MESSAGE_ID_VSSETSAMPLERS_NOT_SUPPORTED = 0x100006,
  D3D11_MESSAGE_ID_VSSETSAMPLERS_TOO_MANY_SAMPLERS = 0x100007,
  D3D11_MESSAGE_ID_PSSETSAMPLERS_TOO_MANY_SAMPLERS = 0x100008,
  D3D11_MESSAGE_ID_CREATERESOURCE_NO_ARRAYS = 0x100009,
  D3D11_MESSAGE_ID_CREATERESOURCE_NO_VB_AND_IB_BIND = 0x10000a,
  D3D11_MESSAGE_ID_CREATERESOURCE_NO_TEXTURE_1D = 0x10000b,
  D3D11_MESSAGE_ID_CREATERESOURCE_DIMENSION_OUT_OF_RANGE = 0x10000c,
  D3D11_MESSAGE_ID_CREATERESOURCE_NOT_BINDABLE_AS_SHADER_RESOURCE = 0x10000d,
  D3D11_MESSAGE_ID_OMSETRENDERTARGETS_TOO_MANY_RENDER_TARGETS = 0x10000e,
  D3D11_MESSAGE_ID_OMSETRENDERTARGETS_NO_DIFFERING_BIT_DEPTHS = 0x10000f,
  D3D11_MESSAGE_ID_IASETVERTEXBUFFERS_BAD_BUFFER_INDEX = 0x100010,
  D3D11_MESSAGE_ID_DEVICE_RSSETVIEWPORTS_TOO_MANY_VIEWPORTS = 0x100011,
  D3D11_MESSAGE_ID_DEVICE_IASETPRIMITIVETOPOLOGY_ADJACENCY_UNSUPPORTED = 0x100012,
  D3D11_MESSAGE_ID_DEVICE_RSSETSCISSORRECTS_TOO_MANY_SCISSORS = 0x100013,
  D3D11_MESSAGE_ID_COPYRESOURCE_ONLY_TEXTURE_2D_WITHIN_GPU_MEMORY = 0x100014,
  D3D11_MESSAGE_ID_COPYRESOURCE_NO_TEXTURE_3D_READBACK = 0x100015,
  D3D11_MESSAGE_ID_COPYRESOURCE_NO_TEXTURE_ONLY_READBACK = 0x100016,
  D3D11_MESSAGE_ID_CREATEINPUTLAYOUT_UNSUPPORTED_FORMAT = 0x100017,
  D3D11_MESSAGE_ID_CREATEBLENDSTATE_NO_ALPHA_TO_COVERAGE = 0x100018,
  D3D11_MESSAGE_ID_CREATERASTERIZERSTATE_DepthClipEnable_MUST_BE_TRUE = 0x100019,
  D3D11_MESSAGE_ID_DRAWINDEXED_STARTINDEXLOCATION_MUST_BE_POSITIVE = 0x10001a,
  D3D11_MESSAGE_ID_CREATESHADERRESOURCEVIEW_MUST_USE_LOWEST_LOD = 0x10001b,
  D3D11_MESSAGE_ID_CREATESAMPLERSTATE_MINLOD_MUST_NOT_BE_FRACTIONAL = 0x10001c,
  D3D11_MESSAGE_ID_CREATESAMPLERSTATE_MAXLOD_MUST_BE_FLT_MAX = 0x10001d,
  D3D11_MESSAGE_ID_CREATESHADERRESOURCEVIEW_FIRSTARRAYSLICE_MUST_BE_ZERO = 0x10001e,
  D3D11_MESSAGE_ID_CREATESHADERRESOURCEVIEW_CUBES_MUST_HAVE_6_SIDES = 0x10001f,
  D3D11_MESSAGE_ID_CREATERESOURCE_NOT_BINDABLE_AS_RENDER_TARGET = 0x100020,
  D3D11_MESSAGE_ID_CREATERESOURCE_NO_DWORD_INDEX_BUFFER = 0x100021,
  D3D11_MESSAGE_ID_CREATERESOURCE_MSAA_PRECLUDES_SHADER_RESOURCE = 0x100022,
  D3D11_MESSAGE_ID_CREATERESOURCE_PRESENTATION_PRECLUDES_SHADER_RESOURCE = 0x100023,
  D3D11_MESSAGE_ID_CREATEBLENDSTATE_NO_INDEPENDENT_BLEND_ENABLE = 0x100024,
  D3D11_MESSAGE_ID_CREATEBLENDSTATE_NO_INDEPENDENT_WRITE_MASKS = 0x100025,
  D3D11_MESSAGE_ID_CREATERESOURCE_NO_STREAM_OUT = 0x100026,
  D3D11_MESSAGE_ID_CREATERESOURCE_ONLY_VB_IB_FOR_BUFFERS = 0x100027,
  D3D11_MESSAGE_ID_CREATERESOURCE_NO_AUTOGEN_FOR_VOLUMES = 0x100028,
  D3D11_MESSAGE_ID_CREATERESOURCE_DXGI_FORMAT_R8G8B8A8_CANNOT_BE_SHARED = 0x100029,
  D3D11_MESSAGE_ID_VSSHADERRESOURCES_NOT_SUPPORTED = 0x10002a,
  D3D11_MESSAGE_ID_GEOMETRY_SHADER_NOT_SUPPORTED = 0x10002b,
  D3D11_MESSAGE_ID_STREAM_OUT_NOT_SUPPORTED = 0x10002c,
  D3D11_MESSAGE_ID_TEXT_FILTER_NOT_SUPPORTED = 0x10002d,
  D3D11_MESSAGE_ID_CREATEBLENDSTATE_NO_SEPARATE_ALPHA_BLEND = 0x10002e,
  D3D11_MESSAGE_ID_CREATEBLENDSTATE_NO_MRT_BLEND = 0x10002f,
  D3D11_MESSAGE_ID_CREATEBLENDSTATE_OPERATION_NOT_SUPPORTED = 0x100030,
  D3D11_MESSAGE_ID_CREATESAMPLERSTATE_NO_MIRRORONCE = 0x100031,
  D3D11_MESSAGE_ID_DRAWINSTANCED_NOT_SUPPORTED = 0x100032,
  D3D11_MESSAGE_ID_DRAWINDEXEDINSTANCED_NOT_SUPPORTED_BELOW_9_3 = 0x100033,
  D3D11_MESSAGE_ID_DRAWINDEXED_POINTLIST_UNSUPPORTED = 0x100034,
  D3D11_MESSAGE_ID_SETBLENDSTATE_SAMPLE_MASK_CANNOT_BE_ZERO = 0x100035,
  D3D11_MESSAGE_ID_CREATERESOURCE_DIMENSION_EXCEEDS_FEATURE_LEVEL_DEFINITION = 0x100036,
  D3D11_MESSAGE_ID_CREATERESOURCE_ONLY_SINGLE_MIP_LEVEL_DEPTH_STENCIL_SUPPORTED = 0x100037,
  D3D11_MESSAGE_ID_DEVICE_RSSETSCISSORRECTS_NEGATIVESCISSOR = 0x100038,
  D3D11_MESSAGE_ID_SLOT_ZERO_MUST_BE_D3D10_INPUT_PER_VERTEX_DATA = 0x100039,
  D3D11_MESSAGE_ID_CREATERESOURCE_NON_POW_2_MIPMAP = 0x10003a,
  D3D11_MESSAGE_ID_CREATESAMPLERSTATE_BORDER_NOT_SUPPORTED = 0x10003b,
  D3D11_MESSAGE_ID_OMSETRENDERTARGETS_NO_SRGB_MRT = 0x10003c,
  D3D11_MESSAGE_ID_D3D10L9_MESSAGES_END = 0x10003d,
  D3D11_MESSAGE_ID_D3D11_MESSAGES_START = 0x200000,
  D3D11_MESSAGE_ID_CREATEDEPTHSTENCILVIEW_INVALIDFLAGS = 0x200001,
  D3D11_MESSAGE_ID_CREATEVERTEXSHADER_INVALIDCLASSLINKAGE = 0x200002,
  D3D11_MESSAGE_ID_CREATEGEOMETRYSHADER_INVALIDCLASSLINKAGE = 0x200003,
  D3D11_MESSAGE_ID_CREATEGEOMETRYSHADERWITHSTREAMOUTPUT_INVALIDNUMSTREAMS = 0x200004,
  D3D11_MESSAGE_ID_CREATEGEOMETRYSHADERWITHSTREAMOUTPUT_INVALIDSTREAMTORASTERIZER = 0x200005,
  D3D11_MESSAGE_ID_CREATEGEOMETRYSHADERWITHSTREAMOUTPUT_UNEXPECTEDSTREAMS = 0x200006,
  D3D11_MESSAGE_ID_CREATEGEOMETRYSHADERWITHSTREAMOUTPUT_INVALIDCLASSLINKAGE = 0x200007,
  D3D11_MESSAGE_ID_CREATEPIXELSHADER_INVALIDCLASSLINKAGE = 0x200008,
  D3D11_MESSAGE_ID_CREATEDEFERREDCONTEXT_INVALID_COMMANDLISTFLAGS = 0x200009,
  D3D11_MESSAGE_ID_CREATEDEFERREDCONTEXT_SINGLETHREADED = 0x20000a,
  D3D11_MESSAGE_ID_CREATEDEFERREDCONTEXT_INVALIDARG_RETURN = 0x20000b,
  D3D11_MESSAGE_ID_CREATEDEFERREDCONTEXT_INVALID_CALL_RETURN = 0x20000c,
  D3D11_MESSAGE_ID_CREATEDEFERREDCONTEXT_OUTOFMEMORY_RETURN = 0x20000d,
  D3D11_MESSAGE_ID_FINISHDISPLAYLIST_ONIMMEDIATECONTEXT = 0x20000e,
  D3D11_MESSAGE_ID_FINISHDISPLAYLIST_OUTOFMEMORY_RETURN = 0x20000f,
  D3D11_MESSAGE_ID_FINISHDISPLAYLIST_INVALID_CALL_RETURN = 0x200010,
  D3D11_MESSAGE_ID_CREATEGEOMETRYSHADERWITHSTREAMOUTPUT_INVALIDSTREAM = 0x200011,
  D3D11_MESSAGE_ID_CREATEGEOMETRYSHADERWITHSTREAMOUTPUT_UNEXPECTEDENTRIES = 0x200012,
  D3D11_MESSAGE_ID_CREATEGEOMETRYSHADERWITHSTREAMOUTPUT_UNEXPECTEDSTRIDES = 0x200013,
  D3D11_MESSAGE_ID_CREATEGEOMETRYSHADERWITHSTREAMOUTPUT_INVALIDNUMSTRIDES = 0x200014,
  D3D11_MESSAGE_ID_DEVICE_HSSETSHADERRESOURCES_HAZARD = 0x200015,
  D3D11_MESSAGE_ID_DEVICE_HSSETCONSTANTBUFFERS_HAZARD = 0x200016,
  D3D11_MESSAGE_ID_HSSETSHADERRESOURCES_UNBINDDELETINGOBJECT = 0x200017,
  D3D11_MESSAGE_ID_HSSETCONSTANTBUFFERS_UNBINDDELETINGOBJECT = 0x200018,
  D3D11_MESSAGE_ID_CREATEHULLSHADER_INVALIDCALL = 0x200019,
  D3D11_MESSAGE_ID_CREATEHULLSHADER_OUTOFMEMORY = 0x20001a,
  D3D11_MESSAGE_ID_CREATEHULLSHADER_INVALIDSHADERBYTECODE = 0x20001b,
  D3D11_MESSAGE_ID_CREATEHULLSHADER_INVALIDSHADERTYPE = 0x20001c,
  D3D11_MESSAGE_ID_CREATEHULLSHADER_INVALIDCLASSLINKAGE = 0x20001d,
  D3D11_MESSAGE_ID_DEVICE_HSSETSHADERRESOURCES_VIEWS_EMPTY = 0x20001e,
  D3D11_MESSAGE_ID_HSSETCONSTANTBUFFERS_INVALIDBUFFER = 0x20001f,
  D3D11_MESSAGE_ID_DEVICE_HSSETCONSTANTBUFFERS_BUFFERS_EMPTY = 0x200020,
  D3D11_MESSAGE_ID_DEVICE_HSSETSAMPLERS_SAMPLERS_EMPTY = 0x200021,
  D3D11_MESSAGE_ID_DEVICE_HSGETSHADERRESOURCES_VIEWS_EMPTY = 0x200022,
  D3D11_MESSAGE_ID_DEVICE_HSGETCONSTANTBUFFERS_BUFFERS_EMPTY = 0x200023,
  D3D11_MESSAGE_ID_DEVICE_HSGETSAMPLERS_SAMPLERS_EMPTY = 0x200024,
  D3D11_MESSAGE_ID_DEVICE_DSSETSHADERRESOURCES_HAZARD = 0x200025,
  D3D11_MESSAGE_ID_DEVICE_DSSETCONSTANTBUFFERS_HAZARD = 0x200026,
  D3D11_MESSAGE_ID_DSSETSHADERRESOURCES_UNBINDDELETINGOBJECT = 0x200027,
  D3D11_MESSAGE_ID_DSSETCONSTANTBUFFERS_UNBINDDELETINGOBJECT = 0x200028,
  D3D11_MESSAGE_ID_CREATEDOMAINSHADER_INVALIDCALL = 0x200029,
  D3D11_MESSAGE_ID_CREATEDOMAINSHADER_OUTOFMEMORY = 0x20002a,
  D3D11_MESSAGE_ID_CREATEDOMAINSHADER_INVALIDSHADERBYTECODE = 0x20002b,
  D3D11_MESSAGE_ID_CREATEDOMAINSHADER_INVALIDSHADERTYPE = 0x20002c,
  D3D11_MESSAGE_ID_CREATEDOMAINSHADER_INVALIDCLASSLINKAGE = 0x20002d,
  D3D11_MESSAGE_ID_DEVICE_DSSETSHADERRESOURCES_VIEWS_EMPTY = 0x20002e,
  D3D11_MESSAGE_ID_DSSETCONSTANTBUFFERS_INVALIDBUFFER = 0x20002f,
  D3D11_MESSAGE_ID_DEVICE_DSSETCONSTANTBUFFERS_BUFFERS_EMPTY = 0x200030,
  D3D11_MESSAGE_ID_DEVICE_DSSETSAMPLERS_SAMPLERS_EMPTY = 0x200031,
  D3D11_MESSAGE_ID_DEVICE_DSGETSHADERRESOURCES_VIEWS_EMPTY = 0x200032,
  D3D11_MESSAGE_ID_DEVICE_DSGETCONSTANTBUFFERS_BUFFERS_EMPTY = 0x200033,
  D3D11_MESSAGE_ID_DEVICE_DSGETSAMPLERS_SAMPLERS_EMPTY = 0x200034,
  D3D11_MESSAGE_ID_DEVICE_DRAW_HS_XOR_DS_MISMATCH = 0x200035,
  D3D11_MESSAGE_ID_DEFERRED_CONTEXT_REMOVAL_PROCESS_AT_FAULT = 0x200036,
  D3D11_MESSAGE_ID_DEVICE_DRAWINDIRECT_INVALID_ARG_BUFFER = 0x200037,
  D3D11_MESSAGE_ID_DEVICE_DRAWINDIRECT_OFFSET_UNALIGNED = 0x200038,
  D3D11_MESSAGE_ID_DEVICE_DRAWINDIRECT_OFFSET_OVERFLOW = 0x200039,
  D3D11_MESSAGE_ID_RESOURCE_MAP_INVALIDMAPTYPE = 0x20003a,
  D3D11_MESSAGE_ID_RESOURCE_MAP_INVALIDSUBRESOURCE = 0x20003b,
  D3D11_MESSAGE_ID_RESOURCE_MAP_INVALIDFLAGS = 0x20003c,
  D3D11_MESSAGE_ID_RESOURCE_MAP_ALREADYMAPPED = 0x20003d,
  D3D11_MESSAGE_ID_RESOURCE_MAP_DEVICEREMOVED_RETURN = 0x20003e,
  D3D11_MESSAGE_ID_RESOURCE_MAP_OUTOFMEMORY_RETURN = 0x20003f,
  D3D11_MESSAGE_ID_RESOURCE_MAP_WITHOUT_INITIAL_DISCARD = 0x200040,
  D3D11_MESSAGE_ID_RESOURCE_UNMAP_INVALIDSUBRESOURCE = 0x200041,
  D3D11_MESSAGE_ID_RESOURCE_UNMAP_NOTMAPPED = 0x200042,
  D3D11_MESSAGE_ID_DEVICE_DRAW_RASTERIZING_CONTROL_POINTS = 0x200043,
  D3D11_MESSAGE_ID_DEVICE_IASETPRIMITIVETOPOLOGY_TOPOLOGY_UNSUPPORTED = 0x200044,
  D3D11_MESSAGE_ID_DEVICE_DRAW_HS_DS_SIGNATURE_MISMATCH = 0x200045,
  D3D11_MESSAGE_ID_DEVICE_DRAW_HULL_SHADER_INPUT_TOPOLOGY_MISMATCH = 0x200046,
  D3D11_MESSAGE_ID_DEVICE_DRAW_HS_DS_CONTROL_POINT_COUNT_MISMATCH = 0x200047,
  D3D11_MESSAGE_ID_DEVICE_DRAW_HS_DS_TESSELLATOR_DOMAIN_MISMATCH = 0x200048,
  D3D11_MESSAGE_ID_CREATE_CONTEXT = 0x200049,
  D3D11_MESSAGE_ID_LIVE_CONTEXT = 0x20004a,
  D3D11_MESSAGE_ID_DESTROY_CONTEXT = 0x20004b,
  D3D11_MESSAGE_ID_CREATE_BUFFER = 0x20004c,
  D3D11_MESSAGE_ID_LIVE_BUFFER = 0x20004d,
  D3D11_MESSAGE_ID_DESTROY_BUFFER = 0x20004e,
  D3D11_MESSAGE_ID_CREATE_TEXTURE1D = 0x20004f,
  D3D11_MESSAGE_ID_LIVE_TEXTURE1D = 0x200050,
  D3D11_MESSAGE_ID_DESTROY_TEXTURE1D = 0x200051,
  D3D11_MESSAGE_ID_CREATE_TEXTURE2D = 0x200052,
  D3D11_MESSAGE_ID_LIVE_TEXTURE2D = 0x200053,
  D3D11_MESSAGE_ID_DESTROY_TEXTURE2D = 0x200054,
  D3D11_MESSAGE_ID_CREATE_TEXTURE3D = 0x200055,
  D3D11_MESSAGE_ID_LIVE_TEXTURE3D = 0x200056,
  D3D11_MESSAGE_ID_DESTROY_TEXTURE3D = 0x200057,
  D3D11_MESSAGE_ID_CREATE_SHADERRESOURCEVIEW = 0x200058,
  D3D11_MESSAGE_ID_LIVE_SHADERRESOURCEVIEW = 0x200059,
  D3D11_MESSAGE_ID_DESTROY_SHADERRESOURCEVIEW = 0x20005a,
  D3D11_MESSAGE_ID_CREATE_RENDERTARGETVIEW = 0x20005b,
  D3D11_MESSAGE_ID_LIVE_RENDERTARGETVIEW = 0x20005c,
  D3D11_MESSAGE_ID_DESTROY_RENDERTARGETVIEW = 0x20005d,
  D3D11_MESSAGE_ID_CREATE_DEPTHSTENCILVIEW = 0x20005e,
  D3D11_MESSAGE_ID_LIVE_DEPTHSTENCILVIEW = 0x20005f,
  D3D11_MESSAGE_ID_DESTROY_DEPTHSTENCILVIEW = 0x200060,
  D3D11_MESSAGE_ID_CREATE_VERTEXSHADER = 0x200061,
  D3D11_MESSAGE_ID_LIVE_VERTEXSHADER = 0x200062,
  D3D11_MESSAGE_ID_DESTROY_VERTEXSHADER = 0x200063,
  D3D11_MESSAGE_ID_CREATE_HULLSHADER = 0x200064,
  D3D11_MESSAGE_ID_LIVE_HULLSHADER = 0x200065,
  D3D11_MESSAGE_ID_DESTROY_HULLSHADER = 0x200066,
  D3D11_MESSAGE_ID_CREATE_DOMAINSHADER = 0x200067,
  D3D11_MESSAGE_ID_LIVE_DOMAINSHADER = 0x200068,
  D3D11_MESSAGE_ID_DESTROY_DOMAINSHADER = 0x200069,
  D3D11_MESSAGE_ID_CREATE_GEOMETRYSHADER = 0x20006a,
  D3D11_MESSAGE_ID_LIVE_GEOMETRYSHADER = 0x20006b,
  D3D11_MESSAGE_ID_DESTROY_GEOMETRYSHADER = 0x20006c,
  D3D11_MESSAGE_ID_CREATE_PIXELSHADER = 0x20006d,
  D3D11_MESSAGE_ID_LIVE_PIXELSHADER = 0x20006e,
  D3D11_MESSAGE_ID_DESTROY_PIXELSHADER = 0x20006f,
  D3D11_MESSAGE_ID_CREATE_INPUTLAYOUT = 0x200070,
  D3D11_MESSAGE_ID_LIVE_INPUTLAYOUT = 0x200071,
  D3D11_MESSAGE_ID_DESTROY_INPUTLAYOUT = 0x200072,
  D3D11_MESSAGE_ID_CREATE_SAMPLER = 0x200073,
  D3D11_MESSAGE_ID_LIVE_SAMPLER = 0x200074,
  D3D11_MESSAGE_ID_DESTROY_SAMPLER = 0x200075,
  D3D11_MESSAGE_ID_CREATE_BLENDSTATE = 0x200076,
  D3D11_MESSAGE_ID_LIVE_BLENDSTATE = 0x200077,
  D3D11_MESSAGE_ID_DESTROY_BLENDSTATE = 0x200078,
  D3D11_MESSAGE_ID_CREATE_DEPTHSTENCILSTATE = 0x200079,
  D3D11_MESSAGE_ID_LIVE_DEPTHSTENCILSTATE = 0x20007a,
  D3D11_MESSAGE_ID_DESTROY_DEPTHSTENCILSTATE = 0x20007b,
  D3D11_MESSAGE_ID_CREATE_RASTERIZERSTATE = 0x20007c,
  D3D11_MESSAGE_ID_LIVE_RASTERIZERSTATE = 0x20007d,
  D3D11_MESSAGE_ID_DESTROY_RASTERIZERSTATE = 0x20007e,
  D3D11_MESSAGE_ID_CREATE_QUERY = 0x20007f,
  D3D11_MESSAGE_ID_LIVE_QUERY = 0x200080,
  D3D11_MESSAGE_ID_DESTROY_QUERY = 0x200081,
  D3D11_MESSAGE_ID_CREATE_PREDICATE = 0x200082,
  D3D11_MESSAGE_ID_LIVE_PREDICATE = 0x200083,
  D3D11_MESSAGE_ID_DESTROY_PREDICATE = 0x200084,
  D3D11_MESSAGE_ID_CREATE_COUNTER = 0x200085,
  D3D11_MESSAGE_ID_LIVE_COUNTER = 0x200086,
  D3D11_MESSAGE_ID_DESTROY_COUNTER = 0x200087,
  D3D11_MESSAGE_ID_CREATE_COMMANDLIST = 0x200088,
  D3D11_MESSAGE_ID_LIVE_COMMANDLIST = 0x200089,
  D3D11_MESSAGE_ID_DESTROY_COMMANDLIST = 0x20008a,
  D3D11_MESSAGE_ID_CREATE_CLASSINSTANCE = 0x20008b,
  D3D11_MESSAGE_ID_LIVE_CLASSINSTANCE = 0x20008c,
  D3D11_MESSAGE_ID_DESTROY_CLASSINSTANCE = 0x20008d,
  D3D11_MESSAGE_ID_CREATE_CLASSLINKAGE = 0x20008e,
  D3D11_MESSAGE_ID_LIVE_CLASSLINKAGE = 0x20008f,
  D3D11_MESSAGE_ID_DESTROY_CLASSLINKAGE = 0x200090,
  D3D11_MESSAGE_ID_LIVE_DEVICE = 0x200091,
  D3D11_MESSAGE_ID_LIVE_OBJECT_SUMMARY = 0x200092,
  D3D11_MESSAGE_ID_CREATE_COMPUTESHADER = 0x200093,
  D3D11_MESSAGE_ID_LIVE_COMPUTESHADER = 0x200094,
  D3D11_MESSAGE_ID_DESTROY_COMPUTESHADER = 0x200095,
  D3D11_MESSAGE_ID_CREATE_UNORDEREDACCESSVIEW = 0x200096,
  D3D11_MESSAGE_ID_LIVE_UNORDEREDACCESSVIEW = 0x200097,
  D3D11_MESSAGE_ID_DESTROY_UNORDEREDACCESSVIEW = 0x200098,
  D3D11_MESSAGE_ID_DEVICE_SETSHADER_INTERFACES_FEATURELEVEL = 0x200099,
  D3D11_MESSAGE_ID_DEVICE_SETSHADER_INTERFACE_COUNT_MISMATCH = 0x20009a,
  D3D11_MESSAGE_ID_DEVICE_SETSHADER_INVALID_INSTANCE = 0x20009b,
  D3D11_MESSAGE_ID_DEVICE_SETSHADER_INVALID_INSTANCE_INDEX = 0x20009c,
  D3D11_MESSAGE_ID_DEVICE_SETSHADER_INVALID_INSTANCE_TYPE = 0x20009d,
  D3D11_MESSAGE_ID_DEVICE_SETSHADER_INVALID_INSTANCE_DATA = 0x20009e,
  D3D11_MESSAGE_ID_DEVICE_SETSHADER_UNBOUND_INSTANCE_DATA = 0x20009f,
  D3D11_MESSAGE_ID_DEVICE_SETSHADER_INSTANCE_DATA_BINDINGS = 0x2000a0,
  D3D11_MESSAGE_ID_DEVICE_CREATESHADER_CLASSLINKAGE_FULL = 0x2000a1,
  D3D11_MESSAGE_ID_DEVICE_CHECKFEATURESUPPORT_UNRECOGNIZED_FEATURE = 0x2000a2,
  D3D11_MESSAGE_ID_DEVICE_CHECKFEATURESUPPORT_MISMATCHED_DATA_SIZE = 0x2000a3,
  D3D11_MESSAGE_ID_DEVICE_CHECKFEATURESUPPORT_INVALIDARG_RETURN = 0x2000a4,
  D3D11_MESSAGE_ID_DEVICE_CSSETSHADERRESOURCES_HAZARD = 0x2000a5,
  D3D11_MESSAGE_ID_DEVICE_CSSETCONSTANTBUFFERS_HAZARD = 0x2000a6,
  D3D11_MESSAGE_ID_CSSETSHADERRESOURCES_UNBINDDELETINGOBJECT = 0x2000a7,
  D3D11_MESSAGE_ID_CSSETCONSTANTBUFFERS_UNBINDDELETINGOBJECT = 0x2000a8,
  D3D11_MESSAGE_ID_CREATECOMPUTESHADER_INVALIDCALL = 0x2000a9,
  D3D11_MESSAGE_ID_CREATECOMPUTESHADER_OUTOFMEMORY = 0x2000aa,
  D3D11_MESSAGE_ID_CREATECOMPUTESHADER_INVALIDSHADERBYTECODE = 0x2000ab,
  D3D11_MESSAGE_ID_CREATECOMPUTESHADER_INVALIDSHADERTYPE = 0x2000ac,
  D3D11_MESSAGE_ID_CREATECOMPUTESHADER_INVALIDCLASSLINKAGE = 0x2000ad,
  D3D11_MESSAGE_ID_DEVICE_CSSETSHADERRESOURCES_VIEWS_EMPTY = 0x2000ae,
  D3D11_MESSAGE_ID_CSSETCONSTANTBUFFERS_INVALIDBUFFER = 0x2000af,
  D3D11_MESSAGE_ID_DEVICE_CSSETCONSTANTBUFFERS_BUFFERS_EMPTY = 0x2000b0,
  D3D11_MESSAGE_ID_DEVICE_CSSETSAMPLERS_SAMPLERS_EMPTY = 0x2000b1,
  D3D11_MESSAGE_ID_DEVICE_CSGETSHADERRESOURCES_VIEWS_EMPTY = 0x2000b2,
  D3D11_MESSAGE_ID_DEVICE_CSGETCONSTANTBUFFERS_BUFFERS_EMPTY = 0x2000b3,
  D3D11_MESSAGE_ID_DEVICE_CSGETSAMPLERS_SAMPLERS_EMPTY = 0x2000b4,
  D3D11_MESSAGE_ID_DEVICE_CREATEVERTEXSHADER_DOUBLEFLOATOPSNOTSUPPORTED = 0x2000b5,
  D3D11_MESSAGE_ID_DEVICE_CREATEHULLSHADER_DOUBLEFLOATOPSNOTSUPPORTED = 0x2000b6,
  D3D11_MESSAGE_ID_DEVICE_CREATEDOMAINSHADER_DOUBLEFLOATOPSNOTSUPPORTED = 0x2000b7,
  D3D11_MESSAGE_ID_DEVICE_CREATEGEOMETRYSHADER_DOUBLEFLOATOPSNOTSUPPORTED = 0x2000b8,
  D3D11_MESSAGE_ID_DEVICE_CREATEGEOMETRYSHADERWITHSTREAMOUTPUT_DOUBLEFLOATOPSNOTSUPPORTED = 0x2000b9,
  D3D11_MESSAGE_ID_DEVICE_CREATEPIXELSHADER_DOUBLEFLOATOPSNOTSUPPORTED = 0x2000ba,
  D3D11_MESSAGE_ID_DEVICE_CREATECOMPUTESHADER_DOUBLEFLOATOPSNOTSUPPORTED = 0x2000bb,
  D3D11_MESSAGE_ID_CREATEBUFFER_INVALIDSTRUCTURESTRIDE = 0x2000bc,
  D3D11_MESSAGE_ID_CREATESHADERRESOURCEVIEW_INVALIDFLAGS = 0x2000bd,
  D3D11_MESSAGE_ID_CREATEUNORDEREDACCESSVIEW_INVALIDRESOURCE = 0x2000be,
  D3D11_MESSAGE_ID_CREATEUNORDEREDACCESSVIEW_INVALIDDESC = 0x2000bf,
  D3D11_MESSAGE_ID_CREATEUNORDEREDACCESSVIEW_INVALIDFORMAT = 0x2000c0,
  D3D11_MESSAGE_ID_CREATEUNORDEREDACCESSVIEW_INVALIDDIMENSIONS = 0x2000c1,
  D3D11_MESSAGE_ID_CREATEUNORDEREDACCESSVIEW_UNRECOGNIZEDFORMAT = 0x2000c2,
  D3D11_MESSAGE_ID_DEVICE_OMSETRENDERTARGETSANDUNORDEREDACCESSVIEWS_HAZARD = 0x2000c3,
  D3D11_MESSAGE_ID_DEVICE_OMSETRENDERTARGETSANDUNORDEREDACCESSVIEWS_OVERLAPPING_OLD_SLOTS = 0x2000c4,
  D3D11_MESSAGE_ID_DEVICE_OMSETRENDERTARGETSANDUNORDEREDACCESSVIEWS_NO_OP = 0x2000c5,
  D3D11_MESSAGE_ID_CSSETUNORDEREDACCESSVIEWS_UNBINDDELETINGOBJECT = 0x2000c6,
  D3D11_MESSAGE_ID_PSSETUNORDEREDACCESSVIEWS_UNBINDDELETINGOBJECT = 0x2000c7,
  D3D11_MESSAGE_ID_CREATEUNORDEREDACCESSVIEW_INVALIDARG_RETURN = 0x2000c8,
  D3D11_MESSAGE_ID_CREATEUNORDEREDACCESSVIEW_OUTOFMEMORY_RETURN = 0x2000c9,
  D3D11_MESSAGE_ID_CREATEUNORDEREDACCESSVIEW_TOOMANYOBJECTS = 0x2000ca,
  D3D11_MESSAGE_ID_DEVICE_CSSETUNORDEREDACCESSVIEWS_HAZARD = 0x2000cb,
  D3D11_MESSAGE_ID_CLEARUNORDEREDACCESSVIEW_DENORMFLUSH = 0x2000cc,
  D3D11_MESSAGE_ID_DEVICE_CSSETUNORDEREDACCESSS_VIEWS_EMPTY = 0x2000cd,
  D3D11_MESSAGE_ID_DEVICE_CSGETUNORDEREDACCESSS_VIEWS_EMPTY = 0x2000ce,
  D3D11_MESSAGE_ID_CREATEUNORDEREDACCESSVIEW_INVALIDFLAGS = 0x2000cf,
  D3D11_MESSAGE_ID_CREATESHADERRESESOURCEVIEW_TOOMANYOBJECTS = 0x2000d0,
  D3D11_MESSAGE_ID_DEVICE_DISPATCHINDIRECT_INVALID_ARG_BUFFER = 0x2000d1,
  D3D11_MESSAGE_ID_DEVICE_DISPATCHINDIRECT_OFFSET_UNALIGNED = 0x2000d2,
  D3D11_MESSAGE_ID_DEVICE_DISPATCHINDIRECT_OFFSET_OVERFLOW = 0x2000d3,
  D3D11_MESSAGE_ID_DEVICE_SETRESOURCEMINLOD_INVALIDCONTEXT = 0x2000d4,
  D3D11_MESSAGE_ID_DEVICE_SETRESOURCEMINLOD_INVALIDRESOURCE = 0x2000d5,
  D3D11_MESSAGE_ID_DEVICE_SETRESOURCEMINLOD_INVALIDMINLOD = 0x2000d6,
  D3D11_MESSAGE_ID_DEVICE_GETRESOURCEMINLOD_INVALIDCONTEXT = 0x2000d7,
  D3D11_MESSAGE_ID_DEVICE_GETRESOURCEMINLOD_INVALIDRESOURCE = 0x2000d8,
  D3D11_MESSAGE_ID_OMSETDEPTHSTENCIL_UNBINDDELETINGOBJECT = 0x2000d9,
  D3D11_MESSAGE_ID_CLEARDEPTHSTENCILVIEW_DEPTH_READONLY = 0x2000da,
  D3D11_MESSAGE_ID_CLEARDEPTHSTENCILVIEW_STENCIL_READONLY = 0x2000db,
  D3D11_MESSAGE_ID_CHECKFEATURESUPPORT_FORMAT_DEPRECATED = 0x2000dc,
  D3D11_MESSAGE_ID_DEVICE_UNORDEREDACCESSVIEW_RETURN_TYPE_MISMATCH = 0x2000dd,
  D3D11_MESSAGE_ID_DEVICE_UNORDEREDACCESSVIEW_NOT_SET = 0x2000de,
  D3D11_MESSAGE_ID_DEVICE_DRAW_UNORDEREDACCESSVIEW_RENDERTARGETVIEW_OVERLAP = 0x2000df,
  D3D11_MESSAGE_ID_DEVICE_UNORDEREDACCESSVIEW_DIMENSION_MISMATCH = 0x2000e0,
  D3D11_MESSAGE_ID_DEVICE_UNORDEREDACCESSVIEW_APPEND_UNSUPPORTED = 0x2000e1,
  D3D11_MESSAGE_ID_DEVICE_UNORDEREDACCESSVIEW_ATOMICS_UNSUPPORTED = 0x2000e2,
  D3D11_MESSAGE_ID_DEVICE_UNORDEREDACCESSVIEW_STRUCTURE_STRIDE_MISMATCH = 0x2000e3,
  D3D11_MESSAGE_ID_DEVICE_UNORDEREDACCESSVIEW_BUFFER_TYPE_MISMATCH = 0x2000e4,
  D3D11_MESSAGE_ID_DEVICE_UNORDEREDACCESSVIEW_RAW_UNSUPPORTED = 0x2000e5,
  D3D11_MESSAGE_ID_DEVICE_UNORDEREDACCESSVIEW_FORMAT_LD_UNSUPPORTED = 0x2000e6,
  D3D11_MESSAGE_ID_DEVICE_UNORDEREDACCESSVIEW_FORMAT_STORE_UNSUPPORTED = 0x2000e7,
  D3D11_MESSAGE_ID_DEVICE_UNORDEREDACCESSVIEW_ATOMIC_ADD_UNSUPPORTED = 0x2000e8,
  D3D11_MESSAGE_ID_DEVICE_UNORDEREDACCESSVIEW_ATOMIC_BITWISE_OPS_UNSUPPORTED = 0x2000e9,
  D3D11_MESSAGE_ID_DEVICE_UNORDEREDACCESSVIEW_ATOMIC_CMPSTORE_CMPEXCHANGE_UNSUPPORTED = 0x2000ea,
  D3D11_MESSAGE_ID_DEVICE_UNORDEREDACCESSVIEW_ATOMIC_EXCHANGE_UNSUPPORTED = 0x2000eb,
  D3D11_MESSAGE_ID_DEVICE_UNORDEREDACCESSVIEW_ATOMIC_SIGNED_MINMAX_UNSUPPORTED = 0x2000ec,
  D3D11_MESSAGE_ID_DEVICE_UNORDEREDACCESSVIEW_ATOMIC_UNSIGNED_MINMAX_UNSUPPORTED = 0x2000ed,
  D3D11_MESSAGE_ID_DEVICE_DISPATCH_BOUND_RESOURCE_MAPPED = 0x2000ee,
  D3D11_MESSAGE_ID_DEVICE_DISPATCH_THREADGROUPCOUNT_OVERFLOW = 0x2000ef,
  D3D11_MESSAGE_ID_DEVICE_DISPATCH_THREADGROUPCOUNT_ZERO = 0x2000f0,
  D3D11_MESSAGE_ID_DEVICE_SHADERRESOURCEVIEW_STRUCTURE_STRIDE_MISMATCH = 0x2000f1,
  D3D11_MESSAGE_ID_DEVICE_SHADERRESOURCEVIEW_BUFFER_TYPE_MISMATCH = 0x2000f2,
  D3D11_MESSAGE_ID_DEVICE_SHADERRESOURCEVIEW_RAW_UNSUPPORTED = 0x2000f3,
  D3D11_MESSAGE_ID_DEVICE_DISPATCH_UNSUPPORTED = 0x2000f4,
  D3D11_MESSAGE_ID_DEVICE_DISPATCHINDIRECT_UNSUPPORTED = 0x2000f5,
  D3D11_MESSAGE_ID_COPYSTRUCTURECOUNT_INVALIDOFFSET = 0x2000f6,
  D3D11_MESSAGE_ID_COPYSTRUCTURECOUNT_LARGEOFFSET = 0x2000f7,
  D3D11_MESSAGE_ID_COPYSTRUCTURECOUNT_INVALIDDESTINATIONSTATE = 0x2000f8,
  D3D11_MESSAGE_ID_COPYSTRUCTURECOUNT_INVALIDSOURCESTATE = 0x2000f9,
  D3D11_MESSAGE_ID_CHECKFORMATSUPPORT_FORMAT_NOT_SUPPORTED = 0x2000fa,
  D3D11_MESSAGE_ID_DEVICE_CSSETUNORDEREDACCESSVIEWS_INVALIDVIEW = 0x2000fb,
  D3D11_MESSAGE_ID_DEVICE_CSSETUNORDEREDACCESSVIEWS_INVALIDOFFSET = 0x2000fc,
  D3D11_MESSAGE_ID_DEVICE_CSSETUNORDEREDACCESSVIEWS_TOOMANYVIEWS = 0x2000fd,
  D3D11_MESSAGE_ID_CLEARUNORDEREDACCESSVIEWFLOAT_INVALIDFORMAT = 0x2000fe,
  D3D11_MESSAGE_ID_DEVICE_UNORDEREDACCESSVIEW_COUNTER_UNSUPPORTED = 0x2000ff,
  D3D11_MESSAGE_ID_REF_WARNING = 0x200100,
  D3D11_MESSAGE_ID_D3D11_MESSAGES_END = 0x200101,
};

class phys_vec3
{
  /* 0x0000 */ float x;
  /* 0x0004 */ float y;
  /* 0x0008 */ float z;
  /* 0x000c */ float w;
}; /* size: 0x0010 */

class phys_mat44
{
  /* 0x0000 */ class phys_vec3 x;
  /* 0x0010 */ class phys_vec3 y;
  /* 0x0020 */ class phys_vec3 z;
  /* 0x0030 */ class phys_vec3 w;
}; /* size: 0x0040 */

enum GfxPrimStatsTarget
{
  GFX_PRIM_STATS_FIRST = 0,
  GFX_PRIM_STATS_DEFAULT = 0,
  GFX_PRIM_STATS_WORLD = 1,
  GFX_PRIM_STATS_SMODELRIGID = 2,
  GFX_PRIM_STATS_XMODELRIGID = 3,
  GFX_PRIM_STATS_XMODELSKINNED = 4,
  GFX_PRIM_STATS_BMODEL = 5,
  GFX_PRIM_STATS_FX = 6,
  GFX_PRIM_STATS_HUD = 7,
  GFX_PRIM_STATS_DEBUG = 8,
  GFX_PRIM_STATS_CODE = 9,
  GFX_PRIM_STATS_LAST = 9,
  GFX_PRIM_STATS_COUNT = 10,
};

typedef enum _TAG_UNNAMED_11
{
  CS_GAME_VERSION = 2,
  CS_SERVERID = 3,
  CS_MESSAGE = 4,
  CS_SCORES1 = 5,
  CS_SCORES2 = 6,
  CS_CULLDIST = 7,
  CS_SUNLIGHT = 8,
  CS_SUNDIR = 9,
  CS_FOGVARS = 10,
  CS_MOTD = 11,
  CS_GAMEENDTIME = 12,
  CS_MAPCENTER = 13,
  CS_TIMESCALE = 14,
  CS_VOTE_TIME = 15,
  CS_VOTE_STRING = 16,
  CS_VOTE_YES = 17,
  CS_VOTE_NO = 18,
  CS_VOTE_MAPNAME = 19,
  CS_VOTE_GAMETYPE = 20,
  CS_MULTI_MAPWINNER = 21,
  CS_ENEMY_CROSSHAIR = 22,
  CS_CODINFO = 23,
  CS_CODINFO_LAST = 172,
  CS_CODINFO_VALUE = 173,
  CS_CODINFO_VALUE_LAST = 322,
  CS_PLAYERINFOS = 323,
  CS_PLAYERINFOS_LAST = 340,
  CS_SESSIONNONCE = 341,
  CS_PLAYEREMBLEMS = 342,
  CS_PLAYEREMBLEMS_LAST = 359,
  CS_TARGETS = 360,
  CS_TARGETS_LAST = 391,
  CS_USE_TRIG_STRINGS = 392,
  CS_USE_TRIG_STRINGS_LAST = 487,
  CS_LOCALIZED_STRINGS = 488,
  CS_LOCALIZED_STRINGS_LAST = 999,
  CS_CLIENTSYSTEM_NAMES = 1000,
  CS_CLIENTSYSTEM_NAMES_LAST = 1008,
  CS_CASE_INSENSITIVE_BEGIN = 1009,
  CS_AMBIENT = 1009,
  CS_RUMBLES = 1010,
  CS_RUMBLE_LAST = 1057,
  CS_NORTHYAW = 1058,
  CS_MINIMAP = 1059,
  CS_VISIONSET_NAKED = 1060,
  CS_VISIONSET_NIGHT = 1061,
  CS_NIGHTVISION = 1062,
  CS_LOC_SEL_MTLS = 1063,
  CS_LOC_SEL_MTLS_LAST = 1077,
  CS_MODELS = 1078,
  CS_MODELS_LAST = 1589,
  CS_EFFECT_NAMES = 1590,
  CS_EFFECT_NAMES_LAST = 1785,
  CS_EFFECT_TAGS = 1786,
  CS_EFFECT_TAGS_LAST = 2041,
  CS_SHELLSHOCKS = 2042,
  CS_SHELLSHOCKS_LAST = 2057,
  CS_SCRIPT_MENUS = 2058,
  CS_SCRIPT_MENUS_LAST = 2089,
  CS_SERVER_MATERIALS = 2090,
  CS_SERVER_MATERIALS_LAST = 2345,
  CS_WEAPONFILES = 2346,
  CS_WEAPONFILES_LAST = 2601,
  CS_STATUS_ICONS = 2602,
  CS_STATUS_ICONS_LAST = 2609,
  CS_HEAD_ICONS = 2610,
  CS_HEAD_ICONS_LAST = 2624,
  CS_TAGS = 2625,
  CS_TAGS_LAST = 2688,
  CS_ITEMS = 2689,
  CS_VEHICLE_TYPES = 2690,
  CS_VEHICLE_TYPES_LAST = 2721,
  CS_DESTRUCTIBLES = 2722,
  CS_DESTRUCTIBLES_LAST = 2785,
  CS_ANIMTREES = 2786,
  CS_ANIMTREES_LAST = 2801,
  CS_VISIONSET_LASTSTAND = 2802,
  CS_LEADERBOARDS = 2803,
  CS_SESSIONINFO = 2804,
  CS_MATCHID = 2805,
  MAX_CONFIGSTRINGS = 2806,
} TAG_UNNAMED_11, *PTAG_UNNAMED_11;

enum NV_HDMI_STEREO_TYPE
{
  NV_HDMI_STEREO_3D_NONE = 0,
  NV_STEREO_NVISION = 1,
  NV_HDMI_STEREO_3D_FRAME_PACKING = 2,
  NV_HDMI_STEREO_3D_FRAME_PACKING_INT = 3,
  NV_HDMI_STEREO_3D_LINE_ALT = 4,
  NV_HDMI_STEREO_3D_SIDE_BY_SIDE_FULL = 5,
  NV_HDMI_STEREO_3D_SIDE_BY_SIDE_HALF_HORIZONTAIL_ODD_LEFT_ODD_RIGHT = 6,
  NV_HDMI_STEREO_3D_SIDE_BY_SIDE_HALF_HORIZONTAIL_ODD_LEFT_EVEN_RIGHT = 7,
  NV_HDMI_STEREO_3D_SIDE_BY_SIDE_HALF_HORIZONTAIL_EVEN_LEFT_ODD_RIGHT = 8,
  NV_HDMI_STEREO_3D_SIDE_BY_SIDE_HALF_HORIZONTAIL_EVEN_LEFT_EVEN_RIGHT = 9,
  NV_HDMI_STEREO_3D_SIDE_BY_SIDE_HALF_QUINCUX_ODD_LEFT_ODD_RIGHT = 10,
  NV_HDMI_STEREO_3D_SIDE_BY_SIDE_HALF_QUINCUX_ODD_LEFT_EVEN_RIGHT = 11,
  NV_HDMI_STEREO_3D_SIDE_BY_SIDE_HALF_QUINCUX_EVEN_LEFT_ODD_RIGHT = 12,
  NV_HDMI_STEREO_3D_SIDE_BY_SIDE_HALF_QUINCUX_EVEN_LEFT_EVEN_RIGHT = 13,
  NV_HDMI_STEREO_3D_FIELD_ALT = 14,
  NV_HDMI_STEREO_3D_L_DEPTH = 15,
  NV_HDMI_STEREO_3D_L_DEPTH_GFX = 16,
  NV_HDMI_STEREO_3D_ANY = 255,
};

class bdSessionParams
{
}; /* size: 0x0004 */

enum D3D_DRIVER_TYPE
{
  D3D_DRIVER_TYPE_UNKNOWN = 0,
  D3D_DRIVER_TYPE_HARDWARE = 1,
  D3D_DRIVER_TYPE_REFERENCE = 2,
  D3D_DRIVER_TYPE_NULL = 3,
  D3D_DRIVER_TYPE_SOFTWARE = 4,
  D3D_DRIVER_TYPE_WARP = 5,
};

enum PlayerSpreadOverrideState
{
  PSOS_DISABLED = 0,
  PSOS_RESETTING = 1,
  PSOS_ENABLED = 2,
};

enum hostDelegationState_t
{
  HOST_NOT_DELEGATED = 0,
  HOST_DELEGATING = 1,
  HOST_DELEGATED = 2,
  CLIENT_DELEGATE_INACTIVE = 3,
  CLIENT_CREATING_SESSION = 4,
  CLIENT_ACTIVE_DELEGATE = 5,
  CLIENT_ABORT = 6,
  HOST_DELEGATE_NUM_STATES = 7,
};

typedef enum _TAG_UNNAMED_12
{
  VAR_UNDEFINED = 0,
  VAR_BEGIN_REF = 1,
  VAR_POINTER = 1,
  VAR_STRING = 2,
  VAR_ISTRING = 3,
  VAR_VECTOR = 4,
  VAR_END_REF = 5,
  VAR_HASH = 5,
  VAR_FLOAT = 6,
  VAR_INTEGER = 7,
  VAR_CODEPOS = 8,
  VAR_PRECODEPOS = 9,
  VAR_FUNCTION = 10,
  VAR_STACK = 11,
  VAR_ANIMATION = 12,
  VAR_DEVELOPER_CODEPOS = 13,
  VAR_THREAD = 14,
  VAR_NOTIFY_THREAD = 15,
  VAR_TIME_THREAD = 16,
  VAR_CHILD_THREAD = 17,
  VAR_OBJECT = 18,
  VAR_DEAD_ENTITY = 19,
  VAR_ENTITY = 20,
  VAR_ARRAY = 21,
  VAR_DEAD_THREAD = 22,
  VAR_COUNT = 23,
  VAR_FREE = 23,
  VAR_THREAD_LIST = 24,
  VAR_ENT_LIST = 25,
  VAR_TOTAL_COUNT = 26,
} TAG_UNNAMED_12, *PTAG_UNNAMED_12;

enum tracerFieldType_t
{
  TFT_TRACERTYPE = 18,
  TFT_NUM_FIELD_TYPES = 19,
};

enum D3D_PRIMITIVE_TOPOLOGY
{
  D3D_PRIMITIVE_TOPOLOGY_UNDEFINED = 0,
  D3D_PRIMITIVE_TOPOLOGY_POINTLIST = 1,
  D3D_PRIMITIVE_TOPOLOGY_LINELIST = 2,
  D3D_PRIMITIVE_TOPOLOGY_LINESTRIP = 3,
  D3D_PRIMITIVE_TOPOLOGY_TRIANGLELIST = 4,
  D3D_PRIMITIVE_TOPOLOGY_TRIANGLESTRIP = 5,
  D3D_PRIMITIVE_TOPOLOGY_LINELIST_ADJ = 10,
  D3D_PRIMITIVE_TOPOLOGY_LINESTRIP_ADJ = 11,
  D3D_PRIMITIVE_TOPOLOGY_TRIANGLELIST_ADJ = 12,
  D3D_PRIMITIVE_TOPOLOGY_TRIANGLESTRIP_ADJ = 13,
  D3D_PRIMITIVE_TOPOLOGY_1_CONTROL_POINT_PATCHLIST = 33,
  D3D_PRIMITIVE_TOPOLOGY_2_CONTROL_POINT_PATCHLIST = 34,
  D3D_PRIMITIVE_TOPOLOGY_3_CONTROL_POINT_PATCHLIST = 35,
  D3D_PRIMITIVE_TOPOLOGY_4_CONTROL_POINT_PATCHLIST = 36,
  D3D_PRIMITIVE_TOPOLOGY_5_CONTROL_POINT_PATCHLIST = 37,
  D3D_PRIMITIVE_TOPOLOGY_6_CONTROL_POINT_PATCHLIST = 38,
  D3D_PRIMITIVE_TOPOLOGY_7_CONTROL_POINT_PATCHLIST = 39,
  D3D_PRIMITIVE_TOPOLOGY_8_CONTROL_POINT_PATCHLIST = 40,
  D3D_PRIMITIVE_TOPOLOGY_9_CONTROL_POINT_PATCHLIST = 41,
  D3D_PRIMITIVE_TOPOLOGY_10_CONTROL_POINT_PATCHLIST = 42,
  D3D_PRIMITIVE_TOPOLOGY_11_CONTROL_POINT_PATCHLIST = 43,
  D3D_PRIMITIVE_TOPOLOGY_12_CONTROL_POINT_PATCHLIST = 44,
  D3D_PRIMITIVE_TOPOLOGY_13_CONTROL_POINT_PATCHLIST = 45,
  D3D_PRIMITIVE_TOPOLOGY_14_CONTROL_POINT_PATCHLIST = 46,
  D3D_PRIMITIVE_TOPOLOGY_15_CONTROL_POINT_PATCHLIST = 47,
  D3D_PRIMITIVE_TOPOLOGY_16_CONTROL_POINT_PATCHLIST = 48,
  D3D_PRIMITIVE_TOPOLOGY_17_CONTROL_POINT_PATCHLIST = 49,
  D3D_PRIMITIVE_TOPOLOGY_18_CONTROL_POINT_PATCHLIST = 50,
  D3D_PRIMITIVE_TOPOLOGY_19_CONTROL_POINT_PATCHLIST = 51,
  D3D_PRIMITIVE_TOPOLOGY_20_CONTROL_POINT_PATCHLIST = 52,
  D3D_PRIMITIVE_TOPOLOGY_21_CONTROL_POINT_PATCHLIST = 53,
  D3D_PRIMITIVE_TOPOLOGY_22_CONTROL_POINT_PATCHLIST = 54,
  D3D_PRIMITIVE_TOPOLOGY_23_CONTROL_POINT_PATCHLIST = 55,
  D3D_PRIMITIVE_TOPOLOGY_24_CONTROL_POINT_PATCHLIST = 56,
  D3D_PRIMITIVE_TOPOLOGY_25_CONTROL_POINT_PATCHLIST = 57,
  D3D_PRIMITIVE_TOPOLOGY_26_CONTROL_POINT_PATCHLIST = 58,
  D3D_PRIMITIVE_TOPOLOGY_27_CONTROL_POINT_PATCHLIST = 59,
  D3D_PRIMITIVE_TOPOLOGY_28_CONTROL_POINT_PATCHLIST = 60,
  D3D_PRIMITIVE_TOPOLOGY_29_CONTROL_POINT_PATCHLIST = 61,
  D3D_PRIMITIVE_TOPOLOGY_30_CONTROL_POINT_PATCHLIST = 62,
  D3D_PRIMITIVE_TOPOLOGY_31_CONTROL_POINT_PATCHLIST = 63,
  D3D_PRIMITIVE_TOPOLOGY_32_CONTROL_POINT_PATCHLIST = 64,
  D3D10_PRIMITIVE_TOPOLOGY_UNDEFINED = 0,
  D3D10_PRIMITIVE_TOPOLOGY_POINTLIST = 1,
  D3D10_PRIMITIVE_TOPOLOGY_LINELIST = 2,
  D3D10_PRIMITIVE_TOPOLOGY_LINESTRIP = 3,
  D3D10_PRIMITIVE_TOPOLOGY_TRIANGLELIST = 4,
  D3D10_PRIMITIVE_TOPOLOGY_TRIANGLESTRIP = 5,
  D3D10_PRIMITIVE_TOPOLOGY_LINELIST_ADJ = 10,
  D3D10_PRIMITIVE_TOPOLOGY_LINESTRIP_ADJ = 11,
  D3D10_PRIMITIVE_TOPOLOGY_TRIANGLELIST_ADJ = 12,
  D3D10_PRIMITIVE_TOPOLOGY_TRIANGLESTRIP_ADJ = 13,
  D3D11_PRIMITIVE_TOPOLOGY_UNDEFINED = 0,
  D3D11_PRIMITIVE_TOPOLOGY_POINTLIST = 1,
  D3D11_PRIMITIVE_TOPOLOGY_LINELIST = 2,
  D3D11_PRIMITIVE_TOPOLOGY_LINESTRIP = 3,
  D3D11_PRIMITIVE_TOPOLOGY_TRIANGLELIST = 4,
  D3D11_PRIMITIVE_TOPOLOGY_TRIANGLESTRIP = 5,
  D3D11_PRIMITIVE_TOPOLOGY_LINELIST_ADJ = 10,
  D3D11_PRIMITIVE_TOPOLOGY_LINESTRIP_ADJ = 11,
  D3D11_PRIMITIVE_TOPOLOGY_TRIANGLELIST_ADJ = 12,
  D3D11_PRIMITIVE_TOPOLOGY_TRIANGLESTRIP_ADJ = 13,
  D3D11_PRIMITIVE_TOPOLOGY_1_CONTROL_POINT_PATCHLIST = 33,
  D3D11_PRIMITIVE_TOPOLOGY_2_CONTROL_POINT_PATCHLIST = 34,
  D3D11_PRIMITIVE_TOPOLOGY_3_CONTROL_POINT_PATCHLIST = 35,
  D3D11_PRIMITIVE_TOPOLOGY_4_CONTROL_POINT_PATCHLIST = 36,
  D3D11_PRIMITIVE_TOPOLOGY_5_CONTROL_POINT_PATCHLIST = 37,
  D3D11_PRIMITIVE_TOPOLOGY_6_CONTROL_POINT_PATCHLIST = 38,
  D3D11_PRIMITIVE_TOPOLOGY_7_CONTROL_POINT_PATCHLIST = 39,
  D3D11_PRIMITIVE_TOPOLOGY_8_CONTROL_POINT_PATCHLIST = 40,
  D3D11_PRIMITIVE_TOPOLOGY_9_CONTROL_POINT_PATCHLIST = 41,
  D3D11_PRIMITIVE_TOPOLOGY_10_CONTROL_POINT_PATCHLIST = 42,
  D3D11_PRIMITIVE_TOPOLOGY_11_CONTROL_POINT_PATCHLIST = 43,
  D3D11_PRIMITIVE_TOPOLOGY_12_CONTROL_POINT_PATCHLIST = 44,
  D3D11_PRIMITIVE_TOPOLOGY_13_CONTROL_POINT_PATCHLIST = 45,
  D3D11_PRIMITIVE_TOPOLOGY_14_CONTROL_POINT_PATCHLIST = 46,
  D3D11_PRIMITIVE_TOPOLOGY_15_CONTROL_POINT_PATCHLIST = 47,
  D3D11_PRIMITIVE_TOPOLOGY_16_CONTROL_POINT_PATCHLIST = 48,
  D3D11_PRIMITIVE_TOPOLOGY_17_CONTROL_POINT_PATCHLIST = 49,
  D3D11_PRIMITIVE_TOPOLOGY_18_CONTROL_POINT_PATCHLIST = 50,
  D3D11_PRIMITIVE_TOPOLOGY_19_CONTROL_POINT_PATCHLIST = 51,
  D3D11_PRIMITIVE_TOPOLOGY_20_CONTROL_POINT_PATCHLIST = 52,
  D3D11_PRIMITIVE_TOPOLOGY_21_CONTROL_POINT_PATCHLIST = 53,
  D3D11_PRIMITIVE_TOPOLOGY_22_CONTROL_POINT_PATCHLIST = 54,
  D3D11_PRIMITIVE_TOPOLOGY_23_CONTROL_POINT_PATCHLIST = 55,
  D3D11_PRIMITIVE_TOPOLOGY_24_CONTROL_POINT_PATCHLIST = 56,
  D3D11_PRIMITIVE_TOPOLOGY_25_CONTROL_POINT_PATCHLIST = 57,
  D3D11_PRIMITIVE_TOPOLOGY_26_CONTROL_POINT_PATCHLIST = 58,
  D3D11_PRIMITIVE_TOPOLOGY_27_CONTROL_POINT_PATCHLIST = 59,
  D3D11_PRIMITIVE_TOPOLOGY_28_CONTROL_POINT_PATCHLIST = 60,
  D3D11_PRIMITIVE_TOPOLOGY_29_CONTROL_POINT_PATCHLIST = 61,
  D3D11_PRIMITIVE_TOPOLOGY_30_CONTROL_POINT_PATCHLIST = 62,
  D3D11_PRIMITIVE_TOPOLOGY_31_CONTROL_POINT_PATCHLIST = 63,
  D3D11_PRIMITIVE_TOPOLOGY_32_CONTROL_POINT_PATCHLIST = 64,
};

typedef enum _TAG_UNNAMED_13
{
  MT_TYPE_EMPTY = 0,
  MT_TYPE_THREAD = 1,
  MT_TYPE_VECTOR = 2,
  MT_TYPE_ANIM_NOTETRACK = 3,
  MT_TYPE_ANIM_TREE = 4,
  MT_TYPE_SMALL_ANIM_TREE = 5,
  MT_TYPE_EXTERNAL = 6,
  MT_TYPE_TEMP = 7,
  MT_TYPE_SURFACE = 8,
  MT_TYPE_ANIM_PART = 9,
  MT_TYPE_MODEL_PART = 10,
  MT_TYPE_MODEL_PART_MAP = 11,
  MT_TYPE_MODEL_DUPLICATE_PARTS = 12,
  MT_TYPE_MODEL_LIST = 13,
  MT_TYPE_SCRIPT_PARSE = 14,
  MT_TYPE_SCRIPT_STRING = 15,
  MT_TYPE_CLASS = 16,
  MT_TYPE_TAG_INFO = 17,
  MT_TYPE_ANIMSCRIPTED = 18,
  MT_TYPE_CONFIG_STRING = 19,
  MT_TYPE_DEBUGGER_STRING = 20,
  MT_TYPE_VEHICLE = 21,
  MT_TYPE_GENERIC = 22,
  MT_TYPE_COUNT = 23,
} TAG_UNNAMED_13, *PTAG_UNNAMED_13;

enum LeagueOutcome
{
  LEAGUE_OUTCOME_BASE = 0,
  LEAGUE_OUTCOME_WINNER = 1,
  LEAGUE_OUTCOME_LOSER = 2,
  LEAGUE_OUTCOME_PRE_LOSER = 3,
  LEAGUE_OUTCOME_RESET = 4,
  LEAGUE_OUTCOME_DRAW = 5,
};

enum doubleXPGroups_e
{
  DOUBLEXP_EVERYONE = 0,
  DOUBLEXP_PREORDER = 1,
  DOUBLEXP_ELITE_MEMBER = 2,
  DOUBLEXP_ELITE_FOUNDER = 3,
  DOUBLEXP_ELITE3 = 4,
  DOUBLEXP_ELITE_INVALID_MARKETING_OPTIN = 5,
  DOUBLEXP_GROUP_DLCALL = 6,
  DOUBLEXP_GROUP_DLCANY = 7,
  DOUBLEXP_GROUP_DLC0 = 8,
  DOUBLEXP_GROUP_DLC_FIRST = 8,
  DOUBLEXP_GROUP_DLCZM0 = 9,
  DOUBLEXP_GROUP_DLC1 = 10,
  DOUBLEXP_GROUP_DLC2 = 11,
  DOUBLEXP_GROUP_DLC3 = 12,
  DOUBLEXP_GROUP_DLC4 = 13,
  DOUBLEXP_GROUP_DLC5 = 14,
  DOUBLEXP_GROUP_DLCSEASONPASS = 15,
  DOUBLEXP_GROUP_DLC_LAST = 15,
  DOUBLEXP_GROUP_OWN_DLCALL = 16,
  DOUBLEXP_GROUP_OWN_DLCANY = 17,
  DOUBLEXP_GROUP_OWN_DLC0 = 18,
  DOUBLEXP_GROUP_OWN_DLC_FIRST = 18,
  DOUBLEXP_GROUP_OWN_DLCZM0 = 19,
  DOUBLEXP_GROUP_OWN_DLC1 = 20,
  DOUBLEXP_GROUP_OWN_DLC2 = 21,
  DOUBLEXP_GROUP_OWN_DLC3 = 22,
  DOUBLEXP_GROUP_OWN_DLC4 = 23,
  DOUBLEXP_GROUP_OWN_DLC5 = 24,
  DOUBLEXP_GROUP_OWN_DLCSEASONPASS = 25,
  DOUBLEXP_GROUP_OWN_DLC_LAST = 25,
  DOUBLEXP_GROUP_CE_NUKETOWN_2025 = 26,
  DOUBLEXP_GROUP_CE_NUKETOWN_Z = 27,
  DOUBLEXP_GROUP_CE_CAMO = 28,
  DOUBLEXP_GROUP_PHANTOM = 29,
  DOUBLEXP_GROUP_MISC5 = 30,
  DOUBLEXP_GROUP_MISC6 = 31,
  DOUBLEXP_GROUP_COUNT = 32,
};

class phys_link_list_base<pulse_sum_constraint_solver::temp_user_rigid_body>
{
  /* 0x0000 */ class pulse_sum_constraint_solver::temp_user_rigid_body* m_next_link;
}; /* size: 0x0004 */

enum tagCHANGEKIND
{
  CHANGEKIND_ADDMEMBER = 0,
  CHANGEKIND_DELETEMEMBER = 1,
  CHANGEKIND_SETNAMES = 2,
  CHANGEKIND_SETDOCUMENTATION = 3,
  CHANGEKIND_GENERAL = 4,
  CHANGEKIND_INVALIDATE = 5,
  CHANGEKIND_CHANGEFAILED = 6,
  CHANGEKIND_MAX = 7,
};

enum expOperationEnum
{
  OP_NOOP = 0,
  OP_RIGHTPAREN = 1,
  OP_MULTIPLY = 2,
  OP_DIVIDE = 3,
  OP_MODULUS = 4,
  OP_ADD = 5,
  OP_SUBTRACT = 6,
  OP_NEGATE = 7,
  OP_NOT = 8,
  OP_LESSTHAN = 9,
  OP_LESSTHANEQUALTO = 10,
  OP_GREATERTHAN = 11,
  OP_GREATERTHANEQUALTO = 12,
  OP_EQUALS = 13,
  OP_NOTEQUAL = 14,
  OP_AND = 15,
  OP_OR = 16,
  OP_LEFTPAREN = 17,
  OP_COMMA = 18,
  OP_BITWISEAND = 19,
  OP_BITWISEOR = 20,
  OP_BITWISENOT = 21,
  OP_BITSHIFTLEFT = 22,
  OP_BITSHIFTRIGHT = 23,
  NUM_EXPRESSION_OPERATORS = 24,
  MAX_OPERATOR_VALUE = 16384,
};

struct view_limits_t
{
  /* 0x0000 */ float horizSpanLeft;
  /* 0x0004 */ float horizSpanRight;
  /* 0x0008 */ float vertSpanUp;
  /* 0x000c */ float vertSpanDown;
  /* 0x0010 */ float horizResistLeft;
  /* 0x0014 */ float horizResistRight;
  /* 0x0018 */ float vertResistUp;
  /* 0x001c */ float vertResistDown;
}; /* size: 0x0020 */

typedef enum _TAG_UNNAMED_14
{
  GFX_SYM_FILTER_1 = 0,
  GFX_SYM_FILTER_2 = 1,
  GFX_SYM_FILTER_3 = 2,
  GFX_SYM_FILTER_4 = 3,
  GFX_SYM_FILTER_5 = 4,
  GFX_SYM_FILTER_6 = 5,
  GFX_SYM_FILTER_7 = 6,
  GFX_SYM_FILTER_8 = 7,
  GFX_SYM_FILTER_COUNT = 8,
} TAG_UNNAMED_14, *PTAG_UNNAMED_14;

typedef enum _TAG_UNNAMED_15
{
  FIRST_OBJECT = 14,
  FIRST_CLEARABLE_OBJECT = 18,
  LAST_NONENTITY_OBJECT = 18,
  FIRST_ENTITY_OBJECT = 20,
  FIRST_NONFIELD_OBJECT = 21,
  FIRST_DEAD_OBJECT = 22,
} TAG_UNNAMED_15, *PTAG_UNNAMED_15;

enum NV_GPS_THERM_LIMIT_SRC
{
  NV_GPS_THERM_LIMIT_SRC_USER_LIMITED = 1,
  NV_GPS_THERM_LIMIT_SRC_SBIOS_LIMITED = 2,
  NV_GPS_THERM_LIMIT_SRC_SBIOS_UNLIMITED = 3,
  NV_GPS_THERM_LIMIT_SRC_SBIOS_NOT_SUPPORTED = 4,
  NV_GPS_THERM_LIMIT_SRC_USER_DISABLED = 5,
};

enum RagdollBodyState
{
  BS_DEAD = 0,
  BS_DOBJ_WAIT = 1,
  BS_VELOCITY_CAPTURE = 2,
  BS_TUNNEL_TEST = 3,
  BS_RUNNING = 4,
  BS_IDLE = 5,
  RAGDOLL_NUM_STATES = 6,
};

enum bdLogMessageType
{
  BD_LOG_INFO = 0,
  BD_LOG_WARNING = 1,
  BD_LOG_ERROR = 2,
};

enum eAttachmentTableColumns
{
  ATTACHMENTTABLE_NUMBER = 0,
  ATTACHMENTTABLE_ATTACH_POINT = 1,
  ATTACHMENTTABLE_GROUP = 2,
  ATTACHMENTTABLE_NAME = 3,
  ATTACHMENTTABLE_REFERENCE = 4,
  ATTACHMENTTABLE_COUNT = 5,
  ATTACHMENTTABLE_IMAGE = 6,
  ATTACHMENTTABLE_DESCRIPTION = 7,
  ATTACHMENTTABLE_DATA_STRING = 8,
  ATTACHMENTTABLE_DATA_INT = 9,
  ATTACHMENTTABLE_DATA_INT2 = 10,
  ATTACHMENTTABLE_COMPATIBLE_ATTACHMENTS = 11,
  ATTACHMENTTABLE_ALLOCATION_COST = 12,
  ATTACHMENTTABLE_UNLOCK_LVL = 13,
  ATTACHMENTTABLE_UNLOCK_PLEVEL = 14,
  ATTACHMENTTABLE_COST = 15,
  ATTACHMENTTABLE_DEFAULT_PRIMARY_CLASS = 16,
  ATTACHMENTTABLE_DEFAULT_SECONDARY_CLASS = 17,
  ATTACHMENTTABLE_IS_ELITE = 18,
  MAX_ATTACHMENTTABLE_COUNT = 19,
};

enum mtxItemsColumns_e
{
  MTX_COLUMN_ID = 0,
  MTX_COLUMN_NAME = 1,
  MTX_COLUMN_OFFERID = 2,
  MTX_COLUMN_CATEGORY = 3,
  MTX_COLUMN_PS3PRODUCTNAME = 4,
  MTX_COLUMN_PCSTEAMAPPID = 5,
  MTX_COLUMN_ISHIDDEN = 6,
};

typedef enum _NVVIOVIDEOSTANDARD
{
  NVVIOVIDEOSTANDARD_SMPTE259 = 0,
  NVVIOVIDEOSTANDARD_SMPTE260 = 1,
  NVVIOVIDEOSTANDARD_SMPTE274 = 2,
  NVVIOVIDEOSTANDARD_SMPTE295 = 3,
  NVVIOVIDEOSTANDARD_SMPTE296 = 4,
  NVVIOVIDEOSTANDARD_SMPTE372 = 5,
} NVVIOVIDEOSTANDARD, *PNVVIOVIDEOSTANDARD;

typedef enum _TAG_UNNAMED_16
{
  FX_FLESHTYPE_BODY_NONFATAL = 0,
  FX_FLESHTYPE_BODY_FATAL = 1,
  FX_FLESHTYPE_HEAD_NONFATAL = 2,
  FX_FLESHTYPE_HEAD_FATAL = 3,
  FX_FLESHTYPE_COUNT = 4,
} TAG_UNNAMED_16, *PTAG_UNNAMED_16;

enum MaterialUpdateFrequency
{
  MTL_UPDATE_PER_PRIM = 0,
  MTL_UPDATE_PER_OBJECT = 1,
  MTL_UPDATE_RARELY = 2,
  MTL_UPDATE_CUSTOM = 3,
  MTL_UPDATE_IGNORE = 4,
};

enum FLAC__EntropyCodingMethodType
{
  FLAC__ENTROPY_CODING_METHOD_PARTITIONED_RICE = 0,
  FLAC__ENTROPY_CODING_METHOD_PARTITIONED_RICE2 = 1,
};

enum D3D_PRIMITIVE
{
  D3D_PRIMITIVE_UNDEFINED = 0,
  D3D_PRIMITIVE_POINT = 1,
  D3D_PRIMITIVE_LINE = 2,
  D3D_PRIMITIVE_TRIANGLE = 3,
  D3D_PRIMITIVE_LINE_ADJ = 6,
  D3D_PRIMITIVE_TRIANGLE_ADJ = 7,
  D3D_PRIMITIVE_1_CONTROL_POINT_PATCH = 8,
  D3D_PRIMITIVE_2_CONTROL_POINT_PATCH = 9,
  D3D_PRIMITIVE_3_CONTROL_POINT_PATCH = 10,
  D3D_PRIMITIVE_4_CONTROL_POINT_PATCH = 11,
  D3D_PRIMITIVE_5_CONTROL_POINT_PATCH = 12,
  D3D_PRIMITIVE_6_CONTROL_POINT_PATCH = 13,
  D3D_PRIMITIVE_7_CONTROL_POINT_PATCH = 14,
  D3D_PRIMITIVE_8_CONTROL_POINT_PATCH = 15,
  D3D_PRIMITIVE_9_CONTROL_POINT_PATCH = 16,
  D3D_PRIMITIVE_10_CONTROL_POINT_PATCH = 17,
  D3D_PRIMITIVE_11_CONTROL_POINT_PATCH = 18,
  D3D_PRIMITIVE_12_CONTROL_POINT_PATCH = 19,
  D3D_PRIMITIVE_13_CONTROL_POINT_PATCH = 20,
  D3D_PRIMITIVE_14_CONTROL_POINT_PATCH = 21,
  D3D_PRIMITIVE_15_CONTROL_POINT_PATCH = 22,
  D3D_PRIMITIVE_16_CONTROL_POINT_PATCH = 23,
  D3D_PRIMITIVE_17_CONTROL_POINT_PATCH = 24,
  D3D_PRIMITIVE_18_CONTROL_POINT_PATCH = 25,
  D3D_PRIMITIVE_19_CONTROL_POINT_PATCH = 26,
  D3D_PRIMITIVE_20_CONTROL_POINT_PATCH = 28,
  D3D_PRIMITIVE_21_CONTROL_POINT_PATCH = 29,
  D3D_PRIMITIVE_22_CONTROL_POINT_PATCH = 30,
  D3D_PRIMITIVE_23_CONTROL_POINT_PATCH = 31,
  D3D_PRIMITIVE_24_CONTROL_POINT_PATCH = 32,
  D3D_PRIMITIVE_25_CONTROL_POINT_PATCH = 33,
  D3D_PRIMITIVE_26_CONTROL_POINT_PATCH = 34,
  D3D_PRIMITIVE_27_CONTROL_POINT_PATCH = 35,
  D3D_PRIMITIVE_28_CONTROL_POINT_PATCH = 36,
  D3D_PRIMITIVE_29_CONTROL_POINT_PATCH = 37,
  D3D_PRIMITIVE_30_CONTROL_POINT_PATCH = 38,
  D3D_PRIMITIVE_31_CONTROL_POINT_PATCH = 39,
  D3D_PRIMITIVE_32_CONTROL_POINT_PATCH = 40,
  D3D10_PRIMITIVE_UNDEFINED = 0,
  D3D10_PRIMITIVE_POINT = 1,
  D3D10_PRIMITIVE_LINE = 2,
  D3D10_PRIMITIVE_TRIANGLE = 3,
  D3D10_PRIMITIVE_LINE_ADJ = 6,
  D3D10_PRIMITIVE_TRIANGLE_ADJ = 7,
  D3D11_PRIMITIVE_UNDEFINED = 0,
  D3D11_PRIMITIVE_POINT = 1,
  D3D11_PRIMITIVE_LINE = 2,
  D3D11_PRIMITIVE_TRIANGLE = 3,
  D3D11_PRIMITIVE_LINE_ADJ = 6,
  D3D11_PRIMITIVE_TRIANGLE_ADJ = 7,
  D3D11_PRIMITIVE_1_CONTROL_POINT_PATCH = 8,
  D3D11_PRIMITIVE_2_CONTROL_POINT_PATCH = 9,
  D3D11_PRIMITIVE_3_CONTROL_POINT_PATCH = 10,
  D3D11_PRIMITIVE_4_CONTROL_POINT_PATCH = 11,
  D3D11_PRIMITIVE_5_CONTROL_POINT_PATCH = 12,
  D3D11_PRIMITIVE_6_CONTROL_POINT_PATCH = 13,
  D3D11_PRIMITIVE_7_CONTROL_POINT_PATCH = 14,
  D3D11_PRIMITIVE_8_CONTROL_POINT_PATCH = 15,
  D3D11_PRIMITIVE_9_CONTROL_POINT_PATCH = 16,
  D3D11_PRIMITIVE_10_CONTROL_POINT_PATCH = 17,
  D3D11_PRIMITIVE_11_CONTROL_POINT_PATCH = 18,
  D3D11_PRIMITIVE_12_CONTROL_POINT_PATCH = 19,
  D3D11_PRIMITIVE_13_CONTROL_POINT_PATCH = 20,
  D3D11_PRIMITIVE_14_CONTROL_POINT_PATCH = 21,
  D3D11_PRIMITIVE_15_CONTROL_POINT_PATCH = 22,
  D3D11_PRIMITIVE_16_CONTROL_POINT_PATCH = 23,
  D3D11_PRIMITIVE_17_CONTROL_POINT_PATCH = 24,
  D3D11_PRIMITIVE_18_CONTROL_POINT_PATCH = 25,
  D3D11_PRIMITIVE_19_CONTROL_POINT_PATCH = 26,
  D3D11_PRIMITIVE_20_CONTROL_POINT_PATCH = 28,
  D3D11_PRIMITIVE_21_CONTROL_POINT_PATCH = 29,
  D3D11_PRIMITIVE_22_CONTROL_POINT_PATCH = 30,
  D3D11_PRIMITIVE_23_CONTROL_POINT_PATCH = 31,
  D3D11_PRIMITIVE_24_CONTROL_POINT_PATCH = 32,
  D3D11_PRIMITIVE_25_CONTROL_POINT_PATCH = 33,
  D3D11_PRIMITIVE_26_CONTROL_POINT_PATCH = 34,
  D3D11_PRIMITIVE_27_CONTROL_POINT_PATCH = 35,
  D3D11_PRIMITIVE_28_CONTROL_POINT_PATCH = 36,
  D3D11_PRIMITIVE_29_CONTROL_POINT_PATCH = 37,
  D3D11_PRIMITIVE_30_CONTROL_POINT_PATCH = 38,
  D3D11_PRIMITIVE_31_CONTROL_POINT_PATCH = 39,
  D3D11_PRIMITIVE_32_CONTROL_POINT_PATCH = 40,
};

enum DEBUGMAYMOVE_LIFT_ENUM
{
  DEBUGMAYMOVE_NOT_LIFTED = 0,
  DEBUGMAYMOVE_LIFTED = 1,
};

enum tagCALLCONV
{
  CC_FASTCALL = 0,
  CC_CDECL = 1,
  CC_MSCPASCAL = 2,
  CC_PASCAL = 2,
  CC_MACPASCAL = 3,
  CC_STDCALL = 4,
  CC_FPFASTCALL = 5,
  CC_SYSCALL = 6,
  CC_MPWCDECL = 7,
  CC_MPWPASCAL = 8,
  CC_MAX = 9,
};

typedef enum _TAG_UNNAMED_17
{
  k_iCallback = 1005,
} TAG_UNNAMED_17, *PTAG_UNNAMED_17;

typedef enum _TAG_UNNAMED_18
{
  R_LIGHT_OVERRIDE_BLACK = 0,
  R_LIGHT_OVERRIDE_NONE = 1,
  R_LIGHT_OVERRIDE_INTENSITY_1 = 2,
  R_LIGHT_OVERRIDE_INTENSITY_2 = 3,
  R_LIGHT_OVERRIDE_INTENSITY_3 = 4,
  R_LIGHT_OVERRIDE_INTENSITY_4 = 5,
  R_LIGHT_OVERRIDE_INTENSITY_5 = 6,
  R_LIGHT_OVERRIDE_INTENSITY_6 = 7,
  R_LIGHT_OVERRIDE_INTENSITY_7 = 8,
  R_LIGHT_OVERRIDE_INTENSITY_8 = 9,
  R_LIGHT_OVERRIDE_INTENSITY_9 = 10,
  R_LIGHT_OVERRIDE_INTENSITY_10 = 11,
  R_LIGHT_OVERRIDE_INTENSITY_11 = 12,
  R_LIGHT_OVERRIDE_INTENSITY_12 = 13,
  R_LIGHT_OVERRIDE_INTENSITY_13 = 14,
  R_LIGHT_OVERRIDE_INTENSITY_14 = 15,
  R_LIGHT_OVERRIDE_INTENSITY_15 = 16,
  R_LIGHT_OVERRIDE_INTENSITY_16 = 17,
  R_LIGHT_OVERRIDE_INTENSITY_17 = 18,
  R_LIGHT_OVERRIDE_INTENSITY_18 = 19,
  R_LIGHT_OVERRIDE_INTENSITY_19 = 20,
  R_LIGHT_OVERRIDE_INTENSITY_20 = 21,
  R_LIGHT_OVERRIDE_INTENSITY_21 = 22,
  R_LIGHT_OVERRIDE_INTENSITY_22 = 23,
  R_LIGHT_OVERRIDE_INTENSITY_23 = 24,
  R_LIGHT_OVERRIDE_INTENSITY_24 = 25,
  R_LIGHT_OVERRIDE_INTENSITY_25 = 26,
  R_LIGHT_OVERRIDE_INTENSITY_26 = 27,
  R_LIGHT_OVERRIDE_INTENSITY_27 = 28,
  R_LIGHT_OVERRIDE_INTENSITY_28 = 29,
  R_LIGHT_OVERRIDE_INTENSITY_29 = 30,
  R_LIGHT_OVERRIDE_INTENSITY_30 = 31,
  R_LIGHT_OVERRIDE_INTENSITY_31 = 32,
  R_LIGHT_OVERRIDE_COUNT = 33,
} TAG_UNNAMED_18, *PTAG_UNNAMED_18;

enum FLAC__SubframeType
{
  FLAC__SUBFRAME_TYPE_CONSTANT = 0,
  FLAC__SUBFRAME_TYPE_VERBATIM = 1,
  FLAC__SUBFRAME_TYPE_FIXED = 2,
  FLAC__SUBFRAME_TYPE_LPC = 3,
};

struct $_s__RTTIBaseClassArray$_extraBytes_4
{
  /* 0x0000 */ const struct _s__RTTIBaseClassDescriptor2* arrayOfBaseClassDescriptors[1];
  /* 0x0004 */ char __PADDING__[1];
}; /* size: 0x0005 */

typedef enum __MIDL_ICodeInstall_0001
{
  CIP_DISK_FULL = 0,
  CIP_ACCESS_DENIED = 1,
  CIP_NEWER_VERSION_EXISTS = 2,
  CIP_OLDER_VERSION_EXISTS = 3,
  CIP_NAME_CONFLICT = 4,
  CIP_TRUST_VERIFICATION_COMPONENT_MISSING = 5,
  CIP_EXE_SELF_REGISTERATION_TIMEOUT = 6,
  CIP_UNSAFE_TO_ABORT = 7,
  CIP_NEED_REBOOT = 8,
  CIP_NEED_REBOOT_UI_PERMISSION = 9,
} _MIDL_ICodeInstall_0001, *P_MIDL_ICodeInstall_0001;

class EntHandle
{
  /* 0x0000 */ unsigned short number;
  /* 0x0002 */ unsigned short infoIndex;
}; /* size: 0x0004 */

struct entityShared_t
{
  /* 0x0000 */ unsigned char linked;
  /* 0x0001 */ unsigned char bmodel;
  /* 0x0002 */ unsigned char svFlags;
  /* 0x0003 */ unsigned char inuse;
  /* 0x0004 */ int broadcastTime;
  /* 0x0008 */ union vec3_t mins;
  /* 0x0014 */ union vec3_t maxs;
  /* 0x0020 */ int contents;
  /* 0x0024 */ union vec3_t absmin;
  /* 0x0030 */ union vec3_t absmax;
  /* 0x003c */ union vec3_t currentOrigin;
  /* 0x0048 */ union vec3_t currentAngles;
  /* 0x0054 */ class EntHandle ownerNum;
  /* 0x0058 */ int eventTime;
}; /* size: 0x005c */

typedef enum _TAG_UNNAMED_19
{
  SCR_XANIM_CLIENT = 0,
  SCR_XANIM_SERVER = 1,
  SCR_XANIM_COUNT = 2,
} TAG_UNNAMED_19, *PTAG_UNNAMED_19;

struct blowfish_key
{
  /* 0x0000 */ unsigned long S[256][4];
  /* 0x1000 */ unsigned long K[18];
}; /* size: 0x1048 */

typedef enum _TAG_UNNAMED_20
{
  BG_EMBLEM_ICON_TYPE_LOCKED = 0,
  BG_EMBLEM_ICON_TYPE_START = 1,
  BG_EMBLEM_ICON_TYPE_END = 15,
  BG_EMBLEM_ICON_TYPE_COUNT = 16,
} TAG_UNNAMED_20, *PTAG_UNNAMED_20;

typedef enum _FPIEEE_FORMAT
{
  _FpFormatFp32 = 0,
  _FpFormatFp64 = 1,
  _FpFormatFp80 = 2,
  _FpFormatFp128 = 3,
  _FpFormatI16 = 4,
  _FpFormatI32 = 5,
  _FpFormatI64 = 6,
  _FpFormatU16 = 7,
  _FpFormatU32 = 8,
  _FpFormatU64 = 9,
  _FpFormatBcd80 = 10,
  _FpFormatCompare = 11,
  _FpFormatString = 12,
} FPIEEE_FORMAT, *PFPIEEE_FORMAT;

struct XModelLodInfo
{
  /* 0x0000 */ float dist;
  /* 0x0004 */ unsigned short numsurfs;
  /* 0x0006 */ unsigned short surfIndex;
  /* 0x0008 */ int partBits[5];
}; /* size: 0x001c */

enum csParseFieldType_t
{
  CSPFT_STRING = 0,
  CSPFT_STRING_MAX_STRING_CHARS = 1,
  CSPFT_STRING_MAX_QPATH = 2,
  CSPFT_STRING_MAX_OSPATH = 3,
  CSPFT_INT = 4,
  CSPFT_UINT = 5,
  CSPFT_BOOL = 6,
  CSPFT_QBOOLEAN = 7,
  CSPFT_FLOAT = 8,
  CSPFT_MILLISECONDS = 9,
  CSPFT_FX = 10,
  CSPFT_XMODEL = 11,
  CSPFT_MATERIAL = 12,
  CSPFT_MATERIAL_STREAM = 13,
  CSPFT_PHYS_PRESET = 14,
  CSPFT_SCRIPT_STRING = 15,
  CSPFT_TRACER = 16,
  CSPFT_SOUND_ALIAS_ID = 17,
  CSPFT_NUM_BASE_FIELD_TYPES = 18,
};

enum NodeClaimSpecies
{
  NODE_CLAIM_SPECIES_BOT = 0,
  NODE_CLAIM_SPECIES_MAX = 1,
};

enum VehicleWheelType
{
  FL_WHEEL = 0,
  FR_WHEEL = 1,
  BL_WHEEL = 2,
  BR_WHEEL = 3,
  ML_WHEEL = 4,
  MR_WHEEL = 5,
  NUM_VEHICLE_WHEELS = 6,
};

typedef enum _FINDEX_SEARCH_OPS
{
  FindExSearchNameMatch = 0,
  FindExSearchLimitToDirectories = 1,
  FindExSearchLimitToDevices = 2,
  FindExSearchMaxSearchOp = 3,
} FINDEX_SEARCH_OPS, *PFINDEX_SEARCH_OPS;

class pulse_sum_cache
{
  /* 0x0000 */ float m_pulse_sum;
}; /* size: 0x0004 */

enum ENotificationPosition
{
  k_EPositionTopLeft = 0,
  k_EPositionTopRight = 1,
  k_EPositionBottomLeft = 2,
  k_EPositionBottomRight = 3,
};

typedef enum _TAG_UNNAMED_21
{
  MTL_ARG_MATERIAL_VERTEX_CONST = 0,
  MTL_ARG_LITERAL_VERTEX_CONST = 1,
  MTL_ARG_MATERIAL_PIXEL_SAMPLER = 2,
  MTL_ARG_CODE_PRIM_BEGIN = 3,
  MTL_ARG_CODE_VERTEX_CONST = 3,
  MTL_ARG_CODE_PIXEL_SAMPLER = 4,
  MTL_ARG_CODE_PIXEL_CONST = 5,
  MTL_ARG_CODE_PRIM_END = 6,
  MTL_ARG_MATERIAL_PIXEL_CONST = 6,
  MTL_ARG_LITERAL_PIXEL_CONST = 7,
  MLT_ARG_COUNT = 8,
} TAG_UNNAMED_21, *PTAG_UNNAMED_21;

enum D3D10_MESSAGE_CATEGORY
{
  D3D10_MESSAGE_CATEGORY_APPLICATION_DEFINED = 0,
  D3D10_MESSAGE_CATEGORY_MISCELLANEOUS = 1,
  D3D10_MESSAGE_CATEGORY_INITIALIZATION = 2,
  D3D10_MESSAGE_CATEGORY_CLEANUP = 3,
  D3D10_MESSAGE_CATEGORY_COMPILATION = 4,
  D3D10_MESSAGE_CATEGORY_STATE_CREATION = 5,
  D3D10_MESSAGE_CATEGORY_STATE_SETTING = 6,
  D3D10_MESSAGE_CATEGORY_STATE_GETTING = 7,
  D3D10_MESSAGE_CATEGORY_RESOURCE_MANIPULATION = 8,
  D3D10_MESSAGE_CATEGORY_EXECUTION = 9,
};

enum tagBINDSTRING
{
  BINDSTRING_HEADERS = 1,
  BINDSTRING_ACCEPT_MIMES = 2,
  BINDSTRING_EXTRA_URL = 3,
  BINDSTRING_LANGUAGE = 4,
  BINDSTRING_USERNAME = 5,
  BINDSTRING_PASSWORD = 6,
  BINDSTRING_UA_PIXELS = 7,
  BINDSTRING_UA_COLOR = 8,
  BINDSTRING_OS = 9,
  BINDSTRING_USER_AGENT = 10,
  BINDSTRING_ACCEPT_ENCODINGS = 11,
  BINDSTRING_POST_COOKIE = 12,
  BINDSTRING_POST_DATA_MIME = 13,
  BINDSTRING_URL = 14,
  BINDSTRING_IID = 15,
  BINDSTRING_FLAG_BIND_TO_OBJECT = 16,
  BINDSTRING_PTR_BIND_CONTEXT = 17,
};

enum c_pass_type
{
  main_pass = 0,
  huff_opt_pass = 1,
  output_pass = 2,
};

enum bdContentStreamingBase::bdStatus
{
  READY = 0,
  PRE_HTTP_OPERATION = 1,
  HTTP_OPERATION = 2,
  POST_HTTP_OPERATION = 3,
  DONE = 4,
  FAILED = 5,
};

class bdTag
{
  /* 0x0000 */ long Padding_1[2];
  /* 0x0008 */ unsigned __int64 m_priTag;
  /* 0x0010 */ unsigned __int64 m_secTag;
}; /* size: 0x0018 */

class bdFileMetaData
{
  /* 0x0000 */ long Padding_2[2];
  /* 0x0008 */ unsigned __int64 m_fileID;
  /* 0x0010 */ unsigned int m_createTime;
  /* 0x0014 */ unsigned int m_modifedTime;
  /* 0x0018 */ unsigned int m_fileSize;
  /* 0x001c */ long Padding_3;
  /* 0x0020 */ unsigned __int64 m_ownerID;
  /* 0x0028 */ char m_ownerName[64];
  /* 0x0068 */ unsigned short m_fileSlot;
  /* 0x006a */ char m_fileName[128];
  /* 0x00ea */ char m_url[384];
  /* 0x026a */ unsigned short m_category;
  /* 0x026c */ unsigned int m_numTags;
  /* 0x0270 */ unsigned char m_metaData[512];
  /* 0x0470 */ unsigned int m_metaDataSize;
  /* 0x0474 */ unsigned int m_summaryFileSize;
  /* 0x0478 */ class bdTag m_tags[60];
  /* 0x0a18 */ unsigned int m_numCopiesMade;
  /* 0x0a1c */ long Padding_4;
  /* 0x0a20 */ unsigned __int64 m_originID;
}; /* size: 0x0a28 */

class bdURL
{
  /* 0x0000 */ long Padding_5;
  /* 0x0004 */ char m_url[384];
  /* 0x0184 */ unsigned short m_serverType;
  /* 0x0186 */ char m_serverIndex[128];
  /* 0x0206 */ char Padding_6[2];
  /* 0x0208 */ unsigned __int64 m_fileID;
}; /* size: 0x0210 */

class bdPreCopyResult
{
  /* 0x0000 */ long Padding_7;
  /* 0x0004 */ class bdURL* m_source;
  /* 0x0008 */ char m_destination[384];
  /* 0x0188 */ unsigned int m_fileSize;
}; /* size: 0x018c */

class bdSummaryMetaHandler
{
}; /* size: 0x0a28 */

class bdReference<bdRemoteTask>
{
  /* 0x0000 */ class bdRemoteTask* m_ptr;
}; /* size: 0x0004 */

class bdStopwatch
{
  /* 0x0000 */ unsigned __int64 m_start;
}; /* size: 0x0008 */

class bdHTTPWrapper
{
  /* 0x0000 */ long Padding_8[8];
  /* 0x0020 */ void* m_curl;
  /* 0x0024 */ struct curl_slist* m_headerList;
  /* 0x0028 */ unsigned int m_bytesTransfered;
  /* 0x002c */ class bdDownloadInterceptor* m_downloadHandler;
  /* 0x0030 */ unsigned char* m_downloadBuffer;
  /* 0x0034 */ unsigned int m_downloadBufferSize;
  /* 0x0038 */ class bdUploadInterceptor* m_uploadHandler;
  /* 0x003c */ const unsigned char* m_uploadBuffer;
  /* 0x0040 */ unsigned int m_uploadSize;
  /* 0x0044 */ BOOL m_abortOperation;
  /* 0x0045 */ BOOL m_customVerification;
  /* 0x0046 */ char Padding_9[2];
  /* 0x0048 */ float m_dataRate;
  /* 0x004c */ long Padding_10;
  /* 0x0050 */ class bdStopwatch m_stopwatch;
  /* 0x0058 */ char* m_caPath;
  /* 0x005c */ char m_errorBuffer[1024];
  /* 0x045c */ int m_httpErrorCode;
  /* 0x0460 */ BOOL m_verboseOutput;
  /* 0x0461 */ BOOL m_progressMeter;
}; /* size: 0x0468 */

class bdHashMD5
{
}; /* size: 0x0004 */

class bdContentStreamingBase
{
  /* 0x0000 */ long Padding_11[2];
  /* 0x0008 */ unsigned int m_operation;
  /* 0x000c */ enum bdContentStreamingBase::bdStatus m_state;
  /* 0x0010 */ class bdUploadInterceptor* m_uploadHandler;
  /* 0x0014 */ long Padding_12;
  /* 0x0018 */ class bdFileMetaData m_taskData;
  /* 0x0a40 */ const void* m_uploadData;
  /* 0x0a44 */ class bdFileID* m_uploadFileID;
  /* 0x0a48 */ class bdURL m_URLs[3];
  /* 0x1078 */ const void* m_thumbData;
  /* 0x107c */ unsigned int m_thumbDataSize;
  /* 0x1080 */ unsigned short m_httpSite;
  /* 0x1082 */ BOOL m_sendChecksum;
  /* 0x1083 */ unsigned char m_checksum[33];
  /* 0x10a4 */ char m_clientLocale[16];
  /* 0x10b4 */ long Padding_13;
  /* 0x10b8 */ unsigned __int64 m_copySourceFileID;
  /* 0x10c0 */ BOOL m_wasCopyingPooledFile;
  /* 0x10c1 */ char Padding_14[3];
  /* 0x10c4 */ class bdDownloadInterceptor* m_downloadHandler;
  /* 0x10c8 */ class bdFileMetaData* m_downloadMetaData;
  /* 0x10cc */ void* m_downloadData;
  /* 0x10d0 */ unsigned int m_downloadDataSize;
  /* 0x10d4 */ unsigned int m_startByte;
  /* 0x10d8 */ unsigned int m_endByte;
  /* 0x10dc */ class bdPreCopyResult m_preCopyResults[3];
  /* 0x1580 */ BOOL m_uploadSummary;
  /* 0x1581 */ char Padding_15[7];
  /* 0x1588 */ class bdSummaryMetaHandler m_summaryMeta;
  /* 0x1fb0 */ class bdReference<bdRemoteTask> m_overallTask;
  /* 0x1fb4 */ class bdReference<bdRemoteTask> m_remoteTask;
  /* 0x1fb8 */ class bdHTTPWrapper m_http;
  /* 0x2420 */ class bdHashMD5 m_md5Hash;
  /* 0x2424 */ const class bdURL* m_testURLs;
  /* 0x2428 */ unsigned int m_testAddressCount;
  /* 0x242c */ BOOL m_useTestAddresses;
  /* 0x242d */ BOOL m_finalizeOnComplete;
  /* 0x242e */ char Padding_16[2];
  /* 0x2430 */ class bdRemoteTaskManager* m_remoteTaskManager;
  /* 0x0000 */ const char* const* s_statusStrings /* zero-length array */;
}; /* size: 0x2438 */

typedef struct _XMCOLOR
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned int b : 8; /* bit position: 0 */
      /* 0x0000 */ unsigned int g : 8; /* bit position: 8 */
      /* 0x0000 */ unsigned int r : 8; /* bit position: 16 */
      /* 0x0000 */ unsigned int a : 8; /* bit position: 24 */
    }; /* bitfield */
    /* 0x0000 */ unsigned int c;
  }; /* size: 0x0004 */
} XMCOLOR, *PXMCOLOR; /* size: 0x0004 */

enum tagVARKIND
{
  VAR_PERINSTANCE = 0,
  VAR_STATIC = 1,
  VAR_CONST = 2,
  VAR_DISPATCH = 3,
};

typedef enum _TAG_UNNAMED_22
{
  SAMPLER_FILTER_SHIFT = 0,
  SAMPLER_FILTER_NEAREST = 1,
  SAMPLER_FILTER_LINEAR = 2,
  SAMPLER_FILTER_ANISO2X = 3,
  SAMPLER_FILTER_ANISO4X = 4,
  SAMPLER_FILTER_COMPARE = 5,
  SAMPLER_FILTER_MASK = 7,
  SAMPLER_MIPMAP_SHIFT = 3,
  SAMPLER_MIPMAP_DISABLED = 0,
  SAMPLER_MIPMAP_NEAREST = 8,
  SAMPLER_MIPMAP_LINEAR = 16,
  SAMPLER_MIPMAP_COUNT = 3,
  SAMPLER_MIPMAP_MASK = 24,
  SAMPLER_CLAMP_U_SHIFT = 5,
  SAMPLER_CLAMP_V_SHIFT = 6,
  SAMPLER_CLAMP_W_SHIFT = 7,
  SAMPLER_CLAMP_U = 32,
  SAMPLER_CLAMP_V = 64,
  SAMPLER_CLAMP_W = 128,
  SAMPLER_CLAMP_MASK = 224,
  SAMPLER_ANISO_SHIFT = 8,
  SAMPLER_ANISO_1X = 0,
  SAMPLER_ANISO_2X = 256,
  SAMPLER_ANISO_4X = 512,
  SAMPLER_ANISO_6X = 768,
  SAMPLER_ANISO_8X = 1024,
  SAMPLER_ANISO_10X = 1280,
  SAMPLER_ANISO_12X = 1536,
  SAMPLER_ANISO_16X = 1792,
  SAMPLER_ANISO_MASK = 1792,
  SAMPLER_CONVOLUTION = 0x20000,
  SAMPLER_GAMMA = 0x40000,
  SAMPLER_UNNORMALIZED_UV = 0x80000,
  SAMPLER_DIRECT_FILTER_UNNORMALIZED = 0x80000,
} TAG_UNNAMED_22, *PTAG_UNNAMED_22;

enum e_mapSelectionColumns
{
  FEEDER_MAPSELECTION_COLUMN_BACKGROUND = 0,
  FEEDER_MAPSELECTION_COLUMN_NAME = 1,
  FEEDER_MAPSELECTION_COLUMN_A_BUTTON = 2,
};

typedef struct _XMXICON4
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ __int64 x : 20; /* bit position: 0 */
      /* 0x0000 */ __int64 y : 20; /* bit position: 20 */
      /* 0x0000 */ __int64 z : 20; /* bit position: 40 */
      /* 0x0000 */ unsigned __int64 w : 4; /* bit position: 60 */
    }; /* bitfield */
    /* 0x0000 */ unsigned __int64 v;
  }; /* size: 0x0008 */
} XMXICON4, *PXMXICON4; /* size: 0x0008 */

typedef enum _TAG_UNNAMED_23
{
  VEH_ENGINESND_FADE_IN_START = 0,
  VEH_ENGINESND_FADE_IN_END = 1,
  VEH_ENGINESND_FADE_OUT_START = 2,
  VEH_ENGINESND_FADE_OUT_END = 3,
  VEH_ENGINESND_PITCH_REF = 4,
  NUM_VEHICLE_ENGINESND_PARAMS = 5,
} TAG_UNNAMED_23, *PTAG_UNNAMED_23;

struct scrVarDebugPub_t
{
  /* 0x0000 */ unsigned char** objectVarUsage;
  /* 0x0004 */ unsigned char** childVarUsage;
  /* 0x0008 */ unsigned short* extRefCount;
  /* 0x000c */ int* objectLeakCount;
  /* 0x0010 */ int* childLeakCount;
  /* 0x0014 */ BOOL dummy;
  /* 0x0015 */ char __PADDING__[3];
}; /* size: 0x0018 */

enum scriptAnimAIFunctionTypes_t
{
  AI_ANIM_FUNCTION_STOP = 0,
  AI_ANIM_FUNCTION_MOVE = 1,
  AI_ANIM_FUNCTION_COMBAT = 2,
  AI_ANIM_FUNCTION_PAIN = 3,
  AI_ANIM_FUNCTION_REACT = 4,
  AI_ANIM_FUNCTION_DEATH = 5,
};

enum VehicleMaterialSound
{
  VEH_WHEEL_ROAD_NOISE = 0,
  VEH_WHEEL_SLIDING = 1,
  VEH_WHEEL_PEELING_OUT = 2,
  NUM_VEHICLE_MATERIAL_SNDS = 3,
};

enum GfxRenderCommand
{
  RC_END_OF_LIST = 0,
  RC_SET_CUSTOM_CONSTANT = 1,
  RC_SET_MATERIAL_COLOR = 2,
  RC_SAVE_SCREEN = 3,
  RC_SAVE_SCREEN_SECTION = 4,
  RC_CLEAR_SCREEN = 5,
  RC_BEGIN_VIEW = 6,
  RC_SET_VIEWPORT = 7,
  RC_SET_SCISSOR = 8,
  RC_RESOLVE_COMPOSITE = 9,
  RC_PC_COPY_IMAGE_GEN_MIP = 10,
  RC_FIRST_NONCRITICAL = 11,
  RC_STRETCH_PIC = 11,
  RC_STRETCH_PIC_FLIP_ST = 12,
  RC_STRETCH_PIC_ROTATE_XY = 13,
  RC_STRETCH_PIC_ROTATE_ST = 14,
  RC_DRAW_QUAD_PIC = 15,
  RC_DRAW_FULL_SCREEN_COLORED_QUAD = 16,
  RC_DRAW_TEXT_2D = 17,
  RC_DRAW_TEXT_3D = 18,
  RC_BLEND_SAVED_SCREEN_BLURRED = 19,
  RC_BLEND_SAVED_SCREEN_FLASHED = 20,
  RC_DRAW_POINTS = 21,
  RC_DRAW_LINES = 22,
  RC_DRAW_UI_QUADS = 23,
  RC_DRAW_UI_QUADS_REPLACE_IMAGE = 24,
  RC_DRAW_TRIANGLES = 25,
  RC_DRAW_UI_TRIANGLES = 26,
  RC_DRAW_QUADLIST_2D = 27,
  RC_DRAW_EMBLEM_LAYER = 28,
  RC_STRETCH_COMPOSITE = 29,
  RC_PROJECTION_SET = 30,
  RC_DRAW_FRAMED = 31,
  RC_CONSTANT_SET = 32,
  RC_COUNT = 33,
};

typedef enum _TAG_UNNAMED_24
{
  OPERATOR = 0,
  OPERAND = 1,
  INVALID_ENTRY_TYPE = 2,
} TAG_UNNAMED_24, *PTAG_UNNAMED_24;

enum D3D10_MESSAGE_ID
{
  D3D10_MESSAGE_ID_UNKNOWN = 0,
  D3D10_MESSAGE_ID_DEVICE_IASETVERTEXBUFFERS_HAZARD = 1,
  D3D10_MESSAGE_ID_DEVICE_IASETINDEXBUFFER_HAZARD = 2,
  D3D10_MESSAGE_ID_DEVICE_VSSETSHADERRESOURCES_HAZARD = 3,
  D3D10_MESSAGE_ID_DEVICE_VSSETCONSTANTBUFFERS_HAZARD = 4,
  D3D10_MESSAGE_ID_DEVICE_GSSETSHADERRESOURCES_HAZARD = 5,
  D3D10_MESSAGE_ID_DEVICE_GSSETCONSTANTBUFFERS_HAZARD = 6,
  D3D10_MESSAGE_ID_DEVICE_PSSETSHADERRESOURCES_HAZARD = 7,
  D3D10_MESSAGE_ID_DEVICE_PSSETCONSTANTBUFFERS_HAZARD = 8,
  D3D10_MESSAGE_ID_DEVICE_OMSETRENDERTARGETS_HAZARD = 9,
  D3D10_MESSAGE_ID_DEVICE_SOSETTARGETS_HAZARD = 10,
  D3D10_MESSAGE_ID_STRING_FROM_APPLICATION = 11,
  D3D10_MESSAGE_ID_CORRUPTED_THIS = 12,
  D3D10_MESSAGE_ID_CORRUPTED_PARAMETER1 = 13,
  D3D10_MESSAGE_ID_CORRUPTED_PARAMETER2 = 14,
  D3D10_MESSAGE_ID_CORRUPTED_PARAMETER3 = 15,
  D3D10_MESSAGE_ID_CORRUPTED_PARAMETER4 = 16,
  D3D10_MESSAGE_ID_CORRUPTED_PARAMETER5 = 17,
  D3D10_MESSAGE_ID_CORRUPTED_PARAMETER6 = 18,
  D3D10_MESSAGE_ID_CORRUPTED_PARAMETER7 = 19,
  D3D10_MESSAGE_ID_CORRUPTED_PARAMETER8 = 20,
  D3D10_MESSAGE_ID_CORRUPTED_PARAMETER9 = 21,
  D3D10_MESSAGE_ID_CORRUPTED_PARAMETER10 = 22,
  D3D10_MESSAGE_ID_CORRUPTED_PARAMETER11 = 23,
  D3D10_MESSAGE_ID_CORRUPTED_PARAMETER12 = 24,
  D3D10_MESSAGE_ID_CORRUPTED_PARAMETER13 = 25,
  D3D10_MESSAGE_ID_CORRUPTED_PARAMETER14 = 26,
  D3D10_MESSAGE_ID_CORRUPTED_PARAMETER15 = 27,
  D3D10_MESSAGE_ID_CORRUPTED_MULTITHREADING = 28,
  D3D10_MESSAGE_ID_MESSAGE_REPORTING_OUTOFMEMORY = 29,
  D3D10_MESSAGE_ID_IASETINPUTLAYOUT_UNBINDDELETINGOBJECT = 30,
  D3D10_MESSAGE_ID_IASETVERTEXBUFFERS_UNBINDDELETINGOBJECT = 31,
  D3D10_MESSAGE_ID_IASETINDEXBUFFER_UNBINDDELETINGOBJECT = 32,
  D3D10_MESSAGE_ID_VSSETSHADER_UNBINDDELETINGOBJECT = 33,
  D3D10_MESSAGE_ID_VSSETSHADERRESOURCES_UNBINDDELETINGOBJECT = 34,
  D3D10_MESSAGE_ID_VSSETCONSTANTBUFFERS_UNBINDDELETINGOBJECT = 35,
  D3D10_MESSAGE_ID_VSSETSAMPLERS_UNBINDDELETINGOBJECT = 36,
  D3D10_MESSAGE_ID_GSSETSHADER_UNBINDDELETINGOBJECT = 37,
  D3D10_MESSAGE_ID_GSSETSHADERRESOURCES_UNBINDDELETINGOBJECT = 38,
  D3D10_MESSAGE_ID_GSSETCONSTANTBUFFERS_UNBINDDELETINGOBJECT = 39,
  D3D10_MESSAGE_ID_GSSETSAMPLERS_UNBINDDELETINGOBJECT = 40,
  D3D10_MESSAGE_ID_SOSETTARGETS_UNBINDDELETINGOBJECT = 41,
  D3D10_MESSAGE_ID_PSSETSHADER_UNBINDDELETINGOBJECT = 42,
  D3D10_MESSAGE_ID_PSSETSHADERRESOURCES_UNBINDDELETINGOBJECT = 43,
  D3D10_MESSAGE_ID_PSSETCONSTANTBUFFERS_UNBINDDELETINGOBJECT = 44,
  D3D10_MESSAGE_ID_PSSETSAMPLERS_UNBINDDELETINGOBJECT = 45,
  D3D10_MESSAGE_ID_RSSETSTATE_UNBINDDELETINGOBJECT = 46,
  D3D10_MESSAGE_ID_OMSETBLENDSTATE_UNBINDDELETINGOBJECT = 47,
  D3D10_MESSAGE_ID_OMSETDEPTHSTENCILSTATE_UNBINDDELETINGOBJECT = 48,
  D3D10_MESSAGE_ID_OMSETRENDERTARGETS_UNBINDDELETINGOBJECT = 49,
  D3D10_MESSAGE_ID_SETPREDICATION_UNBINDDELETINGOBJECT = 50,
  D3D10_MESSAGE_ID_GETPRIVATEDATA_MOREDATA = 51,
  D3D10_MESSAGE_ID_SETPRIVATEDATA_INVALIDFREEDATA = 52,
  D3D10_MESSAGE_ID_SETPRIVATEDATA_INVALIDIUNKNOWN = 53,
  D3D10_MESSAGE_ID_SETPRIVATEDATA_INVALIDFLAGS = 54,
  D3D10_MESSAGE_ID_SETPRIVATEDATA_CHANGINGPARAMS = 55,
  D3D10_MESSAGE_ID_SETPRIVATEDATA_OUTOFMEMORY = 56,
  D3D10_MESSAGE_ID_CREATEBUFFER_UNRECOGNIZEDFORMAT = 57,
  D3D10_MESSAGE_ID_CREATEBUFFER_INVALIDSAMPLES = 58,
  D3D10_MESSAGE_ID_CREATEBUFFER_UNRECOGNIZEDUSAGE = 59,
  D3D10_MESSAGE_ID_CREATEBUFFER_UNRECOGNIZEDBINDFLAGS = 60,
  D3D10_MESSAGE_ID_CREATEBUFFER_UNRECOGNIZEDCPUACCESSFLAGS = 61,
  D3D10_MESSAGE_ID_CREATEBUFFER_UNRECOGNIZEDMISCFLAGS = 62,
  D3D10_MESSAGE_ID_CREATEBUFFER_INVALIDCPUACCESSFLAGS = 63,
  D3D10_MESSAGE_ID_CREATEBUFFER_INVALIDBINDFLAGS = 64,
  D3D10_MESSAGE_ID_CREATEBUFFER_INVALIDINITIALDATA = 65,
  D3D10_MESSAGE_ID_CREATEBUFFER_INVALIDDIMENSIONS = 66,
  D3D10_MESSAGE_ID_CREATEBUFFER_INVALIDMIPLEVELS = 67,
  D3D10_MESSAGE_ID_CREATEBUFFER_INVALIDMISCFLAGS = 68,
  D3D10_MESSAGE_ID_CREATEBUFFER_INVALIDARG_RETURN = 69,
  D3D10_MESSAGE_ID_CREATEBUFFER_OUTOFMEMORY_RETURN = 70,
  D3D10_MESSAGE_ID_CREATEBUFFER_NULLDESC = 71,
  D3D10_MESSAGE_ID_CREATEBUFFER_INVALIDCONSTANTBUFFERBINDINGS = 72,
  D3D10_MESSAGE_ID_CREATEBUFFER_LARGEALLOCATION = 73,
  D3D10_MESSAGE_ID_CREATETEXTURE1D_UNRECOGNIZEDFORMAT = 74,
  D3D10_MESSAGE_ID_CREATETEXTURE1D_UNSUPPORTEDFORMAT = 75,
  D3D10_MESSAGE_ID_CREATETEXTURE1D_INVALIDSAMPLES = 76,
  D3D10_MESSAGE_ID_CREATETEXTURE1D_UNRECOGNIZEDUSAGE = 77,
  D3D10_MESSAGE_ID_CREATETEXTURE1D_UNRECOGNIZEDBINDFLAGS = 78,
  D3D10_MESSAGE_ID_CREATETEXTURE1D_UNRECOGNIZEDCPUACCESSFLAGS = 79,
  D3D10_MESSAGE_ID_CREATETEXTURE1D_UNRECOGNIZEDMISCFLAGS = 80,
  D3D10_MESSAGE_ID_CREATETEXTURE1D_INVALIDCPUACCESSFLAGS = 81,
  D3D10_MESSAGE_ID_CREATETEXTURE1D_INVALIDBINDFLAGS = 82,
  D3D10_MESSAGE_ID_CREATETEXTURE1D_INVALIDINITIALDATA = 83,
  D3D10_MESSAGE_ID_CREATETEXTURE1D_INVALIDDIMENSIONS = 84,
  D3D10_MESSAGE_ID_CREATETEXTURE1D_INVALIDMIPLEVELS = 85,
  D3D10_MESSAGE_ID_CREATETEXTURE1D_INVALIDMISCFLAGS = 86,
  D3D10_MESSAGE_ID_CREATETEXTURE1D_INVALIDARG_RETURN = 87,
  D3D10_MESSAGE_ID_CREATETEXTURE1D_OUTOFMEMORY_RETURN = 88,
  D3D10_MESSAGE_ID_CREATETEXTURE1D_NULLDESC = 89,
  D3D10_MESSAGE_ID_CREATETEXTURE1D_LARGEALLOCATION = 90,
  D3D10_MESSAGE_ID_CREATETEXTURE2D_UNRECOGNIZEDFORMAT = 91,
  D3D10_MESSAGE_ID_CREATETEXTURE2D_UNSUPPORTEDFORMAT = 92,
  D3D10_MESSAGE_ID_CREATETEXTURE2D_INVALIDSAMPLES = 93,
  D3D10_MESSAGE_ID_CREATETEXTURE2D_UNRECOGNIZEDUSAGE = 94,
  D3D10_MESSAGE_ID_CREATETEXTURE2D_UNRECOGNIZEDBINDFLAGS = 95,
  D3D10_MESSAGE_ID_CREATETEXTURE2D_UNRECOGNIZEDCPUACCESSFLAGS = 96,
  D3D10_MESSAGE_ID_CREATETEXTURE2D_UNRECOGNIZEDMISCFLAGS = 97,
  D3D10_MESSAGE_ID_CREATETEXTURE2D_INVALIDCPUACCESSFLAGS = 98,
  D3D10_MESSAGE_ID_CREATETEXTURE2D_INVALIDBINDFLAGS = 99,
  D3D10_MESSAGE_ID_CREATETEXTURE2D_INVALIDINITIALDATA = 100,
  D3D10_MESSAGE_ID_CREATETEXTURE2D_INVALIDDIMENSIONS = 101,
  D3D10_MESSAGE_ID_CREATETEXTURE2D_INVALIDMIPLEVELS = 102,
  D3D10_MESSAGE_ID_CREATETEXTURE2D_INVALIDMISCFLAGS = 103,
  D3D10_MESSAGE_ID_CREATETEXTURE2D_INVALIDARG_RETURN = 104,
  D3D10_MESSAGE_ID_CREATETEXTURE2D_OUTOFMEMORY_RETURN = 105,
  D3D10_MESSAGE_ID_CREATETEXTURE2D_NULLDESC = 106,
  D3D10_MESSAGE_ID_CREATETEXTURE2D_LARGEALLOCATION = 107,
  D3D10_MESSAGE_ID_CREATETEXTURE3D_UNRECOGNIZEDFORMAT = 108,
  D3D10_MESSAGE_ID_CREATETEXTURE3D_UNSUPPORTEDFORMAT = 109,
  D3D10_MESSAGE_ID_CREATETEXTURE3D_INVALIDSAMPLES = 110,
  D3D10_MESSAGE_ID_CREATETEXTURE3D_UNRECOGNIZEDUSAGE = 111,
  D3D10_MESSAGE_ID_CREATETEXTURE3D_UNRECOGNIZEDBINDFLAGS = 112,
  D3D10_MESSAGE_ID_CREATETEXTURE3D_UNRECOGNIZEDCPUACCESSFLAGS = 113,
  D3D10_MESSAGE_ID_CREATETEXTURE3D_UNRECOGNIZEDMISCFLAGS = 114,
  D3D10_MESSAGE_ID_CREATETEXTURE3D_INVALIDCPUACCESSFLAGS = 115,
  D3D10_MESSAGE_ID_CREATETEXTURE3D_INVALIDBINDFLAGS = 116,
  D3D10_MESSAGE_ID_CREATETEXTURE3D_INVALIDINITIALDATA = 117,
  D3D10_MESSAGE_ID_CREATETEXTURE3D_INVALIDDIMENSIONS = 118,
  D3D10_MESSAGE_ID_CREATETEXTURE3D_INVALIDMIPLEVELS = 119,
  D3D10_MESSAGE_ID_CREATETEXTURE3D_INVALIDMISCFLAGS = 120,
  D3D10_MESSAGE_ID_CREATETEXTURE3D_INVALIDARG_RETURN = 121,
  D3D10_MESSAGE_ID_CREATETEXTURE3D_OUTOFMEMORY_RETURN = 122,
  D3D10_MESSAGE_ID_CREATETEXTURE3D_NULLDESC = 123,
  D3D10_MESSAGE_ID_CREATETEXTURE3D_LARGEALLOCATION = 124,
  D3D10_MESSAGE_ID_CREATESHADERRESOURCEVIEW_UNRECOGNIZEDFORMAT = 125,
  D3D10_MESSAGE_ID_CREATESHADERRESOURCEVIEW_INVALIDDESC = 126,
  D3D10_MESSAGE_ID_CREATESHADERRESOURCEVIEW_INVALIDFORMAT = 127,
  D3D10_MESSAGE_ID_CREATESHADERRESOURCEVIEW_INVALIDDIMENSIONS = 128,
  D3D10_MESSAGE_ID_CREATESHADERRESOURCEVIEW_INVALIDRESOURCE = 129,
  D3D10_MESSAGE_ID_CREATESHADERRESOURCEVIEW_TOOMANYOBJECTS = 130,
  D3D10_MESSAGE_ID_CREATESHADERRESOURCEVIEW_INVALIDARG_RETURN = 131,
  D3D10_MESSAGE_ID_CREATESHADERRESOURCEVIEW_OUTOFMEMORY_RETURN = 132,
  D3D10_MESSAGE_ID_CREATERENDERTARGETVIEW_UNRECOGNIZEDFORMAT = 133,
  D3D10_MESSAGE_ID_CREATERENDERTARGETVIEW_UNSUPPORTEDFORMAT = 134,
  D3D10_MESSAGE_ID_CREATERENDERTARGETVIEW_INVALIDDESC = 135,
  D3D10_MESSAGE_ID_CREATERENDERTARGETVIEW_INVALIDFORMAT = 136,
  D3D10_MESSAGE_ID_CREATERENDERTARGETVIEW_INVALIDDIMENSIONS = 137,
  D3D10_MESSAGE_ID_CREATERENDERTARGETVIEW_INVALIDRESOURCE = 138,
  D3D10_MESSAGE_ID_CREATERENDERTARGETVIEW_TOOMANYOBJECTS = 139,
  D3D10_MESSAGE_ID_CREATERENDERTARGETVIEW_INVALIDARG_RETURN = 140,
  D3D10_MESSAGE_ID_CREATERENDERTARGETVIEW_OUTOFMEMORY_RETURN = 141,
  D3D10_MESSAGE_ID_CREATEDEPTHSTENCILVIEW_UNRECOGNIZEDFORMAT = 142,
  D3D10_MESSAGE_ID_CREATEDEPTHSTENCILVIEW_INVALIDDESC = 143,
  D3D10_MESSAGE_ID_CREATEDEPTHSTENCILVIEW_INVALIDFORMAT = 144,
  D3D10_MESSAGE_ID_CREATEDEPTHSTENCILVIEW_INVALIDDIMENSIONS = 145,
  D3D10_MESSAGE_ID_CREATEDEPTHSTENCILVIEW_INVALIDRESOURCE = 146,
  D3D10_MESSAGE_ID_CREATEDEPTHSTENCILVIEW_TOOMANYOBJECTS = 147,
  D3D10_MESSAGE_ID_CREATEDEPTHSTENCILVIEW_INVALIDARG_RETURN = 148,
  D3D10_MESSAGE_ID_CREATEDEPTHSTENCILVIEW_OUTOFMEMORY_RETURN = 149,
  D3D10_MESSAGE_ID_CREATEINPUTLAYOUT_OUTOFMEMORY = 150,
  D3D10_MESSAGE_ID_CREATEINPUTLAYOUT_TOOMANYELEMENTS = 151,
  D3D10_MESSAGE_ID_CREATEINPUTLAYOUT_INVALIDFORMAT = 152,
  D3D10_MESSAGE_ID_CREATEINPUTLAYOUT_INCOMPATIBLEFORMAT = 153,
  D3D10_MESSAGE_ID_CREATEINPUTLAYOUT_INVALIDSLOT = 154,
  D3D10_MESSAGE_ID_CREATEINPUTLAYOUT_INVALIDINPUTSLOTCLASS = 155,
  D3D10_MESSAGE_ID_CREATEINPUTLAYOUT_STEPRATESLOTCLASSMISMATCH = 156,
  D3D10_MESSAGE_ID_CREATEINPUTLAYOUT_INVALIDSLOTCLASSCHANGE = 157,
  D3D10_MESSAGE_ID_CREATEINPUTLAYOUT_INVALIDSTEPRATECHANGE = 158,
  D3D10_MESSAGE_ID_CREATEINPUTLAYOUT_INVALIDALIGNMENT = 159,
  D3D10_MESSAGE_ID_CREATEINPUTLAYOUT_DUPLICATESEMANTIC = 160,
  D3D10_MESSAGE_ID_CREATEINPUTLAYOUT_UNPARSEABLEINPUTSIGNATURE = 161,
  D3D10_MESSAGE_ID_CREATEINPUTLAYOUT_NULLSEMANTIC = 162,
  D3D10_MESSAGE_ID_CREATEINPUTLAYOUT_MISSINGELEMENT = 163,
  D3D10_MESSAGE_ID_CREATEINPUTLAYOUT_NULLDESC = 164,
  D3D10_MESSAGE_ID_CREATEVERTEXSHADER_OUTOFMEMORY = 165,
  D3D10_MESSAGE_ID_CREATEVERTEXSHADER_INVALIDSHADERBYTECODE = 166,
  D3D10_MESSAGE_ID_CREATEVERTEXSHADER_INVALIDSHADERTYPE = 167,
  D3D10_MESSAGE_ID_CREATEGEOMETRYSHADER_OUTOFMEMORY = 168,
  D3D10_MESSAGE_ID_CREATEGEOMETRYSHADER_INVALIDSHADERBYTECODE = 169,
  D3D10_MESSAGE_ID_CREATEGEOMETRYSHADER_INVALIDSHADERTYPE = 170,
  D3D10_MESSAGE_ID_CREATEGEOMETRYSHADERWITHSTREAMOUTPUT_OUTOFMEMORY = 171,
  D3D10_MESSAGE_ID_CREATEGEOMETRYSHADERWITHSTREAMOUTPUT_INVALIDSHADERBYTECODE = 172,
  D3D10_MESSAGE_ID_CREATEGEOMETRYSHADERWITHSTREAMOUTPUT_INVALIDSHADERTYPE = 173,
  D3D10_MESSAGE_ID_CREATEGEOMETRYSHADERWITHSTREAMOUTPUT_INVALIDNUMENTRIES = 174,
  D3D10_MESSAGE_ID_CREATEGEOMETRYSHADERWITHSTREAMOUTPUT_OUTPUTSTREAMSTRIDEUNUSED = 175,
  D3D10_MESSAGE_ID_CREATEGEOMETRYSHADERWITHSTREAMOUTPUT_UNEXPECTEDDECL = 176,
  D3D10_MESSAGE_ID_CREATEGEOMETRYSHADERWITHSTREAMOUTPUT_EXPECTEDDECL = 177,
  D3D10_MESSAGE_ID_CREATEGEOMETRYSHADERWITHSTREAMOUTPUT_OUTPUTSLOT0EXPECTED = 178,
  D3D10_MESSAGE_ID_CREATEGEOMETRYSHADERWITHSTREAMOUTPUT_INVALIDOUTPUTSLOT = 179,
  D3D10_MESSAGE_ID_CREATEGEOMETRYSHADERWITHSTREAMOUTPUT_ONLYONEELEMENTPERSLOT = 180,
  D3D10_MESSAGE_ID_CREATEGEOMETRYSHADERWITHSTREAMOUTPUT_INVALIDCOMPONENTCOUNT = 181,
  D3D10_MESSAGE_ID_CREATEGEOMETRYSHADERWITHSTREAMOUTPUT_INVALIDSTARTCOMPONENTANDCOMPONENTCOUNT = 182,
  D3D10_MESSAGE_ID_CREATEGEOMETRYSHADERWITHSTREAMOUTPUT_INVALIDGAPDEFINITION = 183,
  D3D10_MESSAGE_ID_CREATEGEOMETRYSHADERWITHSTREAMOUTPUT_REPEATEDOUTPUT = 184,
  D3D10_MESSAGE_ID_CREATEGEOMETRYSHADERWITHSTREAMOUTPUT_INVALIDOUTPUTSTREAMSTRIDE = 185,
  D3D10_MESSAGE_ID_CREATEGEOMETRYSHADERWITHSTREAMOUTPUT_MISSINGSEMANTIC = 186,
  D3D10_MESSAGE_ID_CREATEGEOMETRYSHADERWITHSTREAMOUTPUT_MASKMISMATCH = 187,
  D3D10_MESSAGE_ID_CREATEGEOMETRYSHADERWITHSTREAMOUTPUT_CANTHAVEONLYGAPS = 188,
  D3D10_MESSAGE_ID_CREATEGEOMETRYSHADERWITHSTREAMOUTPUT_DECLTOOCOMPLEX = 189,
  D3D10_MESSAGE_ID_CREATEGEOMETRYSHADERWITHSTREAMOUTPUT_MISSINGOUTPUTSIGNATURE = 190,
  D3D10_MESSAGE_ID_CREATEPIXELSHADER_OUTOFMEMORY = 191,
  D3D10_MESSAGE_ID_CREATEPIXELSHADER_INVALIDSHADERBYTECODE = 192,
  D3D10_MESSAGE_ID_CREATEPIXELSHADER_INVALIDSHADERTYPE = 193,
  D3D10_MESSAGE_ID_CREATERASTERIZERSTATE_INVALIDFILLMODE = 194,
  D3D10_MESSAGE_ID_CREATERASTERIZERSTATE_INVALIDCULLMODE = 195,
  D3D10_MESSAGE_ID_CREATERASTERIZERSTATE_INVALIDDEPTHBIASCLAMP = 196,
  D3D10_MESSAGE_ID_CREATERASTERIZERSTATE_INVALIDSLOPESCALEDDEPTHBIAS = 197,
  D3D10_MESSAGE_ID_CREATERASTERIZERSTATE_TOOMANYOBJECTS = 198,
  D3D10_MESSAGE_ID_CREATERASTERIZERSTATE_NULLDESC = 199,
  D3D10_MESSAGE_ID_CREATEDEPTHSTENCILSTATE_INVALIDDEPTHWRITEMASK = 200,
  D3D10_MESSAGE_ID_CREATEDEPTHSTENCILSTATE_INVALIDDEPTHFUNC = 201,
  D3D10_MESSAGE_ID_CREATEDEPTHSTENCILSTATE_INVALIDFRONTFACESTENCILFAILOP = 202,
  D3D10_MESSAGE_ID_CREATEDEPTHSTENCILSTATE_INVALIDFRONTFACESTENCILZFAILOP = 203,
  D3D10_MESSAGE_ID_CREATEDEPTHSTENCILSTATE_INVALIDFRONTFACESTENCILPASSOP = 204,
  D3D10_MESSAGE_ID_CREATEDEPTHSTENCILSTATE_INVALIDFRONTFACESTENCILFUNC = 205,
  D3D10_MESSAGE_ID_CREATEDEPTHSTENCILSTATE_INVALIDBACKFACESTENCILFAILOP = 206,
  D3D10_MESSAGE_ID_CREATEDEPTHSTENCILSTATE_INVALIDBACKFACESTENCILZFAILOP = 207,
  D3D10_MESSAGE_ID_CREATEDEPTHSTENCILSTATE_INVALIDBACKFACESTENCILPASSOP = 208,
  D3D10_MESSAGE_ID_CREATEDEPTHSTENCILSTATE_INVALIDBACKFACESTENCILFUNC = 209,
  D3D10_MESSAGE_ID_CREATEDEPTHSTENCILSTATE_TOOMANYOBJECTS = 210,
  D3D10_MESSAGE_ID_CREATEDEPTHSTENCILSTATE_NULLDESC = 211,
  D3D10_MESSAGE_ID_CREATEBLENDSTATE_INVALIDSRCBLEND = 212,
  D3D10_MESSAGE_ID_CREATEBLENDSTATE_INVALIDDESTBLEND = 213,
  D3D10_MESSAGE_ID_CREATEBLENDSTATE_INVALIDBLENDOP = 214,
  D3D10_MESSAGE_ID_CREATEBLENDSTATE_INVALIDSRCBLENDALPHA = 215,
  D3D10_MESSAGE_ID_CREATEBLENDSTATE_INVALIDDESTBLENDALPHA = 216,
  D3D10_MESSAGE_ID_CREATEBLENDSTATE_INVALIDBLENDOPALPHA = 217,
  D3D10_MESSAGE_ID_CREATEBLENDSTATE_INVALIDRENDERTARGETWRITEMASK = 218,
  D3D10_MESSAGE_ID_CREATEBLENDSTATE_TOOMANYOBJECTS = 219,
  D3D10_MESSAGE_ID_CREATEBLENDSTATE_NULLDESC = 220,
  D3D10_MESSAGE_ID_CREATESAMPLERSTATE_INVALIDFILTER = 221,
  D3D10_MESSAGE_ID_CREATESAMPLERSTATE_INVALIDADDRESSU = 222,
  D3D10_MESSAGE_ID_CREATESAMPLERSTATE_INVALIDADDRESSV = 223,
  D3D10_MESSAGE_ID_CREATESAMPLERSTATE_INVALIDADDRESSW = 224,
  D3D10_MESSAGE_ID_CREATESAMPLERSTATE_INVALIDMIPLODBIAS = 225,
  D3D10_MESSAGE_ID_CREATESAMPLERSTATE_INVALIDMAXANISOTROPY = 226,
  D3D10_MESSAGE_ID_CREATESAMPLERSTATE_INVALIDCOMPARISONFUNC = 227,
  D3D10_MESSAGE_ID_CREATESAMPLERSTATE_INVALIDMINLOD = 228,
  D3D10_MESSAGE_ID_CREATESAMPLERSTATE_INVALIDMAXLOD = 229,
  D3D10_MESSAGE_ID_CREATESAMPLERSTATE_TOOMANYOBJECTS = 230,
  D3D10_MESSAGE_ID_CREATESAMPLERSTATE_NULLDESC = 231,
  D3D10_MESSAGE_ID_CREATEQUERYORPREDICATE_INVALIDQUERY = 232,
  D3D10_MESSAGE_ID_CREATEQUERYORPREDICATE_INVALIDMISCFLAGS = 233,
  D3D10_MESSAGE_ID_CREATEQUERYORPREDICATE_UNEXPECTEDMISCFLAG = 234,
  D3D10_MESSAGE_ID_CREATEQUERYORPREDICATE_NULLDESC = 235,
  D3D10_MESSAGE_ID_DEVICE_IASETPRIMITIVETOPOLOGY_TOPOLOGY_UNRECOGNIZED = 236,
  D3D10_MESSAGE_ID_DEVICE_IASETPRIMITIVETOPOLOGY_TOPOLOGY_UNDEFINED = 237,
  D3D10_MESSAGE_ID_IASETVERTEXBUFFERS_INVALIDBUFFER = 238,
  D3D10_MESSAGE_ID_DEVICE_IASETVERTEXBUFFERS_OFFSET_TOO_LARGE = 239,
  D3D10_MESSAGE_ID_DEVICE_IASETVERTEXBUFFERS_BUFFERS_EMPTY = 240,
  D3D10_MESSAGE_ID_IASETINDEXBUFFER_INVALIDBUFFER = 241,
  D3D10_MESSAGE_ID_DEVICE_IASETINDEXBUFFER_FORMAT_INVALID = 242,
  D3D10_MESSAGE_ID_DEVICE_IASETINDEXBUFFER_OFFSET_TOO_LARGE = 243,
  D3D10_MESSAGE_ID_DEVICE_IASETINDEXBUFFER_OFFSET_UNALIGNED = 244,
  D3D10_MESSAGE_ID_DEVICE_VSSETSHADERRESOURCES_VIEWS_EMPTY = 245,
  D3D10_MESSAGE_ID_VSSETCONSTANTBUFFERS_INVALIDBUFFER = 246,
  D3D10_MESSAGE_ID_DEVICE_VSSETCONSTANTBUFFERS_BUFFERS_EMPTY = 247,
  D3D10_MESSAGE_ID_DEVICE_VSSETSAMPLERS_SAMPLERS_EMPTY = 248,
  D3D10_MESSAGE_ID_DEVICE_GSSETSHADERRESOURCES_VIEWS_EMPTY = 249,
  D3D10_MESSAGE_ID_GSSETCONSTANTBUFFERS_INVALIDBUFFER = 250,
  D3D10_MESSAGE_ID_DEVICE_GSSETCONSTANTBUFFERS_BUFFERS_EMPTY = 251,
  D3D10_MESSAGE_ID_DEVICE_GSSETSAMPLERS_SAMPLERS_EMPTY = 252,
  D3D10_MESSAGE_ID_SOSETTARGETS_INVALIDBUFFER = 253,
  D3D10_MESSAGE_ID_DEVICE_SOSETTARGETS_OFFSET_UNALIGNED = 254,
  D3D10_MESSAGE_ID_DEVICE_PSSETSHADERRESOURCES_VIEWS_EMPTY = 255,
  D3D10_MESSAGE_ID_PSSETCONSTANTBUFFERS_INVALIDBUFFER = 256,
  D3D10_MESSAGE_ID_DEVICE_PSSETCONSTANTBUFFERS_BUFFERS_EMPTY = 257,
  D3D10_MESSAGE_ID_DEVICE_PSSETSAMPLERS_SAMPLERS_EMPTY = 258,
  D3D10_MESSAGE_ID_DEVICE_RSSETVIEWPORTS_INVALIDVIEWPORT = 259,
  D3D10_MESSAGE_ID_DEVICE_RSSETSCISSORRECTS_INVALIDSCISSOR = 260,
  D3D10_MESSAGE_ID_CLEARRENDERTARGETVIEW_DENORMFLUSH = 261,
  D3D10_MESSAGE_ID_CLEARDEPTHSTENCILVIEW_DENORMFLUSH = 262,
  D3D10_MESSAGE_ID_CLEARDEPTHSTENCILVIEW_INVALID = 263,
  D3D10_MESSAGE_ID_DEVICE_IAGETVERTEXBUFFERS_BUFFERS_EMPTY = 264,
  D3D10_MESSAGE_ID_DEVICE_VSGETSHADERRESOURCES_VIEWS_EMPTY = 265,
  D3D10_MESSAGE_ID_DEVICE_VSGETCONSTANTBUFFERS_BUFFERS_EMPTY = 266,
  D3D10_MESSAGE_ID_DEVICE_VSGETSAMPLERS_SAMPLERS_EMPTY = 267,
  D3D10_MESSAGE_ID_DEVICE_GSGETSHADERRESOURCES_VIEWS_EMPTY = 268,
  D3D10_MESSAGE_ID_DEVICE_GSGETCONSTANTBUFFERS_BUFFERS_EMPTY = 269,
  D3D10_MESSAGE_ID_DEVICE_GSGETSAMPLERS_SAMPLERS_EMPTY = 270,
  D3D10_MESSAGE_ID_DEVICE_SOGETTARGETS_BUFFERS_EMPTY = 271,
  D3D10_MESSAGE_ID_DEVICE_PSGETSHADERRESOURCES_VIEWS_EMPTY = 272,
  D3D10_MESSAGE_ID_DEVICE_PSGETCONSTANTBUFFERS_BUFFERS_EMPTY = 273,
  D3D10_MESSAGE_ID_DEVICE_PSGETSAMPLERS_SAMPLERS_EMPTY = 274,
  D3D10_MESSAGE_ID_DEVICE_RSGETVIEWPORTS_VIEWPORTS_EMPTY = 275,
  D3D10_MESSAGE_ID_DEVICE_RSGETSCISSORRECTS_RECTS_EMPTY = 276,
  D3D10_MESSAGE_ID_DEVICE_GENERATEMIPS_RESOURCE_INVALID = 277,
  D3D10_MESSAGE_ID_COPYSUBRESOURCEREGION_INVALIDDESTINATIONSUBRESOURCE = 278,
  D3D10_MESSAGE_ID_COPYSUBRESOURCEREGION_INVALIDSOURCESUBRESOURCE = 279,
  D3D10_MESSAGE_ID_COPYSUBRESOURCEREGION_INVALIDSOURCEBOX = 280,
  D3D10_MESSAGE_ID_COPYSUBRESOURCEREGION_INVALIDSOURCE = 281,
  D3D10_MESSAGE_ID_COPYSUBRESOURCEREGION_INVALIDDESTINATIONSTATE = 282,
  D3D10_MESSAGE_ID_COPYSUBRESOURCEREGION_INVALIDSOURCESTATE = 283,
  D3D10_MESSAGE_ID_COPYRESOURCE_INVALIDSOURCE = 284,
  D3D10_MESSAGE_ID_COPYRESOURCE_INVALIDDESTINATIONSTATE = 285,
  D3D10_MESSAGE_ID_COPYRESOURCE_INVALIDSOURCESTATE = 286,
  D3D10_MESSAGE_ID_UPDATESUBRESOURCE_INVALIDDESTINATIONSUBRESOURCE = 287,
  D3D10_MESSAGE_ID_UPDATESUBRESOURCE_INVALIDDESTINATIONBOX = 288,
  D3D10_MESSAGE_ID_UPDATESUBRESOURCE_INVALIDDESTINATIONSTATE = 289,
  D3D10_MESSAGE_ID_DEVICE_RESOLVESUBRESOURCE_DESTINATION_INVALID = 290,
  D3D10_MESSAGE_ID_DEVICE_RESOLVESUBRESOURCE_DESTINATION_SUBRESOURCE_INVALID = 291,
  D3D10_MESSAGE_ID_DEVICE_RESOLVESUBRESOURCE_SOURCE_INVALID = 292,
  D3D10_MESSAGE_ID_DEVICE_RESOLVESUBRESOURCE_SOURCE_SUBRESOURCE_INVALID = 293,
  D3D10_MESSAGE_ID_DEVICE_RESOLVESUBRESOURCE_FORMAT_INVALID = 294,
  D3D10_MESSAGE_ID_BUFFER_MAP_INVALIDMAPTYPE = 295,
  D3D10_MESSAGE_ID_BUFFER_MAP_INVALIDFLAGS = 296,
  D3D10_MESSAGE_ID_BUFFER_MAP_ALREADYMAPPED = 297,
  D3D10_MESSAGE_ID_BUFFER_MAP_DEVICEREMOVED_RETURN = 298,
  D3D10_MESSAGE_ID_BUFFER_UNMAP_NOTMAPPED = 299,
  D3D10_MESSAGE_ID_TEXTURE1D_MAP_INVALIDMAPTYPE = 300,
  D3D10_MESSAGE_ID_TEXTURE1D_MAP_INVALIDSUBRESOURCE = 301,
  D3D10_MESSAGE_ID_TEXTURE1D_MAP_INVALIDFLAGS = 302,
  D3D10_MESSAGE_ID_TEXTURE1D_MAP_ALREADYMAPPED = 303,
  D3D10_MESSAGE_ID_TEXTURE1D_MAP_DEVICEREMOVED_RETURN = 304,
  D3D10_MESSAGE_ID_TEXTURE1D_UNMAP_INVALIDSUBRESOURCE = 305,
  D3D10_MESSAGE_ID_TEXTURE1D_UNMAP_NOTMAPPED = 306,
  D3D10_MESSAGE_ID_TEXTURE2D_MAP_INVALIDMAPTYPE = 307,
  D3D10_MESSAGE_ID_TEXTURE2D_MAP_INVALIDSUBRESOURCE = 308,
  D3D10_MESSAGE_ID_TEXTURE2D_MAP_INVALIDFLAGS = 309,
  D3D10_MESSAGE_ID_TEXTURE2D_MAP_ALREADYMAPPED = 310,
  D3D10_MESSAGE_ID_TEXTURE2D_MAP_DEVICEREMOVED_RETURN = 311,
  D3D10_MESSAGE_ID_TEXTURE2D_UNMAP_INVALIDSUBRESOURCE = 312,
  D3D10_MESSAGE_ID_TEXTURE2D_UNMAP_NOTMAPPED = 313,
  D3D10_MESSAGE_ID_TEXTURE3D_MAP_INVALIDMAPTYPE = 314,
  D3D10_MESSAGE_ID_TEXTURE3D_MAP_INVALIDSUBRESOURCE = 315,
  D3D10_MESSAGE_ID_TEXTURE3D_MAP_INVALIDFLAGS = 316,
  D3D10_MESSAGE_ID_TEXTURE3D_MAP_ALREADYMAPPED = 317,
  D3D10_MESSAGE_ID_TEXTURE3D_MAP_DEVICEREMOVED_RETURN = 318,
  D3D10_MESSAGE_ID_TEXTURE3D_UNMAP_INVALIDSUBRESOURCE = 319,
  D3D10_MESSAGE_ID_TEXTURE3D_UNMAP_NOTMAPPED = 320,
  D3D10_MESSAGE_ID_CHECKFORMATSUPPORT_FORMAT_DEPRECATED = 321,
  D3D10_MESSAGE_ID_CHECKMULTISAMPLEQUALITYLEVELS_FORMAT_DEPRECATED = 322,
  D3D10_MESSAGE_ID_SETEXCEPTIONMODE_UNRECOGNIZEDFLAGS = 323,
  D3D10_MESSAGE_ID_SETEXCEPTIONMODE_INVALIDARG_RETURN = 324,
  D3D10_MESSAGE_ID_SETEXCEPTIONMODE_DEVICEREMOVED_RETURN = 325,
  D3D10_MESSAGE_ID_REF_SIMULATING_INFINITELY_FAST_HARDWARE = 326,
  D3D10_MESSAGE_ID_REF_THREADING_MODE = 327,
  D3D10_MESSAGE_ID_REF_UMDRIVER_EXCEPTION = 328,
  D3D10_MESSAGE_ID_REF_KMDRIVER_EXCEPTION = 329,
  D3D10_MESSAGE_ID_REF_HARDWARE_EXCEPTION = 330,
  D3D10_MESSAGE_ID_REF_ACCESSING_INDEXABLE_TEMP_OUT_OF_RANGE = 331,
  D3D10_MESSAGE_ID_REF_PROBLEM_PARSING_SHADER = 332,
  D3D10_MESSAGE_ID_REF_OUT_OF_MEMORY = 333,
  D3D10_MESSAGE_ID_REF_INFO = 334,
  D3D10_MESSAGE_ID_DEVICE_DRAW_VERTEXPOS_OVERFLOW = 335,
  D3D10_MESSAGE_ID_DEVICE_DRAWINDEXED_INDEXPOS_OVERFLOW = 336,
  D3D10_MESSAGE_ID_DEVICE_DRAWINSTANCED_VERTEXPOS_OVERFLOW = 337,
  D3D10_MESSAGE_ID_DEVICE_DRAWINSTANCED_INSTANCEPOS_OVERFLOW = 338,
  D3D10_MESSAGE_ID_DEVICE_DRAWINDEXEDINSTANCED_INSTANCEPOS_OVERFLOW = 339,
  D3D10_MESSAGE_ID_DEVICE_DRAWINDEXEDINSTANCED_INDEXPOS_OVERFLOW = 340,
  D3D10_MESSAGE_ID_DEVICE_DRAW_VERTEX_SHADER_NOT_SET = 341,
  D3D10_MESSAGE_ID_DEVICE_SHADER_LINKAGE_SEMANTICNAME_NOT_FOUND = 342,
  D3D10_MESSAGE_ID_DEVICE_SHADER_LINKAGE_REGISTERINDEX = 343,
  D3D10_MESSAGE_ID_DEVICE_SHADER_LINKAGE_COMPONENTTYPE = 344,
  D3D10_MESSAGE_ID_DEVICE_SHADER_LINKAGE_REGISTERMASK = 345,
  D3D10_MESSAGE_ID_DEVICE_SHADER_LINKAGE_SYSTEMVALUE = 346,
  D3D10_MESSAGE_ID_DEVICE_SHADER_LINKAGE_NEVERWRITTEN_ALWAYSREADS = 347,
  D3D10_MESSAGE_ID_DEVICE_DRAW_VERTEX_BUFFER_NOT_SET = 348,
  D3D10_MESSAGE_ID_DEVICE_DRAW_INPUTLAYOUT_NOT_SET = 349,
  D3D10_MESSAGE_ID_DEVICE_DRAW_CONSTANT_BUFFER_NOT_SET = 350,
  D3D10_MESSAGE_ID_DEVICE_DRAW_CONSTANT_BUFFER_TOO_SMALL = 351,
  D3D10_MESSAGE_ID_DEVICE_DRAW_SAMPLER_NOT_SET = 352,
  D3D10_MESSAGE_ID_DEVICE_DRAW_SHADERRESOURCEVIEW_NOT_SET = 353,
  D3D10_MESSAGE_ID_DEVICE_DRAW_VIEW_DIMENSION_MISMATCH = 354,
  D3D10_MESSAGE_ID_DEVICE_DRAW_VERTEX_BUFFER_STRIDE_TOO_SMALL = 355,
  D3D10_MESSAGE_ID_DEVICE_DRAW_VERTEX_BUFFER_TOO_SMALL = 356,
  D3D10_MESSAGE_ID_DEVICE_DRAW_INDEX_BUFFER_NOT_SET = 357,
  D3D10_MESSAGE_ID_DEVICE_DRAW_INDEX_BUFFER_FORMAT_INVALID = 358,
  D3D10_MESSAGE_ID_DEVICE_DRAW_INDEX_BUFFER_TOO_SMALL = 359,
  D3D10_MESSAGE_ID_DEVICE_DRAW_GS_INPUT_PRIMITIVE_MISMATCH = 360,
  D3D10_MESSAGE_ID_DEVICE_DRAW_RESOURCE_RETURN_TYPE_MISMATCH = 361,
  D3D10_MESSAGE_ID_DEVICE_DRAW_POSITION_NOT_PRESENT = 362,
  D3D10_MESSAGE_ID_DEVICE_DRAW_OUTPUT_STREAM_NOT_SET = 363,
  D3D10_MESSAGE_ID_DEVICE_DRAW_BOUND_RESOURCE_MAPPED = 364,
  D3D10_MESSAGE_ID_DEVICE_DRAW_INVALID_PRIMITIVETOPOLOGY = 365,
  D3D10_MESSAGE_ID_DEVICE_DRAW_VERTEX_OFFSET_UNALIGNED = 366,
  D3D10_MESSAGE_ID_DEVICE_DRAW_VERTEX_STRIDE_UNALIGNED = 367,
  D3D10_MESSAGE_ID_DEVICE_DRAW_INDEX_OFFSET_UNALIGNED = 368,
  D3D10_MESSAGE_ID_DEVICE_DRAW_OUTPUT_STREAM_OFFSET_UNALIGNED = 369,
  D3D10_MESSAGE_ID_DEVICE_DRAW_RESOURCE_FORMAT_LD_UNSUPPORTED = 370,
  D3D10_MESSAGE_ID_DEVICE_DRAW_RESOURCE_FORMAT_SAMPLE_UNSUPPORTED = 371,
  D3D10_MESSAGE_ID_DEVICE_DRAW_RESOURCE_FORMAT_SAMPLE_C_UNSUPPORTED = 372,
  D3D10_MESSAGE_ID_DEVICE_DRAW_RESOURCE_MULTISAMPLE_UNSUPPORTED = 373,
  D3D10_MESSAGE_ID_DEVICE_DRAW_SO_TARGETS_BOUND_WITHOUT_SOURCE = 374,
  D3D10_MESSAGE_ID_DEVICE_DRAW_SO_STRIDE_LARGER_THAN_BUFFER = 375,
  D3D10_MESSAGE_ID_DEVICE_DRAW_OM_RENDER_TARGET_DOES_NOT_SUPPORT_BLENDING = 376,
  D3D10_MESSAGE_ID_DEVICE_DRAW_OM_DUAL_SOURCE_BLENDING_CAN_ONLY_HAVE_RENDER_TARGET_0 = 377,
  D3D10_MESSAGE_ID_DEVICE_REMOVAL_PROCESS_AT_FAULT = 378,
  D3D10_MESSAGE_ID_DEVICE_REMOVAL_PROCESS_POSSIBLY_AT_FAULT = 379,
  D3D10_MESSAGE_ID_DEVICE_REMOVAL_PROCESS_NOT_AT_FAULT = 380,
  D3D10_MESSAGE_ID_DEVICE_OPEN_SHARED_RESOURCE_INVALIDARG_RETURN = 381,
  D3D10_MESSAGE_ID_DEVICE_OPEN_SHARED_RESOURCE_OUTOFMEMORY_RETURN = 382,
  D3D10_MESSAGE_ID_DEVICE_OPEN_SHARED_RESOURCE_BADINTERFACE_RETURN = 383,
  D3D10_MESSAGE_ID_DEVICE_DRAW_VIEWPORT_NOT_SET = 384,
  D3D10_MESSAGE_ID_CREATEINPUTLAYOUT_TRAILING_DIGIT_IN_SEMANTIC = 385,
  D3D10_MESSAGE_ID_CREATEGEOMETRYSHADERWITHSTREAMOUTPUT_TRAILING_DIGIT_IN_SEMANTIC = 386,
  D3D10_MESSAGE_ID_DEVICE_RSSETVIEWPORTS_DENORMFLUSH = 387,
  D3D10_MESSAGE_ID_OMSETRENDERTARGETS_INVALIDVIEW = 388,
  D3D10_MESSAGE_ID_DEVICE_SETTEXTFILTERSIZE_INVALIDDIMENSIONS = 389,
  D3D10_MESSAGE_ID_DEVICE_DRAW_SAMPLER_MISMATCH = 390,
  D3D10_MESSAGE_ID_CREATEINPUTLAYOUT_TYPE_MISMATCH = 391,
  D3D10_MESSAGE_ID_BLENDSTATE_GETDESC_LEGACY = 392,
  D3D10_MESSAGE_ID_SHADERRESOURCEVIEW_GETDESC_LEGACY = 393,
  D3D10_MESSAGE_ID_CREATEQUERY_OUTOFMEMORY_RETURN = 394,
  D3D10_MESSAGE_ID_CREATEPREDICATE_OUTOFMEMORY_RETURN = 395,
  D3D10_MESSAGE_ID_CREATECOUNTER_OUTOFRANGE_COUNTER = 396,
  D3D10_MESSAGE_ID_CREATECOUNTER_SIMULTANEOUS_ACTIVE_COUNTERS_EXHAUSTED = 397,
  D3D10_MESSAGE_ID_CREATECOUNTER_UNSUPPORTED_WELLKNOWN_COUNTER = 398,
  D3D10_MESSAGE_ID_CREATECOUNTER_OUTOFMEMORY_RETURN = 399,
  D3D10_MESSAGE_ID_CREATECOUNTER_NONEXCLUSIVE_RETURN = 400,
  D3D10_MESSAGE_ID_CREATECOUNTER_NULLDESC = 401,
  D3D10_MESSAGE_ID_CHECKCOUNTER_OUTOFRANGE_COUNTER = 402,
  D3D10_MESSAGE_ID_CHECKCOUNTER_UNSUPPORTED_WELLKNOWN_COUNTER = 403,
  D3D10_MESSAGE_ID_SETPREDICATION_INVALID_PREDICATE_STATE = 404,
  D3D10_MESSAGE_ID_QUERY_BEGIN_UNSUPPORTED = 405,
  D3D10_MESSAGE_ID_PREDICATE_BEGIN_DURING_PREDICATION = 406,
  D3D10_MESSAGE_ID_QUERY_BEGIN_DUPLICATE = 407,
  D3D10_MESSAGE_ID_QUERY_BEGIN_ABANDONING_PREVIOUS_RESULTS = 408,
  D3D10_MESSAGE_ID_PREDICATE_END_DURING_PREDICATION = 409,
  D3D10_MESSAGE_ID_QUERY_END_ABANDONING_PREVIOUS_RESULTS = 410,
  D3D10_MESSAGE_ID_QUERY_END_WITHOUT_BEGIN = 411,
  D3D10_MESSAGE_ID_QUERY_GETDATA_INVALID_DATASIZE = 412,
  D3D10_MESSAGE_ID_QUERY_GETDATA_INVALID_FLAGS = 413,
  D3D10_MESSAGE_ID_QUERY_GETDATA_INVALID_CALL = 414,
  D3D10_MESSAGE_ID_DEVICE_DRAW_PS_OUTPUT_TYPE_MISMATCH = 415,
  D3D10_MESSAGE_ID_DEVICE_DRAW_RESOURCE_FORMAT_GATHER_UNSUPPORTED = 416,
  D3D10_MESSAGE_ID_DEVICE_DRAW_INVALID_USE_OF_CENTER_MULTISAMPLE_PATTERN = 417,
  D3D10_MESSAGE_ID_DEVICE_IASETVERTEXBUFFERS_STRIDE_TOO_LARGE = 418,
  D3D10_MESSAGE_ID_DEVICE_IASETVERTEXBUFFERS_INVALIDRANGE = 419,
  D3D10_MESSAGE_ID_CREATEINPUTLAYOUT_EMPTY_LAYOUT = 420,
  D3D10_MESSAGE_ID_DEVICE_DRAW_RESOURCE_SAMPLE_COUNT_MISMATCH = 421,
  D3D10_MESSAGE_ID_D3D10_MESSAGES_END = 422,
  D3D10_MESSAGE_ID_D3D10L9_MESSAGES_START = 0x100000,
  D3D10_MESSAGE_ID_CREATEDEPTHSTENCILSTATE_STENCIL_NO_TWO_SIDED = 0x100001,
  D3D10_MESSAGE_ID_CREATERASTERIZERSTATE_DepthBiasClamp_NOT_SUPPORTED = 0x100002,
  D3D10_MESSAGE_ID_CREATESAMPLERSTATE_NO_COMPARISON_SUPPORT = 0x100003,
  D3D10_MESSAGE_ID_CREATESAMPLERSTATE_EXCESSIVE_ANISOTROPY = 0x100004,
  D3D10_MESSAGE_ID_CREATESAMPLERSTATE_BORDER_OUT_OF_RANGE = 0x100005,
  D3D10_MESSAGE_ID_VSSETSAMPLERS_NOT_SUPPORTED = 0x100006,
  D3D10_MESSAGE_ID_VSSETSAMPLERS_TOO_MANY_SAMPLERS = 0x100007,
  D3D10_MESSAGE_ID_PSSETSAMPLERS_TOO_MANY_SAMPLERS = 0x100008,
  D3D10_MESSAGE_ID_CREATERESOURCE_NO_ARRAYS = 0x100009,
  D3D10_MESSAGE_ID_CREATERESOURCE_NO_VB_AND_IB_BIND = 0x10000a,
  D3D10_MESSAGE_ID_CREATERESOURCE_NO_TEXTURE_1D = 0x10000b,
  D3D10_MESSAGE_ID_CREATERESOURCE_DIMENSION_OUT_OF_RANGE = 0x10000c,
  D3D10_MESSAGE_ID_CREATERESOURCE_NOT_BINDABLE_AS_SHADER_RESOURCE = 0x10000d,
  D3D10_MESSAGE_ID_OMSETRENDERTARGETS_TOO_MANY_RENDER_TARGETS = 0x10000e,
  D3D10_MESSAGE_ID_OMSETRENDERTARGETS_NO_DIFFERING_BIT_DEPTHS = 0x10000f,
  D3D10_MESSAGE_ID_IASETVERTEXBUFFERS_BAD_BUFFER_INDEX = 0x100010,
  D3D10_MESSAGE_ID_DEVICE_RSSETVIEWPORTS_TOO_MANY_VIEWPORTS = 0x100011,
  D3D10_MESSAGE_ID_DEVICE_IASETPRIMITIVETOPOLOGY_ADJACENCY_UNSUPPORTED = 0x100012,
  D3D10_MESSAGE_ID_DEVICE_RSSETSCISSORRECTS_TOO_MANY_SCISSORS = 0x100013,
  D3D10_MESSAGE_ID_COPYRESOURCE_ONLY_TEXTURE_2D_WITHIN_GPU_MEMORY = 0x100014,
  D3D10_MESSAGE_ID_COPYRESOURCE_NO_TEXTURE_3D_READBACK = 0x100015,
  D3D10_MESSAGE_ID_COPYRESOURCE_NO_TEXTURE_ONLY_READBACK = 0x100016,
  D3D10_MESSAGE_ID_CREATEINPUTLAYOUT_UNSUPPORTED_FORMAT = 0x100017,
  D3D10_MESSAGE_ID_CREATEBLENDSTATE_NO_ALPHA_TO_COVERAGE = 0x100018,
  D3D10_MESSAGE_ID_CREATERASTERIZERSTATE_DepthClipEnable_MUST_BE_TRUE = 0x100019,
  D3D10_MESSAGE_ID_DRAWINDEXED_STARTINDEXLOCATION_MUST_BE_POSITIVE = 0x10001a,
  D3D10_MESSAGE_ID_CREATESHADERRESOURCEVIEW_MUST_USE_LOWEST_LOD = 0x10001b,
  D3D10_MESSAGE_ID_CREATESAMPLERSTATE_MINLOD_MUST_NOT_BE_FRACTIONAL = 0x10001c,
  D3D10_MESSAGE_ID_CREATESAMPLERSTATE_MAXLOD_MUST_BE_FLT_MAX = 0x10001d,
  D3D10_MESSAGE_ID_CREATESHADERRESOURCEVIEW_FIRSTARRAYSLICE_MUST_BE_ZERO = 0x10001e,
  D3D10_MESSAGE_ID_CREATESHADERRESOURCEVIEW_CUBES_MUST_HAVE_6_SIDES = 0x10001f,
  D3D10_MESSAGE_ID_CREATERESOURCE_NOT_BINDABLE_AS_RENDER_TARGET = 0x100020,
  D3D10_MESSAGE_ID_CREATERESOURCE_NO_DWORD_INDEX_BUFFER = 0x100021,
  D3D10_MESSAGE_ID_CREATERESOURCE_MSAA_PRECLUDES_SHADER_RESOURCE = 0x100022,
  D3D10_MESSAGE_ID_CREATERESOURCE_PRESENTATION_PRECLUDES_SHADER_RESOURCE = 0x100023,
  D3D10_MESSAGE_ID_CREATEBLENDSTATE_NO_INDEPENDENT_BLEND_ENABLE = 0x100024,
  D3D10_MESSAGE_ID_CREATEBLENDSTATE_NO_INDEPENDENT_WRITE_MASKS = 0x100025,
  D3D10_MESSAGE_ID_CREATERESOURCE_NO_STREAM_OUT = 0x100026,
  D3D10_MESSAGE_ID_CREATERESOURCE_ONLY_VB_IB_FOR_BUFFERS = 0x100027,
  D3D10_MESSAGE_ID_CREATERESOURCE_NO_AUTOGEN_FOR_VOLUMES = 0x100028,
  D3D10_MESSAGE_ID_CREATERESOURCE_DXGI_FORMAT_R8G8B8A8_CANNOT_BE_SHARED = 0x100029,
  D3D10_MESSAGE_ID_VSSHADERRESOURCES_NOT_SUPPORTED = 0x10002a,
  D3D10_MESSAGE_ID_GEOMETRY_SHADER_NOT_SUPPORTED = 0x10002b,
  D3D10_MESSAGE_ID_STREAM_OUT_NOT_SUPPORTED = 0x10002c,
  D3D10_MESSAGE_ID_TEXT_FILTER_NOT_SUPPORTED = 0x10002d,
  D3D10_MESSAGE_ID_CREATEBLENDSTATE_NO_SEPARATE_ALPHA_BLEND = 0x10002e,
  D3D10_MESSAGE_ID_CREATEBLENDSTATE_NO_MRT_BLEND = 0x10002f,
  D3D10_MESSAGE_ID_CREATEBLENDSTATE_OPERATION_NOT_SUPPORTED = 0x100030,
  D3D10_MESSAGE_ID_CREATESAMPLERSTATE_NO_MIRRORONCE = 0x100031,
  D3D10_MESSAGE_ID_DRAWINSTANCED_NOT_SUPPORTED = 0x100032,
  D3D10_MESSAGE_ID_DRAWINDEXEDINSTANCED_NOT_SUPPORTED_BELOW_9_3 = 0x100033,
  D3D10_MESSAGE_ID_DRAWINDEXED_POINTLIST_UNSUPPORTED = 0x100034,
  D3D10_MESSAGE_ID_SETBLENDSTATE_SAMPLE_MASK_CANNOT_BE_ZERO = 0x100035,
  D3D10_MESSAGE_ID_CREATERESOURCE_DIMENSION_EXCEEDS_FEATURE_LEVEL_DEFINITION = 0x100036,
  D3D10_MESSAGE_ID_CREATERESOURCE_ONLY_SINGLE_MIP_LEVEL_DEPTH_STENCIL_SUPPORTED = 0x100037,
  D3D10_MESSAGE_ID_DEVICE_RSSETSCISSORRECTS_NEGATIVESCISSOR = 0x100038,
  D3D10_MESSAGE_ID_SLOT_ZERO_MUST_BE_D3D10_INPUT_PER_VERTEX_DATA = 0x100039,
  D3D10_MESSAGE_ID_CREATERESOURCE_NON_POW_2_MIPMAP = 0x10003a,
  D3D10_MESSAGE_ID_CREATESAMPLERSTATE_BORDER_NOT_SUPPORTED = 0x10003b,
  D3D10_MESSAGE_ID_OMSETRENDERTARGETS_NO_SRGB_MRT = 0x10003c,
  D3D10_MESSAGE_ID_D3D10L9_MESSAGES_END = 0x10003d,
};

enum trType_t
{
  TR_STATIONARY = 0,
  TR_INTERPOLATE = 1,
  TR_INTERPOLATE_MOVER = 2,
  TR_LINEAR = 3,
  TR_LINEAR_STOP = 4,
  TR_SINE = 5,
  TR_GRAVITY = 6,
  TR_LOW_GRAVITY = 7,
  TR_ACCELERATE = 8,
  TR_DECELERATE = 9,
  TR_PHYSICS = 10,
  TR_XDOLL = 11,
  TR_FIRST_RAGDOLL = 12,
  TR_RAGDOLL = 12,
  TR_RAGDOLL_GRAVITY = 13,
  TR_RAGDOLL_INTERPOLATE = 14,
  TR_LAST_RAGDOLL = 14,
  TR_MOON_GRAVITY = 15,
  NUM_TRTYPES = 16,
};

enum expDataType
{
  VAL_INT = 0,
  VAL_FLOAT = 1,
  VAL_STRING = 2,
  VAL_ADDRESS = 3,
  VAL_DVAR = 4,
};

union operandInternalDataUnion
{
  union
  {
    /* 0x0000 */ int intVal;
    /* 0x0000 */ float floatVal;
    /* 0x0000 */ const char* string;
    /* 0x0000 */ const struct dvar_t* dvar;
  }; /* size: 0x0004 */
}; /* size: 0x0004 */

struct Operand
{
  /* 0x0000 */ enum expDataType dataType;
  /* 0x0004 */ union operandInternalDataUnion internals;
}; /* size: 0x0008 */

enum MaterialVertexDeclType
{
  VERTDECL_GENERIC = 0,
  VERTDECL_PACKED = 1,
  VERTDECL_PACKED_LMAP_VC = 2,
  VERTDECL_WORLD = 3,
  VERTDECL_PACKED_WORLD = 4,
  VERTDECL_PACKED_WORLD_T1N0 = 5,
  VERTDECL_PACKED_WORLD_T1N1 = 6,
  VERTDECL_PACKED_WORLD_T2N0 = 7,
  VERTDECL_PACKED_WORLD_T2N1 = 8,
  VERTDECL_PACKED_WORLD_T2N2 = 9,
  VERTDECL_PACKED_WORLD_T3N0 = 10,
  VERTDECL_PACKED_WORLD_T3N1 = 11,
  VERTDECL_PACKED_WORLD_T3N2 = 12,
  VERTDECL_PACKED_WORLD_T4N0 = 13,
  VERTDECL_PACKED_WORLD_T4N1 = 14,
  VERTDECL_PACKED_WORLD_T4N2 = 15,
  VERTDECL_POS_TEX = 16,
  VERTDECL_PARTICLECLOUD = 17,
  VERTDECL_POS_COLOR = 18,
  VERTDECL_POS_FP16TEX = 19,
  VERTDECL_COUNT = 20,
};

struct MenuCell
{
  /* 0x0000 */ int type;
  /* 0x0004 */ int maxChars;
  /* 0x0008 */ char* stringValue;
}; /* size: 0x000c */

enum tagShutdownType
{
  IdleShutdown = 0,
  ForcedShutdown = 1,
};

enum rieType
{
  RIE_NONE = 0,
  RIE_NEARBYDEATH = 1,
  RIE_NEARBYEXPOSION = 2,
  RIE_NEARBYFRIENDLY = 3,
  RIE_NUMTYPES = 4,
};

enum scriptAnimMoveTypes_t
{
  ANIM_MT_UNUSED = 0,
  ANIM_MT_IDLE = 1,
  ANIM_MT_SHUFFLE = 2,
  ANIM_MT_WALK = 3,
  ANIM_MT_RUN = 4,
  ANIM_MT_CLIMBUP = 5,
  ANIM_MT_CLIMBDOWN = 6,
  ANIM_MT_SPRINT = 7,
  ANIM_MT_MANTLE_ROOT = 8,
  ANIM_MT_MANTLE_UP_57 = 9,
  ANIM_MT_MANTLE_UP_51 = 10,
  ANIM_MT_MANTLE_UP_45 = 11,
  ANIM_MT_MANTLE_UP_39 = 12,
  ANIM_MT_MANTLE_UP_33 = 13,
  ANIM_MT_MANTLE_UP_27 = 14,
  ANIM_MT_MANTLE_UP_21 = 15,
  ANIM_MT_MANTLE_OVER_HIGH = 16,
  ANIM_MT_MANTLE_OVER_MID = 17,
  ANIM_MT_MANTLE_OVER_LOW = 18,
  ANIM_MT_TURNRIGHT = 19,
  ANIM_MT_TURNLEFT = 20,
  ANIM_MT_STUMBLE = 21,
  ANIM_MT_STUMBLE_WALK = 22,
  ANIM_MT_STUMBLE_SPRINT = 23,
  ANIM_MT_SWIM = 24,
  ANIM_MT_DTP = 25,
  ANIM_MT_SLIDE = 26,
  NUM_ANIM_MOVETYPES = 27,
};

typedef enum _TAG_UNNAMED_25
{
  lkNormal = 0,
  lkPrealloc = 1,
  lkDeleted = 2,
} TAG_UNNAMED_25, *PTAG_UNNAMED_25;

typedef enum _TAG_UNNAMED_26
{
  PICMIP_PLATFORM_USED = 0,
  PICMIP_PLATFORM_MINSPEC = 1,
  PICMIP_PLATFORM_COUNT = 2,
} TAG_UNNAMED_26, *PTAG_UNNAMED_26;

enum TractionType
{
  TRACTION_TYPE_FRONT = 0,
  TRACTION_TYPE_BACK = 1,
  TRACTION_TYPE_ALL_WD = 2,
  NUM_TRACTION_TYPES = 3,
};

typedef enum _HEAP_INFORMATION_CLASS
{
  HeapCompatibilityInformation = 0,
  HeapEnableTerminationOnCorruption = 1,
} HEAP_INFORMATION_CLASS, *PHEAP_INFORMATION_CLASS;

enum perksEnum
{
  PERK_ADDITIONALPRIMARYWEAPON = 0,
  PERK_ARMORPIERCING = 1,
  PERK_ARMORVEST = 2,
  PERK_ACCURACY = 3,
  PERK_BULLETDMG = 4,
  PERK_REDUCEBULLETFLINCH = 5,
  PERK_EXTRABP = 6,
  PERK_DEADSHOT = 7,
  PERK_DELAYEXPLOSIVE = 8,
  PERK_DETECTEXPLOSIVE = 9,
  PERK_DISARMEXPLOSIVE = 10,
  PERK_EARNMOREMOMENTUM = 11,
  PERK_EXPLOSIVEDMG = 12,
  PERK_EXTRAAMMO = 13,
  PERK_FALLHEIGHT = 14,
  PERK_FASTADS = 15,
  PERK_FASTEQUIPMENTUSE = 16,
  PERK_FASTLADDERCLIMB = 17,
  PERK_FASTMANTLE = 18,
  PERK_FASTMELEE = 19,
  PERK_FASTRELOAD = 20,
  PERK_FASTTOSS = 21,
  PERK_FASTSWITCH = 22,
  PERK_FINALSTAND = 23,
  PERK_FIREPROOF = 24,
  PERK_FLAKJACKET = 25,
  PERK_FLASHPROTECTION = 26,
  PERK_JAMRADAR = 27,
  PERK_GRENADEDEATH = 28,
  PERK_HEALTHREGEN = 29,
  PERK_EXTRABREATH = 30,
  PERK_IMMUNECOUNTERUAV = 31,
  PERK_IMMUNEEMP = 32,
  PERK_IMMUNEMMS = 33,
  PERK_IMMUNENVTHERMAL = 34,
  PERK_IMMUNERANGEFINDER = 35,
  PERK_KILLSTREAK = 36,
  PERK_LONGERSPRINT = 37,
  PERK_LOUDENEMIES = 38,
  PERK_MARKSMAN = 39,
  PERK_MOVEFASTER = 40,
  PERK_NOMOTIONSENSOR = 41,
  PERK_NONAME = 42,
  PERK_NOTTARGETEDBYAIRSUPPORT = 43,
  PERK_NOKILLSTREAKRETICLE = 44,
  PERK_NOTTARGETEDBYSENTRY = 45,
  PERK_TOSSBACK = 46,
  PERK_PISTOLDEATH = 47,
  PERK_PROXIMITYPROTECTION = 48,
  PERK_QUICKREVIVE = 49,
  PERK_QUIETMOVE = 50,
  PERK_RECON = 51,
  PERK_RATEOFFIRE = 52,
  PERK_SCAVENGER = 53,
  PERK_SHOWENEMYEQUIPMENT = 54,
  PERK_STUNPROTECTION = 55,
  PERK_REDUCESHELLSHOCK = 56,
  PERK_SPRINTRECOVERY = 57,
  PERK_SHOWONRADAR = 58,
  PERK_STALKER = 59,
  PERK_TWOGRENADES = 60,
  PERK_TWOPRIMARIES = 61,
  PERK_UNLIMITEDSPRINT = 62,
  PERK_COUNT = 63,
  PERK_UNKNOWN = 63,
};

enum DXGI_MODE_ROTATION
{
  DXGI_MODE_ROTATION_UNSPECIFIED = 0,
  DXGI_MODE_ROTATION_IDENTITY = 1,
  DXGI_MODE_ROTATION_ROTATE90 = 2,
  DXGI_MODE_ROTATION_ROTATE180 = 3,
  DXGI_MODE_ROTATION_ROTATE270 = 4,
};

typedef enum _TAG_UNNAMED_27
{
  STACK_MAX_SIZE = 2,
} TAG_UNNAMED_27, *PTAG_UNNAMED_27;

enum D3D_SRV_DIMENSION
{
  D3D_SRV_DIMENSION_UNKNOWN = 0,
  D3D_SRV_DIMENSION_BUFFER = 1,
  D3D_SRV_DIMENSION_TEXTURE1D = 2,
  D3D_SRV_DIMENSION_TEXTURE1DARRAY = 3,
  D3D_SRV_DIMENSION_TEXTURE2D = 4,
  D3D_SRV_DIMENSION_TEXTURE2DARRAY = 5,
  D3D_SRV_DIMENSION_TEXTURE2DMS = 6,
  D3D_SRV_DIMENSION_TEXTURE2DMSARRAY = 7,
  D3D_SRV_DIMENSION_TEXTURE3D = 8,
  D3D_SRV_DIMENSION_TEXTURECUBE = 9,
  D3D_SRV_DIMENSION_TEXTURECUBEARRAY = 10,
  D3D_SRV_DIMENSION_BUFFEREX = 11,
  D3D10_SRV_DIMENSION_UNKNOWN = 0,
  D3D10_SRV_DIMENSION_BUFFER = 1,
  D3D10_SRV_DIMENSION_TEXTURE1D = 2,
  D3D10_SRV_DIMENSION_TEXTURE1DARRAY = 3,
  D3D10_SRV_DIMENSION_TEXTURE2D = 4,
  D3D10_SRV_DIMENSION_TEXTURE2DARRAY = 5,
  D3D10_SRV_DIMENSION_TEXTURE2DMS = 6,
  D3D10_SRV_DIMENSION_TEXTURE2DMSARRAY = 7,
  D3D10_SRV_DIMENSION_TEXTURE3D = 8,
  D3D10_SRV_DIMENSION_TEXTURECUBE = 9,
  D3D10_1_SRV_DIMENSION_UNKNOWN = 0,
  D3D10_1_SRV_DIMENSION_BUFFER = 1,
  D3D10_1_SRV_DIMENSION_TEXTURE1D = 2,
  D3D10_1_SRV_DIMENSION_TEXTURE1DARRAY = 3,
  D3D10_1_SRV_DIMENSION_TEXTURE2D = 4,
  D3D10_1_SRV_DIMENSION_TEXTURE2DARRAY = 5,
  D3D10_1_SRV_DIMENSION_TEXTURE2DMS = 6,
  D3D10_1_SRV_DIMENSION_TEXTURE2DMSARRAY = 7,
  D3D10_1_SRV_DIMENSION_TEXTURE3D = 8,
  D3D10_1_SRV_DIMENSION_TEXTURECUBE = 9,
  D3D10_1_SRV_DIMENSION_TEXTURECUBEARRAY = 10,
  D3D11_SRV_DIMENSION_UNKNOWN = 0,
  D3D11_SRV_DIMENSION_BUFFER = 1,
  D3D11_SRV_DIMENSION_TEXTURE1D = 2,
  D3D11_SRV_DIMENSION_TEXTURE1DARRAY = 3,
  D3D11_SRV_DIMENSION_TEXTURE2D = 4,
  D3D11_SRV_DIMENSION_TEXTURE2DARRAY = 5,
  D3D11_SRV_DIMENSION_TEXTURE2DMS = 6,
  D3D11_SRV_DIMENSION_TEXTURE2DMSARRAY = 7,
  D3D11_SRV_DIMENSION_TEXTURE3D = 8,
  D3D11_SRV_DIMENSION_TEXTURECUBE = 9,
  D3D11_SRV_DIMENSION_TEXTURECUBEARRAY = 10,
  D3D11_SRV_DIMENSION_BUFFEREX = 11,
};

class phys_link_list<pulse_sum_node>
{
  /* 0x0000 */ class pulse_sum_node* m_first;
  /* 0x0004 */ class pulse_sum_node** m_last_next_ptr;
  /* 0x0008 */ int m_alloc_count;
}; /* size: 0x000c */

typedef enum _TAG_UNNAMED_28
{
  PTR_LIST_SIZE = 256,
} TAG_UNNAMED_28, *PTAG_UNNAMED_28;

enum team_t
{
  TEAM_FREE = 0,
  TEAM_BAD = 0,
  TEAM_ALLIES = 1,
  TEAM_AXIS = 2,
  TEAM_THREE = 3,
  TEAM_FOUR = 4,
  TEAM_FIVE = 5,
  TEAM_SIX = 6,
  TEAM_SEVEN = 7,
  TEAM_EIGHT = 8,
  TEAM_NUM_PLAYING_TEAMS = 9,
  TEAM_SPECTATOR = 9,
  TEAM_NUM_TEAMS = 10,
  TEAM_LOCALPLAYERS = 11,
  TEAM_FIRST_PLAYING_TEAM = 1,
  TEAM_LAST_PLAYING_TEAM = 8,
};

enum GfxBlendOp
{
  GFXS_BLENDOP_DISABLED = 0,
  GFXS_BLENDOP_ADD = 1,
  GFXS_BLENDOP_SUBTRACT = 2,
  GFXS_BLENDOP_REVSUBTRACT = 3,
  GFXS_BLENDOP_MIN = 4,
  GFXS_BLENDOP_MAX = 5,
  GFXS_BLENDOP_MASK = 7,
};

enum PlaylistLockState
{
  PLS_UNLOCKED = 0,
  PLS_FETCHING = 1,
  PLS_XP = 2,
  PLS_PLEVEL = 3,
  PLS_MAXPARTY = 4,
  PLS_MINPARTY = 5,
  PLS_GAMETYPEBAN = 6,
  PLS_FINISHEDSOLO = 7,
  PLS_REQUIRED_DLC_DISABLED = 8,
  PLS_REQUIRED_DLC_NOT_AVAILABLE = 9,
  PLS_CODPOINTS = 10,
  PLS_VISPROFILEVAR = 11,
  PLS_LOCALPLAYERS = 12,
  PLS_NOGUESTS = 13,
  PLS_COUNT = 14,
};

typedef enum _TAG_UNNAMED_29
{
  DAMAGE_RANGE_1 = 0,
  DAMAGE_RANGE_2 = 1,
  DAMAGE_RANGE_3 = 2,
  DAMAGE_RANGE_4 = 3,
  DAMAGE_RANGE_5 = 4,
  DAMAGE_RANGE_6 = 5,
  DAMAGE_RANGE_COUNT = 6,
  DAMAGE_RANGE_MAX = 0,
  DAMAGE_RANGE_MIN = 5,
} TAG_UNNAMED_29, *PTAG_UNNAMED_29;

struct ID3D11Texture1D
{
}; /* size: 0x0004 */

enum jqProcessor
{
  JQ_CORE_0 = 1,
  JQ_CORE_1 = 2,
  JQ_CORE_2 = 4,
  JQ_CORE_3 = 8,
  JQ_CORE_4 = 16,
  JQ_CORE_5 = 32,
  JQ_CORE_6 = 64,
  JQ_CORE_7 = 128,
  JQ_CORE_ALL = 255,
};

typedef enum _TAG_UNNAMED_30
{
  R_RENDERTARGET_NULL = 0,
  R_RENDERTARGET_SAVED_SCREEN = 1,
  R_RENDERTARGET_FRAME_BUFFER = 2,
  R_RENDERTARGET_FRAME_BUFFER_COMPOSITE = 3,
  R_RENDERTARGET_SCENE = 4,
  R_RENDERTARGET_SCENE_NULLCOLOR = 5,
  R_RENDERTARGET_RESOLVED_POST_SUN = 6,
  R_RENDERTARGET_RESOLVED_SCENE = 7,
  R_RENDERTARGET_FLOAT_Z = 8,
  R_RENDERTARGET_PINGPONG_0 = 9,
  R_RENDERTARGET_PINGPONG_1 = 10,
  R_RENDERTARGET_POST_EFFECT_SRC = 11,
  R_RENDERTARGET_POST_EFFECT_GODRAYS = 12,
  R_RENDERTARGET_POST_EFFECT_0 = 13,
  R_RENDERTARGET_POST_EFFECT_1 = 14,
  R_RENDERTARGET_SHADOWMAP_SUN = 15,
  R_RENDERTARGET_SHADOWMAP_SPOT = 16,
  R_RENDERTARGET_UI3D = 17,
  R_RENDERTARGET_UI3D_PING_PONG = 18,
  R_RENDERTARGET_MISSILE_CAM = 19,
  R_RENDERTARGET_FLOAT_Z_MISSILE_CAM = 20,
  R_RENDERTARGET_MISSILE_CAM_MULTI_0 = 21,
  R_RENDERTARGET_MISSILE_CAM_MULTI_1 = 22,
  R_RENDERTARGET_MISSILE_CAM_MULTI_2 = 23,
  R_RENDERTARGET_MISSILE_CAM_MULTI_3 = 24,
  R_RENDERTARGET_COMPOSITE = 25,
  R_RENDERTARGET_DOF_SCENE_MASK_PING = 26,
  R_RENDERTARGET_DOF_SCENE_MASK_PONG = 27,
  R_RENDERTARGET_DOF_SCENE_FP16 = 28,
  R_RENDERTARGET_DOF_SCENE_FP16_0 = 29,
  R_RENDERTARGET_DOF_SCENE_FP16_1 = 30,
  R_RENDERTARGET_DOF_SCENE_FP16_2 = 31,
  R_RENDERTARGET_DOF_SCENE_FP16_3 = 32,
  R_RENDERTARGET_DOF_SCENE_FP16_4 = 33,
  R_RENDERTARGET_DOF_SCENE_FP16_5 = 34,
  R_RENDERTARGET_DOF_SCENE_FINAL = 35,
  R_RENDERTARGET_BLOOM_MIP1_PING = 36,
  R_RENDERTARGET_BLOOM_MIP1_PONG = 37,
  R_RENDERTARGET_BLOOM_MIP2_PING = 38,
  R_RENDERTARGET_BLOOM_MIP2_PONG = 39,
  R_RENDERTARGET_BLOOM_MIP3_PING = 40,
  R_RENDERTARGET_BLOOM_MIP3_PONG = 41,
  R_RENDERTARGET_BLOOM_MIP4_PING = 42,
  R_RENDERTARGET_BLOOM_MIP4_PONG = 43,
  R_RENDERTARGET_BLOOM_STREAK = 44,
  R_RENDERTARGET_LUT2D = 45,
  R_RENDERTARGET_SSAO_CSZ = 46,
  R_RENDERTARGET_SSAO_CSZ_0 = 47,
  R_RENDERTARGET_SSAO_CSZ_1 = 48,
  R_RENDERTARGET_SSAO_CSZ_2 = 49,
  R_RENDERTARGET_SSAO_CSZ_3 = 50,
  R_RENDERTARGET_SSAO_CSZ_4 = 51,
  R_RENDERTARGET_SSAO_CSZ_5 = 52,
  R_RENDERTARGET_SSAO_1 = 53,
  R_RENDERTARGET_SSAO_2 = 54,
  R_RENDERTARGET_TXAA_FEEDBACK = 55,
  R_RENDERTARGET_TXAA_SRGB = 56,
  R_RENDERTARGET_SONAR = 57,
  R_RENDERTARGET_SONAR_BLUR = 58,
  R_RENDERTARGET_SHADOWMAP_SUN_HI_FULL = 59,
  R_RENDERTARGET_SHADOWMAP_SUN_HI_PARTITION_0 = 60,
  R_RENDERTARGET_SHADOWMAP_SUN_HI_PARTITION_1 = 61,
  R_RENDERTARGET_SHADOWMAP_SUN_LO_FULL = 62,
  R_RENDERTARGET_SHADOWMAP_SUN_LO_PARTITION_0 = 63,
  R_RENDERTARGET_SHADOWMAP_SUN_LO_PARTITION_1 = 64,
  R_RENDERTARGET_SHADOWMAP_SPOT_FULL = 65,
  R_RENDERTARGET_SHADOWMAP_SPOT_0 = 66,
  R_RENDERTARGET_SHADOWMAP_SPOT_1 = 67,
  R_RENDERTARGET_SHADOWMAP_SPOT_2 = 68,
  R_RENDERTARGET_SHADOWMAP_SPOT_3 = 69,
  R_RENDERTARGET_SHADOWMAP_SPOT_HI_0 = 70,
  R_RENDERTARGET_SHADOWMAP_SPOT_HI_1 = 71,
  R_RENDERTARGET_COUNT = 72,
  R_RENDERTARGET_NONE = 0,
} TAG_UNNAMED_30, *PTAG_UNNAMED_30;

struct D3D11_TEX2DMS_RTV
{
  /* 0x0000 */ unsigned int UnusedField_NothingToDefine;
}; /* size: 0x0004 */

enum scriptAnimEventTypes_t
{
  ANIM_ET_UNUSED = 0,
  ANIM_ET_DEATH = 1,
  ANIM_ET_FIREWEAPON = 2,
  ANIM_ET_JUMP = 3,
  ANIM_ET_LAND = 4,
  ANIM_ET_DROPWEAPON = 5,
  ANIM_ET_RAISEWEAPON = 6,
  ANIM_ET_FIRSTRAISEWEAPON = 7,
  ANIM_ET_RELOAD = 8,
  ANIM_ET_CROUCH_TO_PRONE = 9,
  ANIM_ET_PRONE_TO_CROUCH = 10,
  ANIM_ET_STAND_TO_CROUCH = 11,
  ANIM_ET_CROUCH_TO_STAND = 12,
  ANIM_ET_PRONE_TO_STAND = 13,
  ANIM_ET_PRONE_TO_SPRINT = 14,
  ANIM_ET_RUN_TO_IDLE = 15,
  ANIM_ET_MELEEATTACK = 16,
  ANIM_ET_MELEELEFT = 17,
  ANIM_ET_KNIFE_MELEE = 18,
  ANIM_ET_KNIFE_MELEE_CHARGE = 19,
  ANIM_ET_FLINCH = 20,
  ANIM_ET_SHELLSHOCK = 21,
  ANIM_ET_VEHICLE_ENTER = 22,
  ANIM_ET_VEHICLE_CHANGE_SEATS = 23,
  ANIM_ET_VEHICLE_EXIT = 24,
  ANIM_ET_SCRIPTEVENT = 25,
  ANIM_ET_DTP_TAKEOFF = 26,
  ANIM_ET_DTP_LAND = 27,
  ANIM_ET_STAND_TO_LASTSTAND = 28,
  ANIM_ET_CROUCH_TO_LASTSTAND = 29,
  ANIM_ET_PRONE_TO_LASTSTAND = 30,
  ANIM_ET_LASTSTAND_TO_STAND = 31,
  ANIM_ET_LASTSTAND_TO_CROUCH = 32,
  ANIM_ET_LASTSTAND_TO_PRONE = 33,
  ANIM_ET_FLARED = 34,
  ANIM_ET_LASTSTAND_SUICIDE = 35,
  ANIM_ET_PRIME_GRENADE = 36,
  NUM_ANIM_EVENTTYPES = 37,
};

enum NV_DP_LANE_COUNT
{
  NV_DP_1_LANE = 1,
  NV_DP_2_LANE = 2,
  NV_DP_4_LANE = 4,
};

typedef enum _TAG_UNNAMED_31
{
  DRT_ALL = 0,
  DRT_PLAYER = 1,
  DRT_PLAYERCLIP = 2,
  DRT_VEHICLE = 3,
  DRT_HELICOPTER = 4,
  DRT_AI_COLLISION = 5,
  DRT_AI_SIGHT = 6,
  DRT_WEAPON = 7,
  DRT_MANTLE = 8,
  DRT_PHYSICS = 9,
  DRT_AIM_ASSIST = 10,
  DRT_SPAWN_VISIBILITY = 11,
  DRT_TRIGGER = 12,
  DRT_CLIENTSIDE_TRIGGER = 13,
  MAX_DRT = 14,
} TAG_UNNAMED_31, *PTAG_UNNAMED_31;

enum jqWorkerType
{
  JQ_WORKER_GENERIC = 0,
  JQ_WORKER_MAX = 1,
  JQ_WORKER_DEFAULT = 0,
};

enum DNameStatus
{
  DN_valid = 0,
  DN_truncated = 1,
  DN_invalid = 2,
  DN_error = 3,
};

struct LerpEntityStateDestructibleHit
{
  /* 0x0000 */ unsigned int modelState[3];
}; /* size: 0x000c */

struct DestructibleState
{
  /* 0x0000 */ struct LerpEntityStateDestructibleHit state;
  /* 0x000c */ int time;
}; /* size: 0x0010 */

enum GfxTextureFunc
{
  GFXS_TEXFUNC_OP_SHIFT = 0,
  GFXS_TEXFUNC_DEST_SHIFT = 5,
  GFXS_TEXFUNC_ARG1_SHIFT = 10,
  GFXS_TEXFUNC_ARG2_SHIFT = 15,
  GFXS_TEXFUNC_ARG0_SHIFT = 20,
};

typedef enum _TAG_UNNAMED_32
{
  AIDEMOLOCKONVIEW_STANDING = 0,
  AIDEMOLOCKONVIEW_MISSING_LEGS = 1,
  AIDEMOLOCKONVIEW_COUNT = 2,
} TAG_UNNAMED_32, *PTAG_UNNAMED_32;

typedef enum _NVVIOOUTPUTAREA
{
  NVVIOOUTPUTAREA_FULLSIZE = 0,
  NVVIOOUTPUTAREA_SAFEACTION = 1,
  NVVIOOUTPUTAREA_SAFETITLE = 2,
} NVVIOOUTPUTAREA, *PNVVIOOUTPUTAREA;

enum state_t
{
  S_INIT = 0,
  S_EAT0L = 1,
  S_SIGNM = 2,
  S_GETL = 3,
  S_GETR = 4,
  S_POINT = 5,
  S_E = 6,
  S_SIGNE = 7,
  S_EAT0E = 8,
  S_GETE = 9,
  S_END = 10,
  S_E_IMPLICIT = 11,
};

struct sv_FxVisBlock_t
{
  /* 0x0000 */ const struct gentity_t* fxEnt;
  /* 0x0004 */ float radius;
}; /* size: 0x0008 */

struct fxLightingState_t
{
  /* 0x0000 */ float primaryLightFraction;
  /* 0x0004 */ int lightingOriginOffset;
}; /* size: 0x0008 */

typedef enum _TAG_UNNAMED_33
{
  STATMON_FPS = 0,
  STATMON_FILEACCESS = 1,
  STATMON_SOUNDCPU = 2,
  STATMON_MAXEFFECTS = 3,
  STATMON_SNAPSHOTENTS = 4,
  STATMON_TRIS = 5,
  STATMON_SERVERFPS = 6,
  STATMON_NET = 7,
  STATMON_DENSECOLLISION = 8,
  STATMON_IK = 9,
  STATMON_SCRIPTERROR = 10,
  STATMON_BANDWIDTHEXCEEDED = 11,
  STATMON_GAMESTATEEXCEEDED = 12,
  STATMON_BANDWIDTHLIMITED = 13,
  STATMON_COUNT = 14,
} TAG_UNNAMED_33, *PTAG_UNNAMED_33;

enum DemoType
{
  DEMO_TYPE_NONE = 0,
  DEMO_TYPE_CLIENT = 1,
  DEMO_TYPE_SERVER = 2,
  DEMO_TYPE_SERVER_SNAPSHOT = 3,
};

enum scoreBoardColumns_e
{
  SCOREBOARD_COLUMN_NEMESIS_BG = 0,
  SCOREBOARD_COLUMN_RANK_BG = 1,
  SCOREBOARD_COLUMN_RANK = 2,
  SCOREBOARD_COLUMN_RANK_ICON = 3,
  SCOREBOARD_COLUMN_NAME = 4,
  SCOREBOARD_COLUMN_1 = 5,
  SCOREBOARD_COLUMN_2 = 6,
  SCOREBOARD_COLUMN_3 = 7,
  SCOREBOARD_COLUMN_4 = 8,
  SCOREBOARD_COLUMN_5 = 9,
};

typedef struct _XMDECN4
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ int x : 10; /* bit position: 0 */
      /* 0x0000 */ int y : 10; /* bit position: 10 */
      /* 0x0000 */ int z : 10; /* bit position: 20 */
      /* 0x0000 */ int w : 2; /* bit position: 30 */
    }; /* bitfield */
    /* 0x0000 */ unsigned int v;
  }; /* size: 0x0004 */
} XMDECN4, *PXMDECN4; /* size: 0x0004 */

enum keyNum_t
{
  K_NONE = 0,
  K_FIRSTGAMEPADBUTTON_RANGE_1 = 1,
  K_BUTTON_A = 1,
  K_BUTTON_B = 2,
  K_BUTTON_X = 3,
  K_BUTTON_Y = 4,
  K_BUTTON_LSHLDR = 5,
  K_BUTTON_RSHLDR = 6,
  K_LASTGAMEPADBUTTON_RANGE_1 = 6,
  K_BS = 8,
  K_TAB = 9,
  K_NL = 10,
  K_ENTER = 13,
  K_FIRSTGAMEPADBUTTON_RANGE_2 = 14,
  K_BUTTON_START = 14,
  K_BUTTON_BACK = 15,
  K_BUTTON_LSTICK = 16,
  K_BUTTON_RSTICK = 17,
  K_BUTTON_LTRIG = 18,
  K_BUTTON_RTRIG = 19,
  K_DPAD_UP = 20,
  K_FIRSTDPAD = 20,
  K_DPAD_DOWN = 21,
  K_DPAD_LEFT = 22,
  K_DPAD_RIGHT = 23,
  K_BUTTON_RTRIG_PUSH = 24,
  K_BUTTON_LTRIG_PUSH = 25,
  K_BUTTON_LSTICK_ALTIMAGE2 = 16,
  K_BUTTON_RSTICK_ALTIMAGE2 = 17,
  K_BUTTON_LSTICK_ALTIMAGE = 188,
  K_NUNCHUK_RIGHT = 188,
  K_BUTTON_RSTICK_ALTIMAGE = 189,
  K_WIIUMOTE_RIGHT = 189,
  K_LASTDPAD = 23,
  K_DPAD_LEFTRIGHT = 24,
  K_DPAD_UPDOWN = 25,
  K_LASTGAMEPADBUTTON_RANGE_2 = 25,
  K_CODPOINTS = 26,
  K_ESCAPE = 27,
  K_FIRSTGAMEPADBUTTON_RANGE_3 = 28,
  K_APAD_UP = 28,
  K_FIRSTAPAD = 28,
  K_APAD_DOWN = 29,
  K_APAD_LEFT = 30,
  K_APAD_RIGHT = 31,
  K_LASTAPAD = 31,
  K_LASTGAMEPADBUTTON_RANGE_3 = 31,
  K_SPACE = 32,
  K_BACKSPACE = 127,
  K_ASCII_FIRST = 128,
  K_ASCII_181 = 128,
  K_ASCII_191 = 129,
  K_ASCII_223 = 130,
  K_ASCII_224 = 131,
  K_ASCII_225 = 132,
  K_ASCII_228 = 133,
  K_ASCII_229 = 134,
  K_ASCII_230 = 135,
  K_ASCII_231 = 136,
  K_ASCII_232 = 137,
  K_ASCII_233 = 138,
  K_ASCII_236 = 139,
  K_ASCII_241 = 140,
  K_ASCII_242 = 141,
  K_ASCII_243 = 142,
  K_ASCII_246 = 143,
  K_ASCII_248 = 144,
  K_ASCII_249 = 145,
  K_ASCII_250 = 146,
  K_ASCII_252 = 147,
  K_END_ASCII_CHARS = 148,
  K_COMMAND = 150,
  K_CAPSLOCK = 151,
  K_POWER = 152,
  K_PAUSE = 153,
  K_UPARROW = 154,
  K_DOWNARROW = 155,
  K_LEFTARROW = 156,
  K_RIGHTARROW = 157,
  K_ALT = 158,
  K_CTRL = 159,
  K_SHIFT = 160,
  K_INS = 161,
  K_DEL = 162,
  K_PGDN = 163,
  K_PGUP = 164,
  K_HOME = 165,
  K_END = 166,
  K_F1 = 167,
  K_F2 = 168,
  K_F3 = 169,
  K_F4 = 170,
  K_F5 = 171,
  K_F6 = 172,
  K_F7 = 173,
  K_F8 = 174,
  K_F9 = 175,
  K_F10 = 176,
  K_F11 = 177,
  K_F12 = 178,
  K_F13 = 179,
  K_F14 = 180,
  K_F15 = 181,
  K_KP_HOME = 182,
  K_KP_UPARROW = 183,
  K_KP_PGUP = 184,
  K_KP_LEFTARROW = 185,
  K_KP_5 = 186,
  K_KP_RIGHTARROW = 187,
  K_KP_END = 188,
  K_KP_DOWNARROW = 189,
  K_KP_PGDN = 190,
  K_KP_ENTER = 191,
  K_KP_INS = 192,
  K_KP_DEL = 193,
  K_KP_SLASH = 194,
  K_KP_MINUS = 195,
  K_KP_PLUS = 196,
  K_KP_NUMLOCK = 197,
  K_KP_STAR = 198,
  K_KP_EQUALS = 199,
  K_MOUSE1 = 200,
  K_MOUSE2 = 201,
  K_MOUSE3 = 202,
  K_MOUSE4 = 203,
  K_MOUSE5 = 204,
  K_MWHEELDOWN = 205,
  K_MWHEELUP = 206,
  K_AUX1 = 207,
  K_AUX2 = 208,
  K_AUX3 = 209,
  K_AUX4 = 210,
  K_AUX5 = 211,
  K_AUX6 = 212,
  K_AUX7 = 213,
  K_AUX8 = 214,
  K_AUX9 = 215,
  K_AUX10 = 216,
  K_AUX11 = 217,
  K_AUX12 = 218,
  K_AUX13 = 219,
  K_AUX14 = 220,
  K_AUX15 = 221,
  K_AUX16 = 222,
  K_LAST_KEY = 223,
};

typedef union __m128
{
  union
  {
    /* 0x0000 */ float m128_f32[4];
    /* 0x0000 */ unsigned __int64 m128_u64[2];
    /* 0x0000 */ char m128_i8[16];
    /* 0x0000 */ short m128_i16[8];
    /* 0x0000 */ int m128_i32[4];
    /* 0x0000 */ __int64 m128_i64[2];
    /* 0x0000 */ unsigned char m128_u8[16];
    /* 0x0000 */ unsigned short m128_u16[8];
    /* 0x0000 */ unsigned int m128_u32[4];
  }; /* size: 0x0010 */
} _m128, *P_m128; /* size: 0x0010 */

class hybrid_vector
{
  /* 0x0000 */ union __m128 vec;
}; /* size: 0x0010 */

struct colgeom_visitor_t
{
  /* 0x0000 */ long Padding_17[4];
  /* 0x0010 */ class hybrid_vector m_mn;
  /* 0x0020 */ class hybrid_vector m_mx;
  /* 0x0030 */ class hybrid_vector m_p0;
  /* 0x0040 */ class hybrid_vector m_p1;
  /* 0x0050 */ class hybrid_vector m_delta;
  /* 0x0060 */ class hybrid_vector m_rvec;
  /* 0x0070 */ float m_radius;
  /* 0x0074 */ int m_mask;
  /* 0x0078 */ struct TraceThreadInfo* m_threadInfo;
  /* 0x007c */ long __PADDING__[1];
}; /* size: 0x0080 */

typedef enum _TAG_UNNAMED_34
{
  PTR_LIST_SIZE = 256,
} TAG_UNNAMED_34, *PTAG_UNNAMED_34;

typedef enum _D3D_INCLUDE_TYPE
{
  D3D_INCLUDE_LOCAL = 0,
  D3D_INCLUDE_SYSTEM = 1,
  D3D10_INCLUDE_LOCAL = 0,
  D3D10_INCLUDE_SYSTEM = 1,
  D3D_INCLUDE_FORCE_DWORD = 0x7fffffff,
} D3D_INCLUDE_TYPE, *PD3D_INCLUDE_TYPE;

enum ai_substate_t
{
  STATE_EXPOSED_COMBAT = 100,
  STATE_EXPOSED_NONCOMBAT = 101,
  STATE_EXPOSED_REACQUIRE_MOVE = 102,
  STATE_EXPOSED_REACQUIRE_DONE = 103,
  STATE_EXPOSED_FLASHBANGED = 104,
  STATE_EXPOSED_REACTION = 105,
  STATE_DEATH_PRECLEANUP = 200,
  STATE_DEATH_POSTCLEANUP = 201,
  STATE_GRENADE_FLEE = 300,
  STATE_GRENADE_TAKECOVER = 301,
  STATE_GRENADE_COWER = 302,
  STATE_GRENADE_COMBAT = 303,
  STATE_GRENADE_COVERATTACK = 304,
  STATE_GRENADE_ACQUIRE = 305,
  STATE_GRENADE_THROWBACK = 306,
};

enum e_itemListColumns
{
  ITEM_LIST_COLUMN_BACKGROUND = 0,
  ITEM_LIST_COLUMN_NAME = 1,
  ITEM_LIST_COLUMN_IMAGE = 2,
  ITEM_LIST_COLUMN_COST = 3,
  ITEM_LIST_COLUMN_LOCK = 4,
  ITEM_LIST_COLUMN_COUNT = 5,
  ITEM_LIST_COLUMN_EXTRA_IMAGE = 6,
  ITEM_LIST_COLUMN_NEWICON = 7,
};

enum weapAnimFiles_t
{
  WEAP_ANIM_ROOT = 0,
  WEAP_ANIM_IDLE = 1,
  WEAP_ANIM_EMPTY_IDLE = 2,
  WEAP_ANIM_FIRE_INTRO = 3,
  WEAP_ANIM_FIRE = 4,
  WEAP_ANIM_HOLD_FIRE = 5,
  WEAP_ANIM_LASTSHOT = 6,
  WEAP_ANIM_FINALSHOT = 7,
  WEAP_ANIM_RECHAMBER = 8,
  WEAP_ANIM_MELEE = 9,
  WEAP_ANIM_MELEE1 = 10,
  WEAP_ANIM_MELEE2 = 11,
  WEAP_ANIM_MELEE3 = 12,
  WEAP_ANIM_MELEE_EMPTY = 13,
  WEAP_ANIM_MELEE_CHARGE = 14,
  WEAP_ANIM_MELEE_CHARGE_EMPTY = 15,
  WEAP_ANIM_RELOAD = 16,
  WEAP_ANIM_RELOAD_RIGHT = 17,
  WEAP_ANIM_RELOAD_EMPTY = 18,
  WEAP_ANIM_RELOAD_START = 19,
  WEAP_ANIM_RELOAD_END = 20,
  WEAP_ANIM_RELOAD_QUICK = 21,
  WEAP_ANIM_RELOAD_QUICK_EMPTY = 22,
  WEAP_ANIM_RAISE = 23,
  WEAP_ANIM_FIRST_RAISE = 24,
  WEAP_ANIM_DROP = 25,
  WEAP_ANIM_ALT_RAISE = 26,
  WEAP_ANIM_ALT_DROP = 27,
  WEAP_ANIM_QUICK_RAISE = 28,
  WEAP_ANIM_QUICK_DROP = 29,
  WEAP_ANIM_EMPTY_RAISE = 30,
  WEAP_ANIM_EMPTY_DROP = 31,
  WEAP_ANIM_SPRINT_IN = 32,
  WEAP_ANIM_SPRINT_LOOP = 33,
  WEAP_ANIM_SPRINT_OUT = 34,
  WEAP_ANIM_SPRINT_EMPTY_IN = 35,
  WEAP_ANIM_SPRINT_EMPTY_LOOP = 36,
  WEAP_ANIM_SPRINT_EMPTY_OUT = 37,
  WEAP_ANIM_LOWREADY_IN = 38,
  WEAP_ANIM_LOWREADY_LOOP = 39,
  WEAP_ANIM_LOWREADY_OUT = 40,
  WEAP_ANIM_CONT_FIRE_IN = 41,
  WEAP_ANIM_CONT_FIRE_LOOP = 42,
  WEAP_ANIM_CONT_FIRE_OUT = 43,
  WEAP_ANIM_CRAWL_IN = 44,
  WEAP_ANIM_CRAWL_FORWARD = 45,
  WEAP_ANIM_CRAWL_BACK = 46,
  WEAP_ANIM_CRAWL_RIGHT = 47,
  WEAP_ANIM_CRAWL_LEFT = 48,
  WEAP_ANIM_CRAWL_OUT = 49,
  WEAP_ANIM_CRAWL_EMPTY_IN = 50,
  WEAP_ANIM_CRAWL_EMPTY_FORWARD = 51,
  WEAP_ANIM_CRAWL_EMPTY_BACK = 52,
  WEAP_ANIM_CRAWL_EMPTY_RIGHT = 53,
  WEAP_ANIM_CRAWL_EMPTY_LEFT = 54,
  WEAP_ANIM_CRAWL_EMPTY_OUT = 55,
  WEAP_ANIM_DEPLOY = 56,
  WEAP_ANIM_BREAKDOWN = 57,
  WEAP_ANIM_DETONATE = 58,
  WEAP_ANIM_NIGHTVISION_WEAR = 59,
  WEAP_ANIM_NIGHTVISION_REMOVE = 60,
  WEAP_ANIM_ADS_FIRE = 61,
  WEAP_ANIM_ADS_LASTSHOT = 62,
  WEAP_ANIM_ADS_FIRE_INTRO = 63,
  WEAP_ANIM_ADS_RECHAMBER = 64,
  WEAP_ANIM_DTP_IN = 65,
  WEAP_ANIM_DTP_LOOP = 66,
  WEAP_ANIM_DTP_OUT = 67,
  WEAP_ANIM_DTP_EMPTY_IN = 68,
  WEAP_ANIM_DTP_EMPTY_LOOP = 69,
  WEAP_ANIM_DTP_EMPTY_OUT = 70,
  WEAP_ANIM_SLIDE_IN = 71,
  WEAP_ANIM_MANTLE = 72,
  WEAP_ANIM_CAMERA_SPRINT_LOOP = 73,
  WEAP_ANIM_CAMERA_DTP_IN = 74,
  WEAP_ANIM_CAMERA_DTP_LOOP = 75,
  WEAP_ANIM_CAMERA_DTP_OUT = 76,
  WEAP_ANIM_CAMERA_MANTLE = 77,
  WEAP_ANIM_FIRE_LEFT = 78,
  WEAP_ANIM_LASTSHOT_LEFT = 79,
  WEAP_ANIM_FINALSHOT_LEFT = 80,
  WEAP_ANIM_IDLE_LEFT = 81,
  WEAP_ANIM_EMPTY_IDLE_LEFT = 82,
  WEAP_ANIM_RELOAD_EMPTY_LEFT = 83,
  WEAP_ANIM_RELOAD_LEFT = 84,
  WEAP_ANIM_ADS_UP = 85,
  WEAP_ANIM_ADS_DOWN = 86,
  WEAP_ANIM_ADS_UP_OTHER_SCOPE = 87,
  NUM_WEAP_ANIMS = 88,
};

class pulse_sum_normal
{
  /* 0x0000 */ long Padding_18[4];
  /* 0x0010 */ class phys_vec3 m_ud;
  /* 0x0020 */ class phys_vec3 m_b1_r;
  /* 0x0030 */ class phys_vec3 m_b2_r;
  /* 0x0040 */ class phys_vec3 m_b1_ap;
  /* 0x0050 */ class phys_vec3 m_b2_ap;
  /* 0x0060 */ float m_pulse_sum_min;
  /* 0x0064 */ float m_pulse_sum_max;
  /* 0x0068 */ float m_pulse_sum;
  /* 0x006c */ float m_right_side;
  /* 0x0070 */ float m_big_dirt;
  /* 0x0074 */ float m_cfm;
  /* 0x0078 */ float m_denom;
  /* 0x007c */ float m_pulse_limit_ratio;
  /* 0x0080 */ unsigned int m_flags;
  /* 0x0084 */ class pulse_sum_normal* m_pulse_parent;
  /* 0x0088 */ class pulse_sum_node* m_b1;
  /* 0x008c */ class pulse_sum_node* m_b2;
  /* 0x0090 */ class pulse_sum_cache* m_pulse_sum_cache;
}; /* size: 0x00a0 */

class pulse_sum_wheel
{
  /* 0x0000 */ long Padding_19[4];
  /* 0x0010 */ class pulse_sum_normal m_suspension;
  /* 0x00b0 */ class pulse_sum_normal* m_side;
  /* 0x00b4 */ class pulse_sum_normal* m_fwd;
  /* 0x00b8 */ float m_side_fric_max;
}; /* size: 0x00c0 */

typedef enum _TAG_UNNAMED_35
{
  COL_PARTITION = 0,
  COL_BRUSH = 1,
} TAG_UNNAMED_35, *PTAG_UNNAMED_35;

struct vehicle_spline_node_t
{
  /* 0x0000 */ short nextIdx;
  /* 0x0002 */ short prevIdx;
  /* 0x0004 */ float length;
  /* 0x0008 */ union vec3_t dir;
  /* 0x0014 */ float t;
}; /* size: 0x0018 */

enum GfxTextureOp
{
  GFXS_TEXOP_DISABLE = 0,
  GFXS_TEXOP_SELECTARG1 = 1,
  GFXS_TEXOP_SELECTARG2 = 2,
  GFXS_TEXOP_MODULATE = 3,
  GFXS_TEXOP_MODULATE2X = 4,
  GFXS_TEXOP_MODULATE4X = 5,
  GFXS_TEXOP_ADD = 6,
  GFXS_TEXOP_ADDSIGNED = 7,
  GFXS_TEXOP_ADDSIGNED2X = 8,
  GFXS_TEXOP_SUBTRACT = 9,
  GFXS_TEXOP_ADDSMOOTH = 10,
  GFXS_TEXOP_BLENDDIFFUSEALPHA = 11,
  GFXS_TEXOP_BLENDTEXTUREALPHA = 12,
  GFXS_TEXOP_BLENDFACTORALPHA = 13,
  GFXS_TEXOP_BLENDTEXTUREALPHAPM = 14,
  GFXS_TEXOP_BLENDCURRENTALPHA = 15,
  GFXS_TEXOP_MODULATEALPHA_ADDCOLOR = 16,
  GFXS_TEXOP_MODULATECOLOR_ADDALPHA = 17,
  GFXS_TEXOP_MODULATEINVALPHA_ADDCOLOR = 18,
  GFXS_TEXOP_MODULATEINVCOLOR_ADDALPHA = 19,
  GFXS_TEXOP_DOTPRODUCT3 = 20,
  GFXS_TEXOP_MULTIPLYADD = 21,
  GFXS_TEXOP_LERP = 22,
  GFXS_TEXOP_COUNT = 23,
  GFXS_TEXOP_BITS = 5,
  GFXS_TEXOP_MASK = 31,
};

enum CoreStringTable
{
  CORE_TABLE_STATS = 0,
  CORE_TABLE_MILESTONE_0 = 1,
  CORE_TABLE_MILESTONE_FIRST = 1,
  CORE_TABLE_MILESTONE_1 = 2,
  CORE_TABLE_MILESTONE_2 = 3,
  CORE_TABLE_MILESTONE_3 = 4,
  CORE_TABLE_MILESTONE_LAST = 4,
  CORE_TABLE_GLOBAL_COUNTERS = 5,
  CORE_TABLE_GLOBAL_COUNTERS_REF = 6,
  CORE_TABLE_TRACKER_COLUMNS = 7,
  CORE_TABLE_SP_STATS = 8,
  CORE_TABLE_RANK_ICON = 9,
  CORE_TABLE_SCORE_INFO = 10,
  CORE_TABLE_GAMETYPES = 11,
  CORE_TABLE_GAMEMODES = 12,
  CORE_TABLE_RANK_ICON_ZM = 13,
  CORE_TABLE_GUNLEVELS = 14,
  CORE_TABLE_ZM_STATS = 15,
  CORE_TABLE_MTX_ITEMS = 16,
  CORE_TABLE_COUNT = 17,
};

enum NV_COOLER_CONTROLLER
{
  NVAPI_COOLER_CONTROLLER_NONE = 0,
  NVAPI_COOLER_CONTROLLER_ADI = 1,
  NVAPI_COOLER_CONTROLLER_INTERNAL = 2,
};

enum destructiblePieceFieldType_t
{
  DPFT_EXPLOSIVEDAMAGEONLY = 18,
  DPFT_EXPLOSIVEDAMAGEONLYD1 = 19,
  DPFT_EXPLOSIVEDAMAGEONLYD2 = 20,
  DPFT_EXPLOSIVEDAMAGEONLYD3 = 21,
  DPFT_EXPLOSIVEDAMAGEONLYD4 = 22,
  DPFT_MELEEDAMAGE = 23,
  DPFT_MELEEDAMAGED1 = 24,
  DPFT_MELEEDAMAGED2 = 25,
  DPFT_MELEEDAMAGED3 = 26,
  DPFT_MELEEDAMAGED4 = 27,
  DPFT_PARENTDAMAGE = 28,
  DPFT_PARENTDAMAGED1 = 29,
  DPFT_PARENTDAMAGED2 = 30,
  DPFT_PARENTDAMAGED3 = 31,
  DPFT_PARENTDAMAGED4 = 32,
  DPFT_PHYSICSONPARENTDEATH = 33,
  DPFT_PHYSICSONPARENTDEATHD1 = 34,
  DPFT_PHYSICSONPARENTDEATHD2 = 35,
  DPFT_PHYSICSONPARENTDEATHD3 = 36,
  DPFT_PHYSICSONPARENTDEATHD4 = 37,
  DPFT_MAX_FIELD_TYPES = 38,
};

enum statsLocation
{
  STATS_LOCATION_NORMAL = 0,
  STATS_LOCATION_FORCE_NORMAL = 1,
  STATS_LOCATION_BACKUP = 2,
  STATS_LOCATION_STABLE = 3,
  STATS_LOCATION_OTHERPLAYER = 4,
  STATS_LOCATION_COUNT = 5,
};

enum gjccc_create_type_e
{
  CT_CYLINDER = 0,
  CT_COLLMAP = 1,
};

typedef enum _TAG_UNNAMED_36
{
  qfalse = 0,
  qtrue = 1,
} TAG_UNNAMED_36, *PTAG_UNNAMED_36;

enum NV_GPU_CLIENT_POWER_TOPOLOGY_CHANNEL_ID
{
  NV_GPU_CLIENT_POWER_TOPOLOGY_CHANNEL_ID_TOTAL_GPU_POWER = 0,
};

typedef enum _RTC_ErrorNumber
{
  _RTC_CHKSTK = 0,
  _RTC_CVRT_LOSS_INFO = 1,
  _RTC_CORRUPT_STACK = 2,
  _RTC_UNINIT_LOCAL_USE = 3,
  _RTC_CORRUPTED_ALLOCA = 4,
  _RTC_ILLEGAL = 5,
} RTC_ErrorNumber, *PRTC_ErrorNumber;

typedef enum _TAG_UNNAMED_37
{
  IMGF_MIPMAPS = 1,
  IMGF_ALLOWPICMIP = 2,
  IMGF_CHARACTERMIP = 4,
  IMGF_LIGHTMAP = 8,
  IMGF_CLAMP_S = 16,
  IMGF_CLAMP_T = 32,
  IMGF_HEIGHTMAP = 64,
  IMGF_DELAYLOAD = 128,
  IMGF_NOOPT = 256,
  IMGF_SCREENDEPTH = 512,
  IMGF_TEXTURENAME = 1024,
  IMGF_SHEET_KEEP_FLAGS = 1,
} TAG_UNNAMED_37, *PTAG_UNNAMED_37;

struct sd_decoder_pcm16
{
  /* 0x0000 */ unsigned int channelCount;
  /* 0x0004 */ unsigned int frameOffsetIntoTopBuffer;
  /* 0x0008 */ const short* buffers[2];
  /* 0x0010 */ unsigned int bufferFrameCount[2];
}; /* size: 0x0018 */

enum GfxStencilFunc
{
  GFXS_STENCILFUNC_NEVER = 0,
  GFXS_STENCILFUNC_LESS = 1,
  GFXS_STENCILFUNC_EQUAL = 2,
  GFXS_STENCILFUNC_LESSEQUAL = 3,
  GFXS_STENCILFUNC_GREATER = 4,
  GFXS_STENCILFUNC_NOTEQUAL = 5,
  GFXS_STENCILFUNC_GREATEREQUAL = 6,
  GFXS_STENCILFUNC_ALWAYS = 7,
  GFXS_STENCILFUNC_COUNT = 8,
};

typedef enum _TAG_UNNAMED_38
{
  TDEFL_MAX_SUPPORTED_HUFF_CODESIZE = 32,
} TAG_UNNAMED_38, *PTAG_UNNAMED_38;

typedef enum _D3D_SHADER_VARIABLE_CLASS
{
  D3D_SVC_SCALAR = 0,
  D3D_SVC_VECTOR = 1,
  D3D_SVC_MATRIX_ROWS = 2,
  D3D_SVC_MATRIX_COLUMNS = 3,
  D3D_SVC_OBJECT = 4,
  D3D_SVC_STRUCT = 5,
  D3D_SVC_INTERFACE_CLASS = 6,
  D3D_SVC_INTERFACE_POINTER = 7,
  D3D10_SVC_SCALAR = 0,
  D3D10_SVC_VECTOR = 1,
  D3D10_SVC_MATRIX_ROWS = 2,
  D3D10_SVC_MATRIX_COLUMNS = 3,
  D3D10_SVC_OBJECT = 4,
  D3D10_SVC_STRUCT = 5,
  D3D11_SVC_INTERFACE_CLASS = 6,
  D3D11_SVC_INTERFACE_POINTER = 7,
  D3D_SVC_FORCE_DWORD = 0x7fffffff,
} D3D_SHADER_VARIABLE_CLASS, *PD3D_SHADER_VARIABLE_CLASS;

enum MaterialStateSet
{
  MTL_STATE_SET_ALPHA_TEST = 0,
  MTL_STATE_SET_BLEND_FUNC_RGB = 1,
  MTL_STATE_SET_BLEND_FUNC_ALPHA = 2,
  MTL_STATE_SET_CULL_FACE = 3,
  MTL_STATE_SET_DEPTH_TEST = 4,
  MTL_STATE_SET_DEPTH_WRITE = 5,
  MTL_STATE_SET_COLOR_WRITE = 6,
  MTL_STATE_SET_POLYGON_OFFSET = 7,
  MTL_STATE_SET_STENCIL = 8,
  MTL_STATE_SET_WIREFRAME = 9,
  MTL_STATE_SET_COUNT = 10,
};

typedef enum _TAG_UNNAMED_39
{
  MZ_ZIP_END_OF_CENTRAL_DIR_HEADER_SIG = 0x6054b50,
  MZ_ZIP_CENTRAL_DIR_HEADER_SIG = 0x2014b50,
  MZ_ZIP_LOCAL_DIR_HEADER_SIG = 0x4034b50,
  MZ_ZIP_LOCAL_DIR_HEADER_SIZE = 30,
  MZ_ZIP_CENTRAL_DIR_HEADER_SIZE = 46,
  MZ_ZIP_END_OF_CENTRAL_DIR_HEADER_SIZE = 22,
  MZ_ZIP_CDH_SIG_OFS = 0,
  MZ_ZIP_CDH_VERSION_MADE_BY_OFS = 4,
  MZ_ZIP_CDH_VERSION_NEEDED_OFS = 6,
  MZ_ZIP_CDH_BIT_FLAG_OFS = 8,
  MZ_ZIP_CDH_METHOD_OFS = 10,
  MZ_ZIP_CDH_FILE_TIME_OFS = 12,
  MZ_ZIP_CDH_FILE_DATE_OFS = 14,
  MZ_ZIP_CDH_CRC32_OFS = 16,
  MZ_ZIP_CDH_COMPRESSED_SIZE_OFS = 20,
  MZ_ZIP_CDH_DECOMPRESSED_SIZE_OFS = 24,
  MZ_ZIP_CDH_FILENAME_LEN_OFS = 28,
  MZ_ZIP_CDH_EXTRA_LEN_OFS = 30,
  MZ_ZIP_CDH_COMMENT_LEN_OFS = 32,
  MZ_ZIP_CDH_DISK_START_OFS = 34,
  MZ_ZIP_CDH_INTERNAL_ATTR_OFS = 36,
  MZ_ZIP_CDH_EXTERNAL_ATTR_OFS = 38,
  MZ_ZIP_CDH_LOCAL_HEADER_OFS = 42,
  MZ_ZIP_LDH_SIG_OFS = 0,
  MZ_ZIP_LDH_VERSION_NEEDED_OFS = 4,
  MZ_ZIP_LDH_BIT_FLAG_OFS = 6,
  MZ_ZIP_LDH_METHOD_OFS = 8,
  MZ_ZIP_LDH_FILE_TIME_OFS = 10,
  MZ_ZIP_LDH_FILE_DATE_OFS = 12,
  MZ_ZIP_LDH_CRC32_OFS = 14,
  MZ_ZIP_LDH_COMPRESSED_SIZE_OFS = 18,
  MZ_ZIP_LDH_DECOMPRESSED_SIZE_OFS = 22,
  MZ_ZIP_LDH_FILENAME_LEN_OFS = 26,
  MZ_ZIP_LDH_EXTRA_LEN_OFS = 28,
  MZ_ZIP_ECDH_SIG_OFS = 0,
  MZ_ZIP_ECDH_NUM_THIS_DISK_OFS = 4,
  MZ_ZIP_ECDH_NUM_DISK_CDIR_OFS = 6,
  MZ_ZIP_ECDH_CDIR_NUM_ENTRIES_ON_DISK_OFS = 8,
  MZ_ZIP_ECDH_CDIR_TOTAL_ENTRIES_OFS = 10,
  MZ_ZIP_ECDH_CDIR_SIZE_OFS = 12,
  MZ_ZIP_ECDH_CDIR_OFS_OFS = 16,
  MZ_ZIP_ECDH_COMMENT_SIZE_OFS = 20,
} TAG_UNNAMED_39, *PTAG_UNNAMED_39;

struct $_TypeDescriptor$_extraBytes_19
{
  /* 0x0000 */ const void* pVFTable;
  /* 0x0004 */ void* spare;
  /* 0x0008 */ char name[19];
}; /* size: 0x001b */

enum eWeaponOptionGroup
{
  WEAPONOPTION_GROUP_FIRST = 0,
  WEAPONOPTION_GROUP_CAMO = 0,
  WEAPONOPTION_GROUP_TAG = 1,
  WEAPONOPITON_GROUP_EMBLEM = 2,
  WEAPONOPTION_GROUP_FIRST_ATTACHMENT_OPTION = 3,
  WEAPONOPTION_GROUP_RETICLE = 3,
  WEAPONOPTION_GROUP_LENS = 4,
  WEAPONOPTION_GROUP_RETICLE_COLOR = 5,
  WEAPONOPTION_GROUP_LAST_ATTACHMENT_OPTION = 5,
  WEAPONOPTION_GROUP_COUNT = 6,
  WEAPONOPTION_GROUP_INVALID = 6,
};

typedef enum _D3D_SHADER_VARIABLE_FLAGS
{
  D3D_SVF_USERPACKED = 1,
  D3D_SVF_USED = 2,
  D3D_SVF_INTERFACE_POINTER = 4,
  D3D_SVF_INTERFACE_PARAMETER = 8,
  D3D10_SVF_USERPACKED = 1,
  D3D10_SVF_USED = 2,
  D3D11_SVF_INTERFACE_POINTER = 4,
  D3D11_SVF_INTERFACE_PARAMETER = 8,
  D3D_SVF_FORCE_DWORD = 0x7fffffff,
} D3D_SHADER_VARIABLE_FLAGS, *PD3D_SHADER_VARIABLE_FLAGS;

class bdFastArray<unsigned __int64>
{
  /* 0x0000 */ unsigned __int64* m_data;
  /* 0x0004 */ unsigned int m_capacity;
  /* 0x0008 */ unsigned int m_size;
}; /* size: 0x000c */

enum GfxStencilOp
{
  GFXS_STENCILOP_KEEP = 0,
  GFXS_STENCILOP_ZERO = 1,
  GFXS_STENCILOP_REPLACE = 2,
  GFXS_STENCILOP_INCRSAT = 3,
  GFXS_STENCILOP_DECRSAT = 4,
  GFXS_STENCILOP_INVERT = 5,
  GFXS_STENCILOP_INCR = 6,
  GFXS_STENCILOP_DECR = 7,
  GFXS_STENCILOP_COUNT = 8,
};

struct HashEntry
{
  /* 0x0000 */ unsigned int status_next;
  union
  {
    union
    {
      /* 0x0004 */ unsigned int prev;
      /* 0x0004 */ unsigned int str;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ u;
}; /* size: 0x0008 */

struct tagVS_FIXEDFILEINFO
{
  /* 0x0000 */ unsigned long dwSignature;
  /* 0x0004 */ unsigned long dwStrucVersion;
  /* 0x0008 */ unsigned long dwFileVersionMS;
  /* 0x000c */ unsigned long dwFileVersionLS;
  /* 0x0010 */ unsigned long dwProductVersionMS;
  /* 0x0014 */ unsigned long dwProductVersionLS;
  /* 0x0018 */ unsigned long dwFileFlagsMask;
  /* 0x001c */ unsigned long dwFileFlags;
  /* 0x0020 */ unsigned long dwFileOS;
  /* 0x0024 */ unsigned long dwFileType;
  /* 0x0028 */ unsigned long dwFileSubtype;
  /* 0x002c */ unsigned long dwFileDateMS;
  /* 0x0030 */ unsigned long dwFileDateLS;
}; /* size: 0x0034 */

typedef struct _MINIDUMP_MODULE_CALLBACK
{
  /* 0x0000 */ wchar_t* FullPath;
  /* 0x0004 */ unsigned __int64 BaseOfImage;
  /* 0x000c */ unsigned long SizeOfImage;
  /* 0x0010 */ unsigned long CheckSum;
  /* 0x0014 */ unsigned long TimeDateStamp;
  /* 0x0018 */ struct tagVS_FIXEDFILEINFO VersionInfo;
  /* 0x004c */ void* CvRecord;
  /* 0x0050 */ unsigned long SizeOfCvRecord;
  /* 0x0054 */ void* MiscRecord;
  /* 0x0058 */ unsigned long SizeOfMiscRecord;
} MINIDUMP_MODULE_CALLBACK, *PMINIDUMP_MODULE_CALLBACK; /* size: 0x005c */

enum VehicleSeatPositions
{
  VEH_POS_NONE = -1,
  VEH_POS_DRIVER = 0,
  VEH_POS_MIN_GUNNER = 1,
  VEH_POS_GUNNER_1 = 1,
  VEH_POS_GUNNER_2 = 2,
  VEH_POS_GUNNER_3 = 3,
  VEH_POS_GUNNER_4 = 4,
  VEH_POS_MAX_GUNNER = 4,
  VEH_POS_MIN_PASSENGER = 5,
  VEH_POS_PASSENGER_1 = 5,
  VEH_POS_PASSENGER_2 = 6,
  VEH_POS_PASSENGER_3 = 7,
  VEH_POS_PASSENGER_4 = 8,
  VEH_POS_PASSENGER_5 = 9,
  VEH_POS_PASSENGER_6 = 10,
  VEH_POS_MAX_PASSENGER = 10,
  NUM_VEHICLE_POSITIONS = 11,
};

typedef enum _D3DFORMAT
{
  D3DFMT_UNKNOWN = 0,
  D3DFMT_R8G8B8 = 20,
  D3DFMT_A8R8G8B8 = 21,
  D3DFMT_X8R8G8B8 = 22,
  D3DFMT_R5G6B5 = 23,
  D3DFMT_X1R5G5B5 = 24,
  D3DFMT_A1R5G5B5 = 25,
  D3DFMT_A4R4G4B4 = 26,
  D3DFMT_R3G3B2 = 27,
  D3DFMT_A8 = 28,
  D3DFMT_A8R3G3B2 = 29,
  D3DFMT_X4R4G4B4 = 30,
  D3DFMT_A2B10G10R10 = 31,
  D3DFMT_A8B8G8R8 = 32,
  D3DFMT_X8B8G8R8 = 33,
  D3DFMT_G16R16 = 34,
  D3DFMT_A2R10G10B10 = 35,
  D3DFMT_A16B16G16R16 = 36,
  D3DFMT_A8P8 = 40,
  D3DFMT_P8 = 41,
  D3DFMT_L8 = 50,
  D3DFMT_A8L8 = 51,
  D3DFMT_A4L4 = 52,
  D3DFMT_V8U8 = 60,
  D3DFMT_L6V5U5 = 61,
  D3DFMT_X8L8V8U8 = 62,
  D3DFMT_Q8W8V8U8 = 63,
  D3DFMT_V16U16 = 64,
  D3DFMT_A2W10V10U10 = 67,
  D3DFMT_UYVY = 0x59565955,
  D3DFMT_R8G8_B8G8 = 0x47424752,
  D3DFMT_YUY2 = 0x32595559,
  D3DFMT_G8R8_G8B8 = 0x42475247,
  D3DFMT_DXT1 = 0x31545844,
  D3DFMT_DXT2 = 0x32545844,
  D3DFMT_DXT3 = 0x33545844,
  D3DFMT_DXT4 = 0x34545844,
  D3DFMT_DXT5 = 0x35545844,
  D3DFMT_D16_LOCKABLE = 70,
  D3DFMT_D32 = 71,
  D3DFMT_D15S1 = 73,
  D3DFMT_D24S8 = 75,
  D3DFMT_D24X8 = 77,
  D3DFMT_D24X4S4 = 79,
  D3DFMT_D16 = 80,
  D3DFMT_D32F_LOCKABLE = 82,
  D3DFMT_D24FS8 = 83,
  D3DFMT_D32_LOCKABLE = 84,
  D3DFMT_S8_LOCKABLE = 85,
  D3DFMT_L16 = 81,
  D3DFMT_VERTEXDATA = 100,
  D3DFMT_INDEX16 = 101,
  D3DFMT_INDEX32 = 102,
  D3DFMT_Q16W16V16U16 = 110,
  D3DFMT_MULTI2_ARGB8 = 0x3154454d,
  D3DFMT_R16F = 111,
  D3DFMT_G16R16F = 112,
  D3DFMT_A16B16G16R16F = 113,
  D3DFMT_R32F = 114,
  D3DFMT_G32R32F = 115,
  D3DFMT_A32B32G32R32F = 116,
  D3DFMT_CxV8U8 = 117,
  D3DFMT_A1 = 118,
  D3DFMT_A2B10G10R10_XR_BIAS = 119,
  D3DFMT_BINARYBUFFER = 199,
  D3DFMT_FORCE_DWORD = 0x7fffffff,
} D3DFORMAT, *PD3DFORMAT;

enum EvalOperatorType
{
  EVAL_OP_LPAREN = 0,
  EVAL_OP_RPAREN = 1,
  EVAL_OP_COLON = 2,
  EVAL_OP_QUESTION = 3,
  EVAL_OP_PLUS = 4,
  EVAL_OP_MINUS = 5,
  EVAL_OP_UNARY_PLUS = 6,
  EVAL_OP_UNARY_MINUS = 7,
  EVAL_OP_MULTIPLY = 8,
  EVAL_OP_DIVIDE = 9,
  EVAL_OP_MODULUS = 10,
  EVAL_OP_LSHIFT = 11,
  EVAL_OP_RSHIFT = 12,
  EVAL_OP_BITWISE_NOT = 13,
  EVAL_OP_BITWISE_AND = 14,
  EVAL_OP_BITWISE_OR = 15,
  EVAL_OP_BITWISE_XOR = 16,
  EVAL_OP_LOGICAL_NOT = 17,
  EVAL_OP_LOGICAL_AND = 18,
  EVAL_OP_LOGICAL_OR = 19,
  EVAL_OP_EQUALS = 20,
  EVAL_OP_NOT_EQUAL = 21,
  EVAL_OP_LESS = 22,
  EVAL_OP_LESS_EQUAL = 23,
  EVAL_OP_GREATER = 24,
  EVAL_OP_GREATER_EQUAL = 25,
  EVAL_OP_COUNT = 26,
};

enum EMemTrack
{
  TRACK_DEBUG = 0,
  TRACK_HUNK = 1,
  TRACK_BINARIES = 2,
  TRACK_MISC_SWAP = 3,
  TRACK_DELIMITER1 = 4,
  TRACK_AI = 5,
  TRACK_AI_NODES = 6,
  TRACK_SCRIPT = 7,
  TRACK_SCRIPT_DEBUG = 8,
  TRACK_FX = 9,
  TRACK_GLASS = 10,
  TRACK_NETWORK_ENTITY = 11,
  TRACK_MISC = 12,
  TRACK_FASTFILE = 13,
  TRACK_ANIMATION = 14,
  TRACK_ANIMCACHE = 15,
  TRACK_WORLD_GLOBALS = 16,
  TRACK_SOUND_GLOBALS = 17,
  TRACK_CLIENT_ANIMSCRIPT = 18,
  TRACK_SOUND = 19,
  TRACK_DELIMITER2 = 20,
  TRACK_RENDERER_GLOBALS = 21,
  TRACK_RENDERER_IMAGES = 22,
  TRACK_RENDERER_WORLD = 23,
  TRACK_RENDERER_MODELS = 24,
  TRACK_RENDERER_MISC = 25,
  TRACK_RENDERER_SIEGE = 26,
  TRACK_CINEMATICS = 27,
  TRACK_DELIMITER3 = 28,
  TRACK_COLLISION_MISC = 29,
  TRACK_COLLISION_BRUSH = 30,
  TRACK_COLLISION_MODEL_TRI = 31,
  TRACK_COLLISION_TERRAIN = 32,
  TRACK_PHYSICS = 33,
  TRACK_MAP_ENTS = 34,
  TRACK_TEMP = 35,
  TRACK_DELIMITER4 = 36,
  TRACK_LOCALIZATION = 37,
  TRACK_FLAME = 38,
  TRACK_UI = 39,
  TRACK_TL = 40,
  TRACK_ZMEM = 41,
  TRACK_FIREMANAGER = 42,
  TRACK_PROFILE = 43,
  TRACK_CLIENT = 44,
  TRACK_RECORDER = 45,
  TRACK_RSTREAM = 46,
  TRACK_RENDERER_STREAMBUFFER = 47,
  TRACK_RENDERER_STREAMBUFFER_EXTRA = 48,
  TRACK_GEOSTREAM = 49,
  TRACK_DDL = 50,
  TRACK_ONLINE = 51,
  TRACK_EMBLEM = 52,
  TRACK_VEHICLEDEF = 53,
  TRACK_THREAD_LOCAL = 54,
  TRACK_MINSPEC_IMAGES = 55,
  TRACK_DELIMITER5 = 56,
  TRACK_NONE = 57,
  TRACK_COUNT = 58,
};

class broad_phase_info
{
  /* 0x0000 */ long Padding_20[20];
  /* 0x0050 */ class rigid_body* m_rb;
  /* 0x0054 */ const class phys_mat44* m_rb_to_world_xform;
  /* 0x0058 */ const class phys_mat44* m_cg_to_world_xform;
  /* 0x005c */ const class phys_mat44* m_cg_to_rb_xform;
  /* 0x0060 */ const class phys_gjk_geom* m_gjk_geom;
  /* 0x0064 */ unsigned int m_gjk_geom_id;
  /* 0x0068 */ int m_surface_type;
}; /* size: 0x0070 */

struct D3D11_TEX1D_RTV
{
  /* 0x0000 */ unsigned int MipSlice;
}; /* size: 0x0004 */

enum WheelEffectState
{
  WHEEL_STATE_ROLLING = 0,
  WHEEL_STATE_AIRBORN = 1,
  WHEEL_STATE_SKIDDING = 2,
  WHEEL_STATE_MAX = 3,
};

enum eAttachment
{
  ATTACHMENT_NONE = 0,
  ATTACHMENT_ACOG = 1,
  ATTACHMENT_DUALCLIP = 2,
  ATTACHMENT_DUALOPTIC = 3,
  ATTACHMENT_DW = 4,
  ATTACHMENT_EXTBARREL = 5,
  ATTACHMENT_EXTCLIP = 6,
  ATTACHMENT_EXTRAMAGS = 7,
  ATTACHMENT_FASTADS = 8,
  ATTACHMENT_FASTRELOAD = 9,
  ATTACHMENT_FMJ = 10,
  ATTACHMENT_GL = 11,
  ATTACHMENT_GRIP = 12,
  ATTACHMENT_HOLO = 13,
  ATTACHMENT_IR = 14,
  ATTACHMENT_IRONSIGHTS = 15,
  ATTACHMENT_LONGBREATH = 16,
  ATTACHMENT_MK = 17,
  ATTACHMENT_MMS = 18,
  ATTACHMENT_RANGEFINDER = 19,
  ATTACHMENT_REFLEX = 20,
  ATTACHMENT_RF = 21,
  ATTACHMENT_SELECTFIRE = 22,
  ATTACHMENT_SILENCER = 23,
  ATTACHMENT_STACKFIRE = 24,
  ATTACHMENT_STALKER = 25,
  ATTACHMENT_STEADYAIM = 26,
  ATTACHMENT_SWAYREDUC = 27,
  ATTACHMENT_TACKNIFE = 28,
  ATTACHMENT_VZOOM = 29,
  ATTACHMENT_TYPE_COUNT = 30,
  ATTACHMENT_INVALID = 30,
};

enum DWRITE_FONT_STYLE
{
};

struct animScript_t
{
  /* 0x0000 */ int numItems;
  /* 0x0004 */ struct animScriptItem_t* items[128];
}; /* size: 0x0204 */

typedef enum _D3D_SHADER_VARIABLE_TYPE
{
  D3D_SVT_VOID = 0,
  D3D_SVT_BOOL = 1,
  D3D_SVT_INT = 2,
  D3D_SVT_FLOAT = 3,
  D3D_SVT_STRING = 4,
  D3D_SVT_TEXTURE = 5,
  D3D_SVT_TEXTURE1D = 6,
  D3D_SVT_TEXTURE2D = 7,
  D3D_SVT_TEXTURE3D = 8,
  D3D_SVT_TEXTURECUBE = 9,
  D3D_SVT_SAMPLER = 10,
  D3D_SVT_SAMPLER1D = 11,
  D3D_SVT_SAMPLER2D = 12,
  D3D_SVT_SAMPLER3D = 13,
  D3D_SVT_SAMPLERCUBE = 14,
  D3D_SVT_PIXELSHADER = 15,
  D3D_SVT_VERTEXSHADER = 16,
  D3D_SVT_PIXELFRAGMENT = 17,
  D3D_SVT_VERTEXFRAGMENT = 18,
  D3D_SVT_UINT = 19,
  D3D_SVT_UINT8 = 20,
  D3D_SVT_GEOMETRYSHADER = 21,
  D3D_SVT_RASTERIZER = 22,
  D3D_SVT_DEPTHSTENCIL = 23,
  D3D_SVT_BLEND = 24,
  D3D_SVT_BUFFER = 25,
  D3D_SVT_CBUFFER = 26,
  D3D_SVT_TBUFFER = 27,
  D3D_SVT_TEXTURE1DARRAY = 28,
  D3D_SVT_TEXTURE2DARRAY = 29,
  D3D_SVT_RENDERTARGETVIEW = 30,
  D3D_SVT_DEPTHSTENCILVIEW = 31,
  D3D_SVT_TEXTURE2DMS = 32,
  D3D_SVT_TEXTURE2DMSARRAY = 33,
  D3D_SVT_TEXTURECUBEARRAY = 34,
  D3D_SVT_HULLSHADER = 35,
  D3D_SVT_DOMAINSHADER = 36,
  D3D_SVT_INTERFACE_POINTER = 37,
  D3D_SVT_COMPUTESHADER = 38,
  D3D_SVT_DOUBLE = 39,
  D3D_SVT_RWTEXTURE1D = 40,
  D3D_SVT_RWTEXTURE1DARRAY = 41,
  D3D_SVT_RWTEXTURE2D = 42,
  D3D_SVT_RWTEXTURE2DARRAY = 43,
  D3D_SVT_RWTEXTURE3D = 44,
  D3D_SVT_RWBUFFER = 45,
  D3D_SVT_BYTEADDRESS_BUFFER = 46,
  D3D_SVT_RWBYTEADDRESS_BUFFER = 47,
  D3D_SVT_STRUCTURED_BUFFER = 48,
  D3D_SVT_RWSTRUCTURED_BUFFER = 49,
  D3D_SVT_APPEND_STRUCTURED_BUFFER = 50,
  D3D_SVT_CONSUME_STRUCTURED_BUFFER = 51,
  D3D10_SVT_VOID = 0,
  D3D10_SVT_BOOL = 1,
  D3D10_SVT_INT = 2,
  D3D10_SVT_FLOAT = 3,
  D3D10_SVT_STRING = 4,
  D3D10_SVT_TEXTURE = 5,
  D3D10_SVT_TEXTURE1D = 6,
  D3D10_SVT_TEXTURE2D = 7,
  D3D10_SVT_TEXTURE3D = 8,
  D3D10_SVT_TEXTURECUBE = 9,
  D3D10_SVT_SAMPLER = 10,
  D3D10_SVT_SAMPLER1D = 11,
  D3D10_SVT_SAMPLER2D = 12,
  D3D10_SVT_SAMPLER3D = 13,
  D3D10_SVT_SAMPLERCUBE = 14,
  D3D10_SVT_PIXELSHADER = 15,
  D3D10_SVT_VERTEXSHADER = 16,
  D3D10_SVT_PIXELFRAGMENT = 17,
  D3D10_SVT_VERTEXFRAGMENT = 18,
  D3D10_SVT_UINT = 19,
  D3D10_SVT_UINT8 = 20,
  D3D10_SVT_GEOMETRYSHADER = 21,
  D3D10_SVT_RASTERIZER = 22,
  D3D10_SVT_DEPTHSTENCIL = 23,
  D3D10_SVT_BLEND = 24,
  D3D10_SVT_BUFFER = 25,
  D3D10_SVT_CBUFFER = 26,
  D3D10_SVT_TBUFFER = 27,
  D3D10_SVT_TEXTURE1DARRAY = 28,
  D3D10_SVT_TEXTURE2DARRAY = 29,
  D3D10_SVT_RENDERTARGETVIEW = 30,
  D3D10_SVT_DEPTHSTENCILVIEW = 31,
  D3D10_SVT_TEXTURE2DMS = 32,
  D3D10_SVT_TEXTURE2DMSARRAY = 33,
  D3D10_SVT_TEXTURECUBEARRAY = 34,
  D3D11_SVT_HULLSHADER = 35,
  D3D11_SVT_DOMAINSHADER = 36,
  D3D11_SVT_INTERFACE_POINTER = 37,
  D3D11_SVT_COMPUTESHADER = 38,
  D3D11_SVT_DOUBLE = 39,
  D3D11_SVT_RWTEXTURE1D = 40,
  D3D11_SVT_RWTEXTURE1DARRAY = 41,
  D3D11_SVT_RWTEXTURE2D = 42,
  D3D11_SVT_RWTEXTURE2DARRAY = 43,
  D3D11_SVT_RWTEXTURE3D = 44,
  D3D11_SVT_RWBUFFER = 45,
  D3D11_SVT_BYTEADDRESS_BUFFER = 46,
  D3D11_SVT_RWBYTEADDRESS_BUFFER = 47,
  D3D11_SVT_STRUCTURED_BUFFER = 48,
  D3D11_SVT_RWSTRUCTURED_BUFFER = 49,
  D3D11_SVT_APPEND_STRUCTURED_BUFFER = 50,
  D3D11_SVT_CONSUME_STRUCTURED_BUFFER = 51,
  D3D_SVT_FORCE_DWORD = 0x7fffffff,
} D3D_SHADER_VARIABLE_TYPE, *PD3D_SHADER_VARIABLE_TYPE;

enum eWeaponComponentType
{
  WEAPON_COMPONENT_UNKNOWN = 0,
  WEAPON_COMPONENT_ATTACHMENT = 1,
  WEAPON_COMPONENT_BASE = 2,
};

enum EntInfoType
{
  ENTINFO_TYPE_ALL = 0,
  ENTINFO_TYPE_AI = 1,
  ENTINFO_TYPE_VEHICLE = 2,
  ENTINFO_TYPE_TRIGGER = 3,
  NUM_ENTINFO_TYPE = 4,
};

struct GfxStreamedPartInfo
{
  /* 0x0000 */ unsigned int levelCountAndSize;
  /* 0x0004 */ unsigned int hash;
  /* 0x0008 */ unsigned short width;
  /* 0x000a */ unsigned short height;
  /* 0x000c */ unsigned int offset : 32; /* bit position: 0 */
  struct /* bitfield */
  {
    /* 0x0010 */ unsigned int size : 28; /* bit position: 0 */
    /* 0x0010 */ unsigned int ipakIndex : 4; /* bit position: 28 */
  }; /* bitfield */
  struct /* bitfield */
  {
    /* 0x0014 */ unsigned int adjacentLeft : 15; /* bit position: 0 */
    /* 0x0014 */ unsigned int adjacentRight : 15; /* bit position: 15 */
    /* 0x0014 */ unsigned int compressed : 1; /* bit position: 30 */
    /* 0x0014 */ unsigned int valid : 1; /* bit position: 31 */
  }; /* bitfield */
}; /* size: 0x0018 */

enum ddlReturnCodes_e
{
  DDL_RC_SUCCESS = 0,
  DDL_RC_ERROR = -1,
  DDL_RC_BUFFER_IO_ERROR = -2,
  DDL_RC_STATE_INVALID = -3,
  DDL_RC_MEMBER_NULL = -4,
  DDL_RC_MEMBER_INVALID = -5,
  DDL_RC_OFFSET_INVALID = -6,
  DDL_RC_TRUNCATED = -7,
};

struct ddlState_t
{
  /* 0x0000 */ int absoluteOffset;
  /* 0x0004 */ int arrayIndex;
  /* 0x0008 */ struct ddlMemberDef_t* member;
  /* 0x000c */ const struct ddlDef_t* ddl;
  /* 0x0010 */ enum ddlReturnCodes_e returnCode;
}; /* size: 0x0014 */

enum aistateEnum_t
{
  AISTATE_COMBAT = 0,
  MAX_AISTATES = 1,
};

enum clearType_t
{
  R_CLEAR_NEVER = 0,
  R_CLEAR_DEV_ONLY_BLINK = 1,
  R_CLEAR_BLINK = 2,
  R_CLEAR_STEADY = 3,
  R_CLEAR_FOG_COLOR = 4,
  R_CLEAR_COUNT = 5,
};

enum VARENUM
{
  VT_EMPTY = 0,
  VT_NULL = 1,
  VT_I2 = 2,
  VT_I4 = 3,
  VT_R4 = 4,
  VT_R8 = 5,
  VT_CY = 6,
  VT_DATE = 7,
  VT_BSTR = 8,
  VT_DISPATCH = 9,
  VT_ERROR = 10,
  VT_BOOL = 11,
  VT_VARIANT = 12,
  VT_UNKNOWN = 13,
  VT_DECIMAL = 14,
  VT_I1 = 16,
  VT_UI1 = 17,
  VT_UI2 = 18,
  VT_UI4 = 19,
  VT_I8 = 20,
  VT_UI8 = 21,
  VT_INT = 22,
  VT_UINT = 23,
  VT_VOID = 24,
  VT_HRESULT = 25,
  VT_PTR = 26,
  VT_SAFEARRAY = 27,
  VT_CARRAY = 28,
  VT_USERDEFINED = 29,
  VT_LPSTR = 30,
  VT_LPWSTR = 31,
  VT_RECORD = 36,
  VT_INT_PTR = 37,
  VT_UINT_PTR = 38,
  VT_FILETIME = 64,
  VT_BLOB = 65,
  VT_STREAM = 66,
  VT_STORAGE = 67,
  VT_STREAMED_OBJECT = 68,
  VT_STORED_OBJECT = 69,
  VT_BLOB_OBJECT = 70,
  VT_CF = 71,
  VT_CLSID = 72,
  VT_VERSIONED_STREAM = 73,
  VT_BSTR_BLOB = 4095,
  VT_VECTOR = 4096,
  VT_ARRAY = 8192,
  VT_BYREF = 16384,
  VT_RESERVED = 0xffff8000,
  VT_ILLEGAL = 0xffffffff,
  VT_ILLEGALMASKED = 4095,
  VT_TYPEMASK = 4095,
};

struct trajectory_t
{
  /* 0x0000 */ unsigned char trType;
  /* 0x0001 */ char Padding_21[3];
  /* 0x0004 */ int trTime;
  /* 0x0008 */ int trDuration;
  /* 0x000c */ union vec3_t trBase;
  /* 0x0018 */ union vec3_t trDelta;
}; /* size: 0x0024 */

struct LerpEntityStateTurret
{
  /* 0x0000 */ union vec3_t gunAngles;
  /* 0x000c */ int ownerNum;
  /* 0x0010 */ float heatVal;
  /* 0x0014 */ int overheating;
  /* 0x0018 */ float pivotOffset;
  /* 0x001c */ int flags;
}; /* size: 0x0020 */

struct LerpEntityStateLoopFx
{
  /* 0x0000 */ float cullDist;
  /* 0x0004 */ int period;
}; /* size: 0x0008 */

struct LerpEntityStateActor
{
  union
  {
    union
    {
      /* 0x0000 */ int actorNum;
      /* 0x0000 */ int corpseNum;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ index;
  /* 0x0004 */ int species;
  /* 0x0008 */ int team;
  /* 0x000c */ int enemy;
  /* 0x0010 */ int freeCameraLockOnAllowed;
  struct
  {
    /* 0x0014 */ short fBodyPitch;
  } /* size: 0x0002 */ proneInfo;
  /* 0x0016 */ unsigned short aiType;
}; /* size: 0x0018 */

struct LerpEntityStatePrimaryLight
{
  /* 0x0000 */ unsigned char colorAndExp[4];
  /* 0x0004 */ float intensity;
  /* 0x0008 */ float radius;
  /* 0x000c */ float cosHalfFovOuter;
  /* 0x0010 */ float cosHalfFovInner;
  /* 0x0014 */ unsigned int mixerIndex;
}; /* size: 0x0018 */

union Weapon
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned int weaponIdx : 8; /* bit position: 0 */
      /* 0x0000 */ unsigned int attachment1 : 6; /* bit position: 8 */
      /* 0x0000 */ unsigned int attachment2 : 6; /* bit position: 14 */
      /* 0x0000 */ unsigned int attachment3 : 6; /* bit position: 20 */
      /* 0x0000 */ unsigned int padding : 6; /* bit position: 26 */
    }; /* bitfield */
    /* 0x0000 */ unsigned int weaponData;
  }; /* size: 0x0004 */
}; /* size: 0x0004 */

struct LerpEntityStatePlayer
{
  /* 0x0000 */ float leanf;
  /* 0x0004 */ int movementDir;
  /* 0x0008 */ int moveType;
  /* 0x000c */ union Weapon primaryWeapon;
  /* 0x0010 */ union Weapon stowedWeapon;
  /* 0x0014 */ union Weapon offhandWeapon;
  /* 0x0018 */ union Weapon meleeWeapon;
  /* 0x001c */ unsigned char meleeWeaponCamo;
  /* 0x001d */ unsigned char meleeWeaponModel;
  /* 0x001e */ unsigned char vehicleType;
  /* 0x001f */ unsigned char vehicleAnimBoneIndex;
  /* 0x0020 */ unsigned char vehicleSeat;
  /* 0x0021 */ unsigned char stowedWeaponCamo;
  /* 0x0022 */ unsigned char weaponHeat;
  /* 0x0023 */ unsigned char proneLegsAngle;
}; /* size: 0x0024 */

struct LerpEntityStateVehicleGunnerAngles
{
  /* 0x0000 */ short pitch;
  /* 0x0002 */ short yaw;
}; /* size: 0x0004 */

struct LerpEntityStateVehicleRotorArm
{
  /* 0x0000 */ short pitch;
  /* 0x0002 */ short roll;
}; /* size: 0x0004 */

struct LerpEntityStateVehicle
{
  /* 0x0000 */ float steerYaw;
  /* 0x0004 */ float bodyRoll;
  union
  {
    /* 0x0008 */ struct LerpEntityStateVehicleGunnerAngles gunnerAngles[4];
    /* 0x0008 */ struct LerpEntityStateVehicleRotorArm rotors[4];
  }; /* size: 0x0010 */
  union
  {
    /* 0x0018 */ short throttle;
    /* 0x0018 */ short bodyPitch;
  }; /* size: 0x0002 */
  /* 0x001a */ short gunPitch;
  /* 0x001c */ short gunYaw;
  /* 0x001e */ unsigned char targetRotorSpeed;
  /* 0x001f */ char __PADDING__[1];
}; /* size: 0x0020 */

struct LerpEntityStateMissile
{
  /* 0x0000 */ int launchTime;
  /* 0x0004 */ int parentClientNum;
  /* 0x0008 */ int fuseTime;
  /* 0x000c */ int forcedDud;
  /* 0x0010 */ float autoDetonateTime;
  /* 0x0014 */ union vec3_t passThrough;
}; /* size: 0x0020 */

struct LerpEntityStateScriptMover
{
  /* 0x0000 */ unsigned char attachTagIndex[4];
  /* 0x0004 */ int attachedTagIndex;
  /* 0x0008 */ short attachModelIndex[4];
  /* 0x0010 */ short animScriptedAnim;
  /* 0x0012 */ short attachedEntNum;
  /* 0x0014 */ int attachedEntTime;
  /* 0x0018 */ short exploderIndex;
  /* 0x001a */ unsigned short scale;
  /* 0x001c */ unsigned char flags;
  /* 0x001d */ char Padding_22;
  /* 0x001e */ unsigned short aiType;
}; /* size: 0x0020 */

struct LerpEntityStateBulletHit
{
  /* 0x0000 */ union vec3_t start;
}; /* size: 0x000c */

struct LerpEntityStateEarthquake
{
  /* 0x0000 */ float scale;
  /* 0x0004 */ float radius;
  /* 0x0008 */ int duration;
}; /* size: 0x000c */

struct LerpEntityStateCustomExplode
{
  /* 0x0000 */ int startTime;
  /* 0x0004 */ int effectIndex;
}; /* size: 0x0008 */

struct LerpEntityStateExplosion
{
  /* 0x0000 */ float innerRadius;
  /* 0x0004 */ float magnitude;
  /* 0x0008 */ float innerDamage;
  /* 0x000c */ int dummy;
  /* 0x0010 */ float outerDamage;
}; /* size: 0x0014 */

struct LerpEntityStateExplosionJolt
{
  /* 0x0000 */ float innerRadius;
  /* 0x0004 */ union vec3_t impulse;
}; /* size: 0x0010 */

struct LerpEntityStateJetThrust
{
  /* 0x0000 */ union vec3_t thrustDir;
  /* 0x000c */ int dummy;
  /* 0x0010 */ float dotLimit;
}; /* size: 0x0014 */

struct LerpEntityStatePhysicsJitter
{
  /* 0x0000 */ float innerRadius;
  /* 0x0004 */ float minDisplacement;
  /* 0x0008 */ float maxDisplacement;
}; /* size: 0x000c */

struct LerpEntityStateCreateDynEnt
{
  /* 0x0000 */ int model;
  /* 0x0004 */ int fxId;
  /* 0x0008 */ int mature;
}; /* size: 0x000c */

struct LerpEntityStateStreamerHint
{
  /* 0x0000 */ float factor;
}; /* size: 0x0004 */

struct LerpEntityStateZBarrierPiece
{
  /* 0x0000 */ unsigned char flags;
  /* 0x0001 */ unsigned char animTime;
}; /* size: 0x0002 */

struct LerpEntityStateZBarrier
{
  /* 0x0000 */ unsigned int barrierTypeIndex;
  /* 0x0004 */ struct LerpEntityStateZBarrierPiece pieces[6];
}; /* size: 0x0010 */

struct LerpEntityStateAnonymous
{
  /* 0x0000 */ int data[9];
}; /* size: 0x0024 */

union LerpEntityStateTypeUnion
{
  union
  {
    /* 0x0000 */ struct LerpEntityStateTurret turret;
    /* 0x0000 */ struct LerpEntityStateLoopFx loopFx;
    /* 0x0000 */ struct LerpEntityStateActor actor;
    /* 0x0000 */ struct LerpEntityStatePrimaryLight primaryLight;
    /* 0x0000 */ struct LerpEntityStatePlayer player;
    /* 0x0000 */ struct LerpEntityStateVehicle vehicle;
    /* 0x0000 */ struct LerpEntityStateMissile missile;
    /* 0x0000 */ struct LerpEntityStateScriptMover scriptMover;
    /* 0x0000 */ struct LerpEntityStateBulletHit bulletHit;
    /* 0x0000 */ struct LerpEntityStateEarthquake earthquake;
    /* 0x0000 */ struct LerpEntityStateCustomExplode customExplode;
    /* 0x0000 */ struct LerpEntityStateExplosion explosion;
    /* 0x0000 */ struct LerpEntityStateExplosionJolt explosionJolt;
    /* 0x0000 */ struct LerpEntityStateJetThrust jetThrust;
    /* 0x0000 */ struct LerpEntityStatePhysicsJitter physicsJitter;
    /* 0x0000 */ struct LerpEntityStateDestructibleHit destructibleHit;
    /* 0x0000 */ struct LerpEntityStateCreateDynEnt createDynEnt;
    /* 0x0000 */ struct LerpEntityStateStreamerHint streamerHint;
    /* 0x0000 */ struct LerpEntityStateZBarrier zbarrier;
    /* 0x0000 */ struct LerpEntityStateAnonymous anonymous;
  }; /* size: 0x0024 */
}; /* size: 0x0024 */

struct LerpEntityState
{
  /* 0x0000 */ int eFlags;
  /* 0x0004 */ int eFlags2;
  /* 0x0008 */ struct trajectory_t pos;
  /* 0x002c */ struct trajectory_t apos;
  /* 0x0050 */ union LerpEntityStateTypeUnion u;
  /* 0x0074 */ short useCount;
  union
  {
    union
    {
      /* 0x0076 */ unsigned char iHeadIconTeam;
      /* 0x0076 */ short teamAndOwnerIndex;
    }; /* size: 0x0002 */
  } /* size: 0x0002 */ faction;
  /* 0x0078 */ unsigned int clientFields;
}; /* size: 0x007c */

struct renderOptions_s
{
  /* 0x0000 */ unsigned int s;
}; /* size: 0x0004 */

struct actorAnimState_t
{
  /* 0x0000 */ short state;
  /* 0x0002 */ unsigned char subState;
  /* 0x0003 */ char Padding_23;
  /* 0x0004 */ float fLeanAmount;
  /* 0x0008 */ float fAimUpDown;
  /* 0x000c */ float fAimLeftRight;
}; /* size: 0x0010 */

struct playerAnimState_t
{
  /* 0x0000 */ int legsAnim;
  /* 0x0004 */ int torsoAnim;
  /* 0x0008 */ float fTorsoPitch;
  /* 0x000c */ float fWaistPitch;
}; /* size: 0x0010 */

struct vehicleState_t
{
  /* 0x0000 */ short flags;
  /* 0x0002 */ unsigned char vehicleDefIndex;
  /* 0x0003 */ unsigned char treeId;
  /* 0x0004 */ short animId;
  /* 0x0006 */ short attachModelIndex[2];
  /* 0x000a */ unsigned char attachTagIndex[2];
}; /* size: 0x000c */

struct hardlineHint_t
{
  /* 0x0000 */ unsigned char team;
  /* 0x0001 */ unsigned char perk;
  /* 0x0002 */ unsigned char hint;
}; /* size: 0x0003 */

struct scriptMoverState_t
{
  /* 0x0000 */ unsigned char fov;
  /* 0x0001 */ unsigned char treeId;
  /* 0x0002 */ short animId;
}; /* size: 0x0004 */

struct clientLinkInfo_t
{
  /* 0x0000 */ short parentEnt;
  /* 0x0002 */ unsigned char tagIndex;
  /* 0x0003 */ unsigned char flags;
}; /* size: 0x0004 */

struct entityState_s
{
  /* 0x0000 */ int number;
  /* 0x0004 */ struct LerpEntityState lerp;
  /* 0x0080 */ int time2;
  /* 0x0084 */ unsigned int loopSoundId;
  /* 0x0088 */ int solid;
  /* 0x008c */ struct renderOptions_s renderOptions;
  union
  {
    union
    {
      /* 0x0090 */ struct actorAnimState_t animState;
      /* 0x0090 */ struct playerAnimState_t anim;
      /* 0x0090 */ struct vehicleState_t vehicleState;
      /* 0x0090 */ struct hardlineHint_t hardline;
      /* 0x0090 */ struct scriptMoverState_t moverState;
      /* 0x0090 */ struct fxLightingState_t fx;
    }; /* size: 0x0010 */
  } /* size: 0x0010 */ un2;
  union
  {
    union
    {
      /* 0x00a0 */ int hintString;
      /* 0x00a0 */ int vehicleXModel;
      /* 0x00a0 */ unsigned int secondBcAlias;
      /* 0x00a0 */ unsigned int soundTag;
    }; /* size: 0x0004 */
  } /* size: 0x0004 */ un3;
  /* 0x00a4 */ unsigned int partBits[5];
  /* 0x00b8 */ struct clientLinkInfo_t clientLinkInfo;
  /* 0x00bc */ int clientMask[1];
  /* 0x00c0 */ unsigned char events[4];
  /* 0x00c4 */ unsigned int eventParms[4];
  /* 0x00d4 */ unsigned int eventParm;
  /* 0x00d8 */ short eType;
  /* 0x00da */ short groundEntityNum;
  union
  {
    union
    {
      /* 0x00dc */ short brushmodel;
      /* 0x00dc */ short xmodel;
      /* 0x00dc */ short primaryLight;
      /* 0x00dc */ unsigned short bone;
    }; /* size: 0x0002 */
  } /* size: 0x0002 */ index;
  /* 0x00de */ short otherEntityNum;
  /* 0x00e0 */ short attackerEntityNum;
  /* 0x00e2 */ short enemyModel;
  /* 0x00e4 */ union Weapon weapon;
  /* 0x00e8 */ union Weapon lastStandPrevWeapon;
  /* 0x00ec */ unsigned short targetname;
  /* 0x00ee */ short loopSoundFade;
  /* 0x00f0 */ short eventSequence;
  /* 0x00f2 */ unsigned char surfType;
  /* 0x00f3 */ unsigned char clientNum;
  /* 0x00f4 */ unsigned char iHeadIcon;
  /* 0x00f5 */ unsigned char weaponModel;
  union
  {
    union
    {
      /* 0x00f6 */ unsigned char scale;
      /* 0x00f6 */ unsigned char eventParm2;
      /* 0x00f6 */ unsigned char helicopterStage;
      /* 0x00f6 */ unsigned char destructibleid;
      /* 0x00f6 */ unsigned char zombieShrinkOn;
    }; /* size: 0x0001 */
  } /* size: 0x0001 */ un1;
  /* 0x00f7 */ char __PADDING__[1];
}; /* size: 0x00f8 */

enum NitrousVehicleController::VehicleHorseControlState
{
  LEFT_STICK_STEERS_HORSE_AND_CAMERA = 0,
  LEFT_STICK_STEERS_HORSE_RIGHT_STICK_CAMERA = 1,
  RIGHT_STICK_STEERS_HORSE_AND_CAMERA = 2,
};

enum dvar_cmd_t
{
  DVAR_CMD_AIM_LOCKON_PITCH_STRENGTH = 0,
  DVAR_CMD_AMMO_COUNTER_HIDE = 1,
  DVAR_CMD_CG_OBJECTIVE_TEXT = 2,
  DVAR_CMD_COMPASS = 3,
  DVAR_CMD_DRAW_TALK = 4,
  DVAR_CMD_FOV = 5,
  DVAR_CMD_HUD_HARDCORE = 6,
  DVAR_CMD_PLAYER_SPRINT_TIME = 7,
  DVAR_CMD_MINI_SCOREBOARD_HIDE = 8,
  DVAR_CMD_NUM_LIVES = 9,
  DVAR_CMD_PLAYER_PUSH_AMOUNT = 10,
  DVAR_CMD_PLAYER_STEP_ON_ACTORS = 11,
  DVAR_CMD_SCRIPT_MAIN_MENU = 12,
  DVAR_CMD_THIRD_PERSON = 13,
  DVAR_CMD_THIRD_PERSON_ANGLE = 14,
  DVAR_CMD_COUNT = 15,
};

enum statIndex_t
{
  STAT_HEALTH = 0,
  STAT_DEAD_YAW = 1,
  STAT_MAX_HEALTH = 2,
  STAT_SPAWN_COUNT = 3,
  MAX_STATS = 4,
};

enum scriptAnimConditions_t
{
  ANIM_COND_PLAYERANIMTYPE = 0,
  ANIM_COND_WEAPONCLASS = 1,
  ANIM_COND_NEXTPLAYERANIMTYPE = 2,
  ANIM_COND_NEXTWEAPONCLASS = 3,
  ANIM_COND_MOUNTED = 4,
  ANIM_COND_MOVESTATUS = 5,
  ANIM_COND_PREVDIRECTION = 6,
  ANIM_COND_DIRECTION = 7,
  ANIM_COND_DMGDIRECTION = 8,
  ANIM_COND_DMGTYPE = 9,
  ANIM_COND_STANCE = 10,
  ANIM_COND_UNDERHAND = 11,
  ANIM_COND_FIRING = 12,
  ANIM_COND_WEAPON_POSITION = 13,
  ANIM_COND_SLOPE = 14,
  ANIM_COND_PERK = 15,
  ANIM_COND_ATTACHMENT = 16,
  ANIM_COND_RIOTSHIELDNEXT = 17,
  ANIM_COND_VEHICLE_NAME = 18,
  ANIM_COND_VEHICLE_SEAT_TO = 19,
  ANIM_COND_VEHICLE_SEAT_FROM = 20,
  ANIM_COND_VEHICLE_ANIM_STAGE = 21,
  ANIM_COND_VEHICLE_ENTRY_POS = 22,
  ANIM_COND_EVENT = 23,
  ANIM_COND_CAC = 24,
  NUM_ANIM_CONDITIONS = 25,
};

typedef struct _XMUSHORT2
{
  /* 0x0000 */ unsigned short x;
  /* 0x0002 */ unsigned short y;
} XMUSHORT2, *PXMUSHORT2; /* size: 0x0004 */

enum DXGI_MODE_SCALING
{
  DXGI_MODE_SCALING_UNSPECIFIED = 0,
  DXGI_MODE_SCALING_CENTERED = 1,
  DXGI_MODE_SCALING_STRETCHED = 2,
};

enum eAttachmentPoint
{
  ATTACHMENT_POINT_NONE = 0,
  ATTACHMENT_POINT_TOP = 1,
  ATTACHMENT_POINT_FIRST = 1,
  ATTACHMENT_POINT_BOTTOM = 2,
  ATTACHMENT_POINT_TRIGGER = 3,
  ATTACHMENT_POINT_MUZZLE = 4,
  ATTACHMENT_POINT_GUNPERK = 5,
  ATTACHMENT_POINT_COUNT = 6,
  ATTACHMENT_POINT_INVALID = 6,
};

typedef enum _D3DDEGREETYPE
{
  D3DDEGREE_LINEAR = 1,
  D3DDEGREE_QUADRATIC = 2,
  D3DDEGREE_CUBIC = 3,
  D3DDEGREE_QUINTIC = 5,
  D3DDEGREE_FORCE_DWORD = 0x7fffffff,
} D3DDEGREETYPE, *PD3DDEGREETYPE;

enum perfValType_t
{
  PERF_CLIENTPING = 0,
  PERF_CLIENTTIMEOUTS = 1,
  PERF_DWTASKSCOMPLETE = 2,
  PERF_DWTASKSFAIL = 3,
  PERF_DWTASKSTIMEOUT = 4,
  PERF_TASKTIME = 5,
  PERF_DWDISCONNECTS = 6,
  PERF_SERVERFRAMEMS = 7,
  PERF_SNAPSHOT_CLIENT_NODELTA = 8,
  PERF_SNAPSHOT_STALE_DELTA = 9,
  PERF_SNAPSHOT_STALE_ENTS = 10,
  PERF_SNAPSHOT_OK_DELTA = 11,
  PERF_GAMESTATES = 12,
  PERF_PARTYSTATES = 13,
  PERF_MAX_COUNTERS = 14,
};

typedef enum _TAG_UNNAMED_40
{
  DRAW_SURF_BSP_CAMERA_LIT = 0,
  DRAW_SURF_SMODEL_CAMERA_LIT = 1,
  DRAW_SURF_CAMERA_LIT_BEGIN = 2,
  DRAW_SURF_ENT_CAMERA_LIT = 2,
  DRAW_SURF_CAMERA_LIT_END = 3,
  DRAW_SURF_BSP_CAMERA_LIGHT_MAP = 3,
  DRAW_SURF_SMODEL_CAMERA_LIGHT_MAP_OPAQUE = 4,
  DRAW_SURF_CAMERA_LIGHT_MAP_BEGIN = 5,
  DRAW_SURF_ENT_CAMERA_LIGHT_MAP_OPAQUE = 5,
  DRAW_SURF_CAMERA_LIGHT_MAP_END = 6,
  DRAW_SURF_DEPTH_HACK_BEGIN = 6,
  DRAW_SURF_DEPTH_HACK_CAMERA = 6,
  DRAW_SURF_DEPTH_HACK_END = 7,
  DRAW_SURF_CAMERA_LIT_TRANS_BEGIN = 7,
  DRAW_SURF_BSP_CAMERA_LIT_TRANS = 7,
  DRAW_SURF_SMODEL_CAMERA_LIT_TRANS = 8,
  DRAW_SURF_ENT_CAMERA_LIT_TRANS = 9,
  DRAW_SURF_CAMERA_LIT_TRANS_END = 10,
  DRAW_SURF_CAMERA_LIT_QUASI_OPAQUE_BEGIN = 10,
  DRAW_SURF_SMODEL_CAMERA_LIT_QUASI_OPAQUE = 10,
  DRAW_SURF_ENT_CAMERA_LIT_QUASI_OPAQUE = 11,
  DRAW_SURF_CAMERA_LIT_QUASI_OPAQUE_END = 12,
  DRAW_SURF_CAMERA_LIT_FX_BEGIN = 12,
  DRAW_SURF_FX_CAMERA_LIT = 12,
  DRAW_SURF_FX_CAMERA_LIT_AUTO = 13,
  DRAW_SURF_FX_CAMERA_LIT_DECAL = 14,
  DRAW_SURF_CODEMESH_CAMERA_LIT = 15,
  DRAW_SURF_CAMERA_LIT_FX_END = 16,
  DRAW_SURF_CAMERA_EMISSIVE_OPAQUE_BEGIN = 16,
  DRAW_SURF_BSP_CAMERA_EMISSIVE_OPAQUE = 16,
  DRAW_SURF_SMODEL_CAMERA_EMISSIVE_OPAQUE = 17,
  DRAW_SURF_ENT_CAMERA_EMISSIVE_OPAQUE = 18,
  DRAW_SURF_CAMERA_EMISSIVE_OPAQUE_END = 19,
  DRAW_SURF_CAMERA_EMISSIVE_TRANS_BEGIN = 19,
  DRAW_SURF_BSP_CAMERA_EMISSIVE_TRANS = 19,
  DRAW_SURF_SMODEL_CAMERA_EMISSIVE_TRANS = 20,
  DRAW_SURF_ENT_CAMERA_EMISSIVE_TRANS = 21,
  DRAW_SURF_CAMERA_EMISSIVE_TRANS_END = 22,
  DRAW_SURF_CAMERA_EMISSIVE_FX_BEGIN = 22,
  DRAW_SURF_SMODEL_CAMERA_EMISSIVE_FX = 22,
  DRAW_SURF_ENT_CAMERA_EMISSIVE_FX = 23,
  DRAW_SURF_FX_CAMERA_EMISSIVE = 24,
  DRAW_SURF_FX_CAMERA_EMISSIVE_AUTO = 25,
  DRAW_SURF_FX_CAMERA_EMISSIVE_DECAL = 26,
  DRAW_SURF_FX_CAMERA_EMISSIVE_VIEWMODEL = 27,
  DRAW_SURF_FX_CAMERA_EMISSIVE_SUPERFLARE = 28,
  DRAW_SURF_CAMERA_EMISSIVE_FX_END = 29,
  DRAW_SURF_SUNSHADOW_0_BEGIN = 29,
  DRAW_SURF_BSP_SUNSHADOW_0 = 29,
  DRAW_SURF_SMODEL_SUNSHADOW_0 = 30,
  DRAW_SURF_ENT_SUNSHADOW_0 = 31,
  DRAW_SURF_CODEMESH_SUNSHADOW_0 = 32,
  DRAW_SURF_SUNSHADOW_1_BEGIN = 33,
  DRAW_SURF_BSP_SUNSHADOW_1 = 33,
  DRAW_SURF_SMODEL_SUNSHADOW_1 = 34,
  DRAW_SURF_ENT_SUNSHADOW_1 = 35,
  DRAW_SURF_CODEMESH_SUNSHADOW_1 = 36,
  DRAW_SURF_SPOTSHADOW_0_BEGIN = 37,
  DRAW_SURF_BSP_SPOTSHADOW_0 = 37,
  DRAW_SURF_SMODEL_SPOTSHADOW_0 = 38,
  DRAW_SURF_ENT_SPOTSHADOW_0 = 39,
  DRAW_SURF_SPOTSHADOW_1_BEGIN = 40,
  DRAW_SURF_BSP_SPOTSHADOW_1 = 40,
  DRAW_SURF_SMODEL_SPOTSHADOW_1 = 41,
  DRAW_SURF_ENT_SPOTSHADOW_1 = 42,
  DRAW_SURF_SPOTSHADOW_2_BEGIN = 43,
  DRAW_SURF_BSP_SPOTSHADOW_2 = 43,
  DRAW_SURF_SMODEL_SPOTSHADOW_2 = 44,
  DRAW_SURF_ENT_SPOTSHADOW_2 = 45,
  DRAW_SURF_SPOTSHADOW_3_BEGIN = 46,
  DRAW_SURF_BSP_SPOTSHADOW_3 = 46,
  DRAW_SURF_SMODEL_SPOTSHADOW_3 = 47,
  DRAW_SURF_ENT_SPOTSHADOW_3 = 48,
  DRAW_SURF_ENT_CAMERA_SONAR = 49,
  DRAW_SURF_TYPE_COUNT = 50,
} TAG_UNNAMED_40, *PTAG_UNNAMED_40;

enum std::pointer_safety::pointer_safety
{
  relaxed = 0,
  preferred = 1,
  strict = 2,
};

struct XAUDIO2_EFFECT_CHAIN
{
  /* 0x0000 */ unsigned int EffectCount;
  /* 0x0004 */ struct XAUDIO2_EFFECT_DESCRIPTOR* pEffectDescriptors;
}; /* size: 0x0008 */

struct SaveSourceBufferInfo
{
  /* 0x0000 */ char* sourceBuf;
  /* 0x0004 */ int len;
}; /* size: 0x0008 */

enum animCommandFlags
{
  ANIM_FL_THROW_GRENADE = 0,
  ANIM_FL_TURN_TO_TURRET = 1,
  ANIM_FL_MAX = 2,
};

enum DWRITE_FONT_FACE_TYPE
{
};

enum WeaponCamoMaterialFlags
{
  WCM_REPLACE_COLOR = 1,
  WCM_REPLACE_NORMAL = 2,
  WCM_REPLACE_SPECULAR = 4,
};

typedef enum _TAG_UNNAMED_41
{
  INVALID_NODE = -1,
} TAG_UNNAMED_41, *PTAG_UNNAMED_41;

enum jsmnPrimitiveType_e
{
  JSMN_PRIMITIVE_TYPE_INVALID = 0,
  JSMN_PRIMITIVE_TYPE_INT = 1,
  JSMN_PRIMITIVE_TYPE_BOOL = 2,
};

typedef enum _TAG_UNNAMED_42
{
  TECHNIQUE_DEPTH_PREPASS = 0,
  TECHNIQUE_BUILD_SHADOWMAP_DEPTH = 1,
  TECHNIQUE_UNLIT = 2,
  TECHNIQUE_EMISSIVE = 3,
  TECHNIQUE_LIT_BEGIN = 4,
  TECHNIQUE_LIT = 4,
  TECHNIQUE_LIT_SUN = 5,
  TECHNIQUE_LIT_SUN_SHADOW = 6,
  TECHNIQUE_LIT_SPOT = 7,
  TECHNIQUE_LIT_SPOT_SHADOW = 8,
  TECHNIQUE_LIT_SPOT_SQUARE = 9,
  TECHNIQUE_LIT_SPOT_SQUARE_SHADOW = 10,
  TECHNIQUE_LIT_SPOT_ROUND = 11,
  TECHNIQUE_LIT_SPOT_ROUND_SHADOW = 12,
  TECHNIQUE_LIT_OMNI = 13,
  TECHNIQUE_LIT_OMNI_SHADOW = 14,
  TECHNIQUE_LIT_DLIGHT_GLIGHT = 15,
  TECHNIQUE_LIT_SUN_DLIGHT_GLIGHT = 16,
  TECHNIQUE_LIT_SUN_SHADOW_DLIGHT_GLIGHT = 17,
  TECHNIQUE_LIT_SPOT_DLIGHT_GLIGHT = 18,
  TECHNIQUE_LIT_SPOT_SHADOW_DLIGHT_GLIGHT = 19,
  TECHNIQUE_LIT_SPOT_SQUARE_DLIGHT_GLIGHT = 20,
  TECHNIQUE_LIT_SPOT_SQUARE_SHADOW_DLIGHT_GLIGHT = 21,
  TECHNIQUE_LIT_SPOT_ROUND_DLIGHT_GLIGHT = 22,
  TECHNIQUE_LIT_SPOT_ROUND_SHADOW_DLIGHT_GLIGHT = 23,
  TECHNIQUE_LIT_OMNI_DLIGHT_GLIGHT = 24,
  TECHNIQUE_LIT_OMNI_SHADOW_DLIGHT_GLIGHT = 25,
  TECHNIQUE_LIT_END = 26,
  TECHNIQUE_LIGHT_SPOT = 26,
  TECHNIQUE_LIGHT_OMNI = 27,
  TECHNIQUE_FAKELIGHT_NORMAL = 28,
  TECHNIQUE_FAKELIGHT_VIEW = 29,
  TECHNIQUE_SUNLIGHT_PREVIEW = 30,
  TECHNIQUE_CASE_TEXTURE = 31,
  TECHNIQUE_WIREFRAME_SOLID = 32,
  TECHNIQUE_WIREFRAME_SHADED = 33,
  TECHNIQUE_DEBUG_BUMPMAP = 34,
  TECHNIQUE_DEBUG_PERFORMANCE = 35,
  TECHNIQUE_COUNT = 36,
  TECHNIQUE_TOTAL_COUNT = 37,
  TECHNIQUE_CUSTOM_01 = 2,
  TECHNIQUE_CUSTOM_02 = 3,
  TECHNIQUE_CUSTOM_03 = 4,
  TECHNIQUE_CUSTOM_04 = 5,
  TECHNIQUE_CUSTOM_05 = 6,
  TECHNIQUE_CUSTOM_06 = 7,
  TECHNIQUE_CUSTOM_07 = 8,
  TECHNIQUE_CUSTOM_08 = 9,
  TECHNIQUE_CUSTOM_09 = 10,
  TECHNIQUE_CUSTOM_10 = 11,
  TECHNIQUE_CUSTOM_11 = 12,
  TECHNIQUE_CUSTOM_12 = 13,
  TECHNIQUE_CUSTOM_13 = 14,
  TECHNIQUE_CUSTOM_14 = 15,
  TECHNIQUE_CUSTOM_15 = 16,
  TECHNIQUE_CUSTOM_16 = 17,
  TECHNIQUE_CUSTOM_17 = 18,
  TECHNIQUE_CUSTOM_18 = 19,
  TECHNIQUE_CUSTOM_19 = 20,
  TECHNIQUE_CUSTOM_20 = 21,
  TECHNIQUE_CUSTOM_21 = 22,
  TECHNIQUE_CUSTOM_22 = 23,
  TECHNIQUE_CUSTOM_23 = 24,
  TECHNIQUE_CUSTOM_24 = 25,
  TECHNIQUE_CUSTOM_25 = 26,
  TECHNIQUE_CUSTOM_26 = 27,
  TECHNIQUE_CUSTOM_27 = 28,
  TECHNIQUE_CUSTOM_28 = 29,
  TECHNIQUE_CUSTOM_29 = 30,
  TECHNIQUE_CUSTOM_30 = 31,
  TECHNIQUE_CUSTOM_COUNT = 32,
  TECHNIQUE_NONE = 255,
} TAG_UNNAMED_42, *PTAG_UNNAMED_42;

class environment_rigid_body
{
}; /* size: 0x0160 */

class phys_inplace_avl_tree<rigid_body_pair_key,rigid_body_constraint_contact,rigid_body_constraint_contact::avl_tree_accessor>
{
  /* 0x0000 */ class rigid_body_constraint_contact* m_tree_root;
}; /* size: 0x0004 */

class phys_free_list<user_rigid_body>::T_internal_base
{
  /* 0x0000 */ class phys_free_list<user_rigid_body>::T_internal_base* m_prev_T_internal;
  /* 0x0004 */ class phys_free_list<user_rigid_body>::T_internal_base* m_next_T_internal;
}; /* size: 0x0008 */

class phys_free_list<user_rigid_body>
{
  /* 0x0000 */ class phys_free_list<user_rigid_body>::T_internal_base m_dummy_head;
  /* 0x0008 */ int m_list_count;
  /* 0x000c */ int m_list_count_high_water;
  /* 0x0010 */ class user_rigid_body* m_ptr_list[256];
  /* 0x0410 */ int m_ptr_list_count;
}; /* size: 0x0414 */

class phys_free_list<rigid_body>::T_internal_base
{
  /* 0x0000 */ class phys_free_list<rigid_body>::T_internal_base* m_prev_T_internal;
  /* 0x0004 */ class phys_free_list<rigid_body>::T_internal_base* m_next_T_internal;
}; /* size: 0x0008 */

class phys_free_list<rigid_body>
{
  /* 0x0000 */ class phys_free_list<rigid_body>::T_internal_base m_dummy_head;
  /* 0x0008 */ int m_list_count;
  /* 0x000c */ int m_list_count_high_water;
  /* 0x0010 */ class rigid_body* m_ptr_list[256];
  /* 0x0410 */ int m_ptr_list_count;
}; /* size: 0x0414 */

class phys_free_list<rigid_body_constraint_contact>::T_internal_base
{
  /* 0x0000 */ class phys_free_list<rigid_body_constraint_contact>::T_internal_base* m_prev_T_internal;
  /* 0x0004 */ class phys_free_list<rigid_body_constraint_contact>::T_internal_base* m_next_T_internal;
}; /* size: 0x0008 */

class phys_free_list<rigid_body_constraint_contact>
{
  /* 0x0000 */ class phys_free_list<rigid_body_constraint_contact>::T_internal_base m_dummy_head;
  /* 0x0008 */ int m_list_count;
  /* 0x000c */ int m_list_count_high_water;
  /* 0x0010 */ class rigid_body_constraint_contact* m_ptr_list[256];
  /* 0x0410 */ int m_ptr_list_count;
}; /* size: 0x0414 */

class phys_free_list<rigid_body_constraint_hinge>::T_internal_base
{
  /* 0x0000 */ class phys_free_list<rigid_body_constraint_hinge>::T_internal_base* m_prev_T_internal;
  /* 0x0004 */ class phys_free_list<rigid_body_constraint_hinge>::T_internal_base* m_next_T_internal;
}; /* size: 0x0008 */

class phys_free_list<rigid_body_constraint_hinge>
{
  /* 0x0000 */ class phys_free_list<rigid_body_constraint_hinge>::T_internal_base m_dummy_head;
  /* 0x0008 */ int m_list_count;
  /* 0x000c */ int m_list_count_high_water;
  /* 0x0010 */ class rigid_body_constraint_hinge* m_ptr_list[256];
  /* 0x0410 */ int m_ptr_list_count;
}; /* size: 0x0414 */

class phys_free_list<rigid_body_constraint_distance>::T_internal_base
{
  /* 0x0000 */ class phys_free_list<rigid_body_constraint_distance>::T_internal_base* m_prev_T_internal;
  /* 0x0004 */ class phys_free_list<rigid_body_constraint_distance>::T_internal_base* m_next_T_internal;
}; /* size: 0x0008 */

class phys_free_list<rigid_body_constraint_distance>
{
  /* 0x0000 */ class phys_free_list<rigid_body_constraint_distance>::T_internal_base m_dummy_head;
  /* 0x0008 */ int m_list_count;
  /* 0x000c */ int m_list_count_high_water;
  /* 0x0010 */ class rigid_body_constraint_distance* m_ptr_list[256];
  /* 0x0410 */ int m_ptr_list_count;
}; /* size: 0x0414 */

class phys_free_list<rigid_body_constraint_ragdoll>::T_internal_base
{
  /* 0x0000 */ class phys_free_list<rigid_body_constraint_ragdoll>::T_internal_base* m_prev_T_internal;
  /* 0x0004 */ class phys_free_list<rigid_body_constraint_ragdoll>::T_internal_base* m_next_T_internal;
}; /* size: 0x0008 */

class phys_free_list<rigid_body_constraint_ragdoll>
{
  /* 0x0000 */ class phys_free_list<rigid_body_constraint_ragdoll>::T_internal_base m_dummy_head;
  /* 0x0008 */ int m_list_count;
  /* 0x000c */ int m_list_count_high_water;
  /* 0x0010 */ class rigid_body_constraint_ragdoll* m_ptr_list[256];
  /* 0x0410 */ int m_ptr_list_count;
}; /* size: 0x0414 */

class phys_free_list<rigid_body_constraint_wheel>::T_internal_base
{
  /* 0x0000 */ class phys_free_list<rigid_body_constraint_wheel>::T_internal_base* m_prev_T_internal;
  /* 0x0004 */ class phys_free_list<rigid_body_constraint_wheel>::T_internal_base* m_next_T_internal;
}; /* size: 0x0008 */

class phys_free_list<rigid_body_constraint_wheel>
{
  /* 0x0000 */ class phys_free_list<rigid_body_constraint_wheel>::T_internal_base m_dummy_head;
  /* 0x0008 */ int m_list_count;
  /* 0x000c */ int m_list_count_high_water;
  /* 0x0010 */ class rigid_body_constraint_wheel* m_ptr_list[256];
  /* 0x0410 */ int m_ptr_list_count;
}; /* size: 0x0414 */

class phys_free_list<rigid_body_constraint_custom_orientation>::T_internal_base
{
  /* 0x0000 */ class phys_free_list<rigid_body_constraint_custom_orientation>::T_internal_base* m_prev_T_internal;
  /* 0x0004 */ class phys_free_list<rigid_body_constraint_custom_orientation>::T_internal_base* m_next_T_internal;
}; /* size: 0x0008 */

class phys_free_list<rigid_body_constraint_custom_orientation>
{
  /* 0x0000 */ class phys_free_list<rigid_body_constraint_custom_orientation>::T_internal_base m_dummy_head;
  /* 0x0008 */ int m_list_count;
  /* 0x000c */ int m_list_count_high_water;
  /* 0x0010 */ class rigid_body_constraint_custom_orientation* m_ptr_list[256];
  /* 0x0410 */ int m_ptr_list_count;
}; /* size: 0x0414 */

class phys_free_list<rigid_body_constraint_custom_path>::T_internal_base
{
  /* 0x0000 */ class phys_free_list<rigid_body_constraint_custom_path>::T_internal_base* m_prev_T_internal;
  /* 0x0004 */ class phys_free_list<rigid_body_constraint_custom_path>::T_internal_base* m_next_T_internal;
}; /* size: 0x0008 */

class phys_free_list<rigid_body_constraint_custom_path>
{
  /* 0x0000 */ class phys_free_list<rigid_body_constraint_custom_path>::T_internal_base m_dummy_head;
  /* 0x0008 */ int m_list_count;
  /* 0x000c */ int m_list_count_high_water;
  /* 0x0010 */ class rigid_body_constraint_custom_path* m_ptr_list[256];
  /* 0x0410 */ int m_ptr_list_count;
}; /* size: 0x0414 */

class phys_free_list<rigid_body_constraint_angular_actuator>::T_internal_base
{
  /* 0x0000 */ class phys_free_list<rigid_body_constraint_angular_actuator>::T_internal_base* m_prev_T_internal;
  /* 0x0004 */ class phys_free_list<rigid_body_constraint_angular_actuator>::T_internal_base* m_next_T_internal;
}; /* size: 0x0008 */

class phys_free_list<rigid_body_constraint_angular_actuator>
{
  /* 0x0000 */ class phys_free_list<rigid_body_constraint_angular_actuator>::T_internal_base m_dummy_head;
  /* 0x0008 */ int m_list_count;
  /* 0x000c */ int m_list_count_high_water;
  /* 0x0010 */ class rigid_body_constraint_angular_actuator* m_ptr_list[256];
  /* 0x0410 */ int m_ptr_list_count;
}; /* size: 0x0414 */

class phys_free_list<rigid_body_constraint_upright>::T_internal_base
{
  /* 0x0000 */ class phys_free_list<rigid_body_constraint_upright>::T_internal_base* m_prev_T_internal;
  /* 0x0004 */ class phys_free_list<rigid_body_constraint_upright>::T_internal_base* m_next_T_internal;
}; /* size: 0x0008 */

class phys_free_list<rigid_body_constraint_upright>
{
  /* 0x0000 */ class phys_free_list<rigid_body_constraint_upright>::T_internal_base m_dummy_head;
  /* 0x0008 */ int m_list_count;
  /* 0x000c */ int m_list_count_high_water;
  /* 0x0010 */ class rigid_body_constraint_upright* m_ptr_list[256];
  /* 0x0410 */ int m_ptr_list_count;
}; /* size: 0x0414 */

struct minspec_read_write_mutex
{
  /* 0x0000 */ volatile unsigned int m_count;
}; /* size: 0x0004 */

class phys_transient_allocator
{
  /* 0x0000 */ struct phys_transient_allocator::block_header* m_first_block;
  /* 0x0004 */ char* m_cur;
  /* 0x0008 */ char* m_end;
  /* 0x000c */ unsigned int m_total_memory_allocated;
  /* 0x0010 */ struct minspec_read_write_mutex m_mutex;
  /* 0x0014 */ void* m_slot_pool;
}; /* size: 0x0018 */

class physics_system
{
  /* 0x0000 */ int m_flags;
  /* 0x0004 */ float m_outside_sub_delta_t;
  /* 0x0008 */ void* m_collision_callback /* function */;
  /* 0x000c */ float m_max_delta_t;
  /* 0x0010 */ int m_max_vel_iters;
  /* 0x0014 */ int m_max_vel_pos_iters;
  /* 0x0018 */ long Padding_24[2];
  /* 0x0020 */ class environment_rigid_body m_environment_rigid_body;
  /* 0x0180 */ class phys_inplace_avl_tree<rigid_body_pair_key,rigid_body_constraint_contact,rigid_body_constraint_contact::avl_tree_accessor> m_search_tree_rbc_contact;
  /* 0x0184 */ class phys_free_list<user_rigid_body> m_list_user_rigid_body;
  /* 0x0598 */ class phys_free_list<rigid_body> m_list_rigid_body;
  /* 0x09ac */ class phys_free_list<rigid_body_constraint_contact> m_list_rbc_contact;
  /* 0x0dc0 */ class phys_free_list<rigid_body_constraint_point> m_list_rbc_point;
  /* 0x11d4 */ class phys_free_list<rigid_body_constraint_hinge> m_list_rbc_hinge;
  /* 0x15e8 */ class phys_free_list<rigid_body_constraint_distance> m_list_rbc_dist;
  /* 0x19fc */ class phys_free_list<rigid_body_constraint_ragdoll> m_list_rbc_ragdoll;
  /* 0x1e10 */ class phys_free_list<rigid_body_constraint_wheel> m_list_rbc_wheel;
  /* 0x2224 */ class phys_free_list<rigid_body_constraint_custom_orientation> m_list_rbc_custom_orientation;
  /* 0x2638 */ class phys_free_list<rigid_body_constraint_custom_path> m_list_rbc_custom_path;
  /* 0x2a4c */ class phys_free_list<rigid_body_constraint_angular_actuator> m_list_rbc_angular_actuator;
  /* 0x2e60 */ class phys_free_list<rigid_body_constraint_upright> m_list_rbc_upright;
  /* 0x3274 */ class phys_transient_allocator m_contact_point_buffer_1;
  /* 0x328c */ class phys_transient_allocator m_contact_point_buffer_2;
  /* 0x32a4 */ class rigid_body** m_list_island;
  /* 0x32a8 */ int m_list_island_count;
  /* 0x32ac */ int m_solver_memory_high_water;
  /* 0x32b0 */ int m_contact_point_buffer_high_water;
}; /* size: 0x32c0 */

typedef enum _MINIDUMP_TYPE
{
  MiniDumpNormal = 0,
  MiniDumpWithDataSegs = 1,
  MiniDumpWithFullMemory = 2,
  MiniDumpWithHandleData = 4,
  MiniDumpFilterMemory = 8,
  MiniDumpScanMemory = 16,
  MiniDumpWithUnloadedModules = 32,
  MiniDumpWithIndirectlyReferencedMemory = 64,
  MiniDumpFilterModulePaths = 128,
  MiniDumpWithProcessThreadData = 256,
  MiniDumpWithPrivateReadWriteMemory = 512,
  MiniDumpWithoutOptionalData = 1024,
  MiniDumpWithFullMemoryInfo = 2048,
  MiniDumpWithThreadInfo = 4096,
  MiniDumpWithCodeSegs = 8192,
  MiniDumpWithoutAuxiliaryState = 16384,
  MiniDumpWithFullAuxiliaryState = 0xffff8000,
  MiniDumpWithPrivateWriteCopyMemory = 0x10000,
  MiniDumpIgnoreInaccessibleMemory = 0x20000,
  MiniDumpWithTokenInformation = 0x40000,
  MiniDumpValidTypeFlags = 0x7ffff,
} MINIDUMP_TYPE, *PMINIDUMP_TYPE;

typedef enum _TAG_UNNAMED_43
{
  DSKEL_CREATE_INC = 32,
} TAG_UNNAMED_43, *PTAG_UNNAMED_43;

typedef enum _NVAPI_MODULE_ID
{
  NVAPI_MODULE_GPU = 0,
  NVAPI_MODULE_PEP = 1,
} NVAPI_MODULE_ID, *PNVAPI_MODULE_ID;

enum eAttachmentOverrideEffects
{
  ATTACHMENT_OVERRIDE_EFFECT_VIEW_FLASH = 0,
  ATTACHMENT_OVERRIDE_EFFECT_WORLD_FLASH = 1,
  NUM_ATTACHMENT_OVERRIDE_EFFECTS = 2,
};

typedef enum _TAG_UNNAMED_44
{
  FX_STATUS2_NO_RESTART_ON_REWIND = 1,
  FX_STATUS2_OFFSCREEN_SPAWN = 4,
  FX_STATUS2_OFFSCREEN_RETRIGGER = 8,
} TAG_UNNAMED_44, *PTAG_UNNAMED_44;

struct SndOverlayInfo
{
  /* 0x0000 */ char pszSampleName[128];
  /* 0x0080 */ char name[64];
  /* 0x00c0 */ char spatial[8];
  /* 0x00c8 */ int channel;
  /* 0x00cc */ float fGlobalPriority;
  /* 0x00d0 */ float fLosOcclusion;
  /* 0x00d4 */ float fDry;
  /* 0x00d8 */ float fWet;
  /* 0x00dc */ float fDistance;
  /* 0x00e0 */ float fPitch;
  /* 0x00e4 */ int iEntity;
  /* 0x00e8 */ int group;
  /* 0x00ec */ int pan;
  /* 0x00f0 */ __int64 played;
  /* 0x00f8 */ int bus;
  /* 0x00fc */ int duckGroup;
}; /* size: 0x0100 */

enum bdTencentAASRecord::bdRecordStatus
{
  PENDING = 0,
  NOINFO = 1,
  MINOR = 2,
  ADULT = 3,
};

class bdTencentAASRecord
{
  /* 0x0000 */ long Padding_25[2];
  /* 0x0008 */ unsigned __int64 m_userID;
  /* 0x0010 */ enum bdTencentAASRecord::bdRecordStatus m_ageStatus;
  /* 0x0014 */ unsigned int m_gameplaySeconds;
  /* 0x0018 */ unsigned int m_recordAge;
}; /* size: 0x0020 */

typedef enum _TAG_UNNAMED_45
{
  TRACK_LOCATION_MRAM = 0,
  TRACK_LOCATION_LRAM = 1,
  TRACK_LOCATION_COUNT = 2,
} TAG_UNNAMED_45, *PTAG_UNNAMED_45;

struct MaterialArgumentCodeConst
{
  /* 0x0000 */ unsigned short index;
  /* 0x0002 */ unsigned char firstRow;
  /* 0x0003 */ unsigned char rowCount;
}; /* size: 0x0004 */

union MaterialArgumentDef
{
  union
  {
    /* 0x0000 */ const float* literalConst;
    /* 0x0000 */ struct MaterialArgumentCodeConst codeConst;
    /* 0x0000 */ unsigned int codeSampler;
    /* 0x0000 */ unsigned int nameHash;
  }; /* size: 0x0004 */
}; /* size: 0x0004 */

enum he_type_t
{
  HE_TYPE_FREE = 0,
  HE_TYPE_TEXT = 1,
  HE_TYPE_VALUE = 2,
  HE_TYPE_PLAYERNAME = 3,
  HE_TYPE_MAPNAME = 4,
  HE_TYPE_GAMETYPE = 5,
  HE_TYPE_DAMAGE_INDICATOR = 6,
  HE_TYPE_SCORE = 7,
  HE_TYPE_MATERIAL = 8,
  HE_TYPE_TIMER_DOWN = 9,
  HE_TYPE_TIMER_UP = 10,
  HE_TYPE_TENTHS_TIMER_DOWN = 11,
  HE_TYPE_TENTHS_TIMER_UP = 12,
  HE_TYPE_CLOCK_DOWN = 13,
  HE_TYPE_CLOCK_UP = 14,
  HE_TYPE_WAYPOINT = 15,
  HE_TYPE_PERKS = 16,
  HE_TYPE_COUNT = 17,
};

typedef struct _LIST_ENTRY
{
  /* 0x0000 */ struct _LIST_ENTRY* Flink;
  /* 0x0004 */ struct _LIST_ENTRY* Blink;
} LIST_ENTRY, *PLIST_ENTRY; /* size: 0x0008 */

typedef struct _RTL_CRITICAL_SECTION_DEBUG
{
  /* 0x0000 */ unsigned short Type;
  /* 0x0002 */ unsigned short CreatorBackTraceIndex;
  /* 0x0004 */ struct _RTL_CRITICAL_SECTION* CriticalSection;
  /* 0x0008 */ struct _LIST_ENTRY ProcessLocksList;
  /* 0x0010 */ unsigned long EntryCount;
  /* 0x0014 */ unsigned long ContentionCount;
  /* 0x0018 */ unsigned long Flags;
  /* 0x001c */ unsigned short CreatorBackTraceIndexHigh;
  /* 0x001e */ unsigned short SpareWORD;
} RTL_CRITICAL_SECTION_DEBUG, *PRTL_CRITICAL_SECTION_DEBUG; /* size: 0x0020 */

typedef enum _TAG_UNNAMED_46
{
  PM_WATER_LEVEL_NONE = 0,
  PM_WATER_LEVEL_SHALLOW = 1,
  PM_WATER_LEVEL_WAIST = 2,
  PM_WATER_LEVEL_CHEST = 3,
  PM_WATER_LEVEL_SWIM = 4,
  PM_WATER_LEVEL_DEEP = 5,
  PM_WATER_LEVEL_UNDER_WATER = 6,
  PM_WATER_LEVEL_COUNT = 7,
} TAG_UNNAMED_46, *PTAG_UNNAMED_46;

enum combatRecordMedalCategories_t
{
  CATEGORY_NONE = 0,
  CATEGORY_COMBAT = 1,
  CATEGORY_SCORESTREAKS = 2,
  CATEGORY_ANTISCORESTREAKS = 3,
  CATEGORY_GAMEMODES = 4,
  CATEGORY_COUNT = 5,
};

enum DXGI_FORMAT
{
  DXGI_FORMAT_UNKNOWN = 0,
  DXGI_FORMAT_R32G32B32A32_TYPELESS = 1,
  DXGI_FORMAT_R32G32B32A32_FLOAT = 2,
  DXGI_FORMAT_R32G32B32A32_UINT = 3,
  DXGI_FORMAT_R32G32B32A32_SINT = 4,
  DXGI_FORMAT_R32G32B32_TYPELESS = 5,
  DXGI_FORMAT_R32G32B32_FLOAT = 6,
  DXGI_FORMAT_R32G32B32_UINT = 7,
  DXGI_FORMAT_R32G32B32_SINT = 8,
  DXGI_FORMAT_R16G16B16A16_TYPELESS = 9,
  DXGI_FORMAT_R16G16B16A16_FLOAT = 10,
  DXGI_FORMAT_R16G16B16A16_UNORM = 11,
  DXGI_FORMAT_R16G16B16A16_UINT = 12,
  DXGI_FORMAT_R16G16B16A16_SNORM = 13,
  DXGI_FORMAT_R16G16B16A16_SINT = 14,
  DXGI_FORMAT_R32G32_TYPELESS = 15,
  DXGI_FORMAT_R32G32_FLOAT = 16,
  DXGI_FORMAT_R32G32_UINT = 17,
  DXGI_FORMAT_R32G32_SINT = 18,
  DXGI_FORMAT_R32G8X24_TYPELESS = 19,
  DXGI_FORMAT_D32_FLOAT_S8X24_UINT = 20,
  DXGI_FORMAT_R32_FLOAT_X8X24_TYPELESS = 21,
  DXGI_FORMAT_X32_TYPELESS_G8X24_UINT = 22,
  DXGI_FORMAT_R10G10B10A2_TYPELESS = 23,
  DXGI_FORMAT_R10G10B10A2_UNORM = 24,
  DXGI_FORMAT_R10G10B10A2_UINT = 25,
  DXGI_FORMAT_R11G11B10_FLOAT = 26,
  DXGI_FORMAT_R8G8B8A8_TYPELESS = 27,
  DXGI_FORMAT_R8G8B8A8_UNORM = 28,
  DXGI_FORMAT_R8G8B8A8_UNORM_SRGB = 29,
  DXGI_FORMAT_R8G8B8A8_UINT = 30,
  DXGI_FORMAT_R8G8B8A8_SNORM = 31,
  DXGI_FORMAT_R8G8B8A8_SINT = 32,
  DXGI_FORMAT_R16G16_TYPELESS = 33,
  DXGI_FORMAT_R16G16_FLOAT = 34,
  DXGI_FORMAT_R16G16_UNORM = 35,
  DXGI_FORMAT_R16G16_UINT = 36,
  DXGI_FORMAT_R16G16_SNORM = 37,
  DXGI_FORMAT_R16G16_SINT = 38,
  DXGI_FORMAT_R32_TYPELESS = 39,
  DXGI_FORMAT_D32_FLOAT = 40,
  DXGI_FORMAT_R32_FLOAT = 41,
  DXGI_FORMAT_R32_UINT = 42,
  DXGI_FORMAT_R32_SINT = 43,
  DXGI_FORMAT_R24G8_TYPELESS = 44,
  DXGI_FORMAT_D24_UNORM_S8_UINT = 45,
  DXGI_FORMAT_R24_UNORM_X8_TYPELESS = 46,
  DXGI_FORMAT_X24_TYPELESS_G8_UINT = 47,
  DXGI_FORMAT_R8G8_TYPELESS = 48,
  DXGI_FORMAT_R8G8_UNORM = 49,
  DXGI_FORMAT_R8G8_UINT = 50,
  DXGI_FORMAT_R8G8_SNORM = 51,
  DXGI_FORMAT_R8G8_SINT = 52,
  DXGI_FORMAT_R16_TYPELESS = 53,
  DXGI_FORMAT_R16_FLOAT = 54,
  DXGI_FORMAT_D16_UNORM = 55,
  DXGI_FORMAT_R16_UNORM = 56,
  DXGI_FORMAT_R16_UINT = 57,
  DXGI_FORMAT_R16_SNORM = 58,
  DXGI_FORMAT_R16_SINT = 59,
  DXGI_FORMAT_R8_TYPELESS = 60,
  DXGI_FORMAT_R8_UNORM = 61,
  DXGI_FORMAT_R8_UINT = 62,
  DXGI_FORMAT_R8_SNORM = 63,
  DXGI_FORMAT_R8_SINT = 64,
  DXGI_FORMAT_A8_UNORM = 65,
  DXGI_FORMAT_R1_UNORM = 66,
  DXGI_FORMAT_R9G9B9E5_SHAREDEXP = 67,
  DXGI_FORMAT_R8G8_B8G8_UNORM = 68,
  DXGI_FORMAT_G8R8_G8B8_UNORM = 69,
  DXGI_FORMAT_BC1_TYPELESS = 70,
  DXGI_FORMAT_BC1_UNORM = 71,
  DXGI_FORMAT_BC1_UNORM_SRGB = 72,
  DXGI_FORMAT_BC2_TYPELESS = 73,
  DXGI_FORMAT_BC2_UNORM = 74,
  DXGI_FORMAT_BC2_UNORM_SRGB = 75,
  DXGI_FORMAT_BC3_TYPELESS = 76,
  DXGI_FORMAT_BC3_UNORM = 77,
  DXGI_FORMAT_BC3_UNORM_SRGB = 78,
  DXGI_FORMAT_BC4_TYPELESS = 79,
  DXGI_FORMAT_BC4_UNORM = 80,
  DXGI_FORMAT_BC4_SNORM = 81,
  DXGI_FORMAT_BC5_TYPELESS = 82,
  DXGI_FORMAT_BC5_UNORM = 83,
  DXGI_FORMAT_BC5_SNORM = 84,
  DXGI_FORMAT_B5G6R5_UNORM = 85,
  DXGI_FORMAT_B5G5R5A1_UNORM = 86,
  DXGI_FORMAT_B8G8R8A8_UNORM = 87,
  DXGI_FORMAT_B8G8R8X8_UNORM = 88,
  DXGI_FORMAT_R10G10B10_XR_BIAS_A2_UNORM = 89,
  DXGI_FORMAT_B8G8R8A8_TYPELESS = 90,
  DXGI_FORMAT_B8G8R8A8_UNORM_SRGB = 91,
  DXGI_FORMAT_B8G8R8X8_TYPELESS = 92,
  DXGI_FORMAT_B8G8R8X8_UNORM_SRGB = 93,
  DXGI_FORMAT_BC6H_TYPELESS = 94,
  DXGI_FORMAT_BC6H_UF16 = 95,
  DXGI_FORMAT_BC6H_SF16 = 96,
  DXGI_FORMAT_BC7_TYPELESS = 97,
  DXGI_FORMAT_BC7_UNORM = 98,
  DXGI_FORMAT_BC7_UNORM_SRGB = 99,
  DXGI_FORMAT_FORCE_UINT = -1,
};

enum D3D10_DEPTH_WRITE_MASK
{
};

enum clientlsg_t
{
  CLIENT_LSG_DEV = 0,
  CLIENT_LSG_CERT = 1,
  CLIENT_LSG_LIVE = 2,
  MAX_CLIENT_LSGS = 3,
};

enum tagTYSPEC
{
  TYSPEC_CLSID = 0,
  TYSPEC_FILEEXT = 1,
  TYSPEC_MIMETYPE = 2,
  TYSPEC_FILENAME = 3,
  TYSPEC_PROGID = 4,
  TYSPEC_PACKAGENAME = 5,
  TYSPEC_OBJECTID = 6,
};

union vec4_t
{
  union
  {
    /* 0x0000 */ float v[4];
    struct
    {
      /* 0x0000 */ float x;
      /* 0x0004 */ float y;
      /* 0x0008 */ float z;
      /* 0x000c */ float w;
    }; /* size: 0x0010 */
    struct
    {
      /* 0x0000 */ float r;
      /* 0x0004 */ float g;
      /* 0x0008 */ float b;
      /* 0x000c */ float a;
    }; /* size: 0x0010 */
  }; /* size: 0x0010 */
}; /* size: 0x0010 */

struct blend_ent_t
{
  /* 0x0000 */ union vec3_t pos;
  /* 0x000c */ union vec3_t vel;
  /* 0x0018 */ union vec4_t viewQuat;
  /* 0x0028 */ BOOL changed;
  /* 0x0029 */ char Padding_26[3];
  /* 0x002c */ float posAccelTime;
  /* 0x0030 */ float posDecelTime;
  /* 0x0034 */ float angleAccelTime;
  /* 0x0038 */ float angleDecelTime;
  /* 0x003c */ float startTime;
  /* 0x0040 */ float posTotalTime;
  /* 0x0044 */ float angleTotalTime;
}; /* size: 0x0048 */

class bdRunnable
{
  /* 0x0000 */ long Padding_27;
  /* 0x0004 */ BOOL m_stop;
}; /* size: 0x0008 */

enum std::float_round_style
{
  round_indeterminate = -1,
  round_toward_zero = 0,
  round_to_nearest = 1,
  round_toward_infinity = 2,
  round_toward_neg_infinity = 3,
};

typedef struct _XMUSHORTN4
{
  /* 0x0000 */ unsigned short x;
  /* 0x0002 */ unsigned short y;
  /* 0x0004 */ unsigned short z;
  /* 0x0006 */ unsigned short w;
} XMUSHORTN4, *PXMUSHORTN4; /* size: 0x0008 */

typedef enum _D3D_SHADER_INPUT_FLAGS
{
  D3D_SIF_USERPACKED = 1,
  D3D_SIF_COMPARISON_SAMPLER = 2,
  D3D_SIF_TEXTURE_COMPONENT_0 = 4,
  D3D_SIF_TEXTURE_COMPONENT_1 = 8,
  D3D_SIF_TEXTURE_COMPONENTS = 12,
  D3D10_SIF_USERPACKED = 1,
  D3D10_SIF_COMPARISON_SAMPLER = 2,
  D3D10_SIF_TEXTURE_COMPONENT_0 = 4,
  D3D10_SIF_TEXTURE_COMPONENT_1 = 8,
  D3D10_SIF_TEXTURE_COMPONENTS = 12,
  D3D_SIF_FORCE_DWORD = 0x7fffffff,
} D3D_SHADER_INPUT_FLAGS, *PD3D_SHADER_INPUT_FLAGS;

typedef enum _NVAPI_SURFACE_LAYOUT
{
  NVAPI_SURFACE_LAYOUT_BL = 0,
  NVAPI_SURFACE_LAYOUT_PL = 1,
  NVAPI_SURFACE_LAYOUT_TILED = 2,
} NVAPI_SURFACE_LAYOUT, *PNVAPI_SURFACE_LAYOUT;

enum BindIndex_t
{
  BIND_INDEX_PLAYER = 0,
  BIND_INDEX_START = 0,
  BIND_INDEX_VEHICLE = 1,
  BIND_INDEX_COUNT = 2,
};

enum eAutoMeleeState
{
  AMS_NOT_ACTIVE = 0,
  AIM_MELEE_STATE_TARGETED = 1,
  AIM_MELEE_STATE_UPDATING = 2,
};

class bdLobbyEventHandler
{
}; /* size: 0x0004 */

enum eGameModes
{
  GAMEMODE_PUBLIC_MATCH = 0,
  GAMEMODE_PRIVATE_MATCH = 1,
  GAMEMODE_LOCAL_SPLITSCREEN = 2,
  GAMEMODE_WAGER_MATCH = 3,
  GAMEMODE_BASIC_TRAINING = 4,
  GAMEMODE_THEATER = 5,
  GAMEMODE_LEAGUE_MATCH = 6,
  GAMEMODE_RTS = 7,
  GAMEMODE_MAX = 8,
  INVALID_GAMEMODE = 9,
};

typedef enum _TAG_UNNAMED_47
{
  CAMERA_REGION_LIT_OPAQUE = 0,
  CAMERA_REGION_LIT_TRANS = 1,
  CAMERA_REGION_LIT_QUASI_OPAQUE = 2,
  CAMERA_REGION_EMISSIVE_OPAQUE = 3,
  CAMERA_REGION_EMISSIVE_TRANS = 4,
  CAMERA_REGION_EMISSIVE_FX = 5,
  CAMERA_REGION_LIGHT_MAP_OPAQUE = 6,
  CAMERA_REGION_DEPTH_HACK = 7,
  CAMERA_REGION_UNUSED = 8,
  CAMERA_REGION_SONAR = 9,
  CAMERA_REGION_COUNT = 10,
  CAMERA_REGION_NONE = 10,
} TAG_UNNAMED_47, *PTAG_UNNAMED_47;

enum DEFAULTSAVEFOLDERTYPE
{
  DSFT_DETECT = 1,
  DSFT_PRIVATE = 2,
  DSFT_PUBLIC = 3,
};

typedef enum _D3D_SHADER_INPUT_TYPE
{
  D3D_SIT_CBUFFER = 0,
  D3D_SIT_TBUFFER = 1,
  D3D_SIT_TEXTURE = 2,
  D3D_SIT_SAMPLER = 3,
  D3D_SIT_UAV_RWTYPED = 4,
  D3D_SIT_STRUCTURED = 5,
  D3D_SIT_UAV_RWSTRUCTURED = 6,
  D3D_SIT_BYTEADDRESS = 7,
  D3D_SIT_UAV_RWBYTEADDRESS = 8,
  D3D_SIT_UAV_APPEND_STRUCTURED = 9,
  D3D_SIT_UAV_CONSUME_STRUCTURED = 10,
  D3D_SIT_UAV_RWSTRUCTURED_WITH_COUNTER = 11,
  D3D10_SIT_CBUFFER = 0,
  D3D10_SIT_TBUFFER = 1,
  D3D10_SIT_TEXTURE = 2,
  D3D10_SIT_SAMPLER = 3,
  D3D11_SIT_UAV_RWTYPED = 4,
  D3D11_SIT_STRUCTURED = 5,
  D3D11_SIT_UAV_RWSTRUCTURED = 6,
  D3D11_SIT_BYTEADDRESS = 7,
  D3D11_SIT_UAV_RWBYTEADDRESS = 8,
  D3D11_SIT_UAV_APPEND_STRUCTURED = 9,
  D3D11_SIT_UAV_CONSUME_STRUCTURED = 10,
  D3D11_SIT_UAV_RWSTRUCTURED_WITH_COUNTER = 11,
} D3D_SHADER_INPUT_TYPE, *PD3D_SHADER_INPUT_TYPE;

enum NV_GPS_PS_STATUS
{
  NV_GPS_PS_DISABLED = 0,
  NV_GPS_PS_ENABLED = 1,
  NV_GPS_PS_NOT_SUPPORTED = 2,
};

enum loadoutClass_t
{
  CLASS_INVALID = -1,
  CUSTOM_CLASS_1 = 0,
  CUSTOM_CLASS_FIRST = 0,
  CUSTOM_CLASS_2 = 1,
  CUSTOM_CLASS_3 = 2,
  CUSTOM_CLASS_4 = 3,
  CUSTOM_CLASS_5 = 4,
  BASIC_CUSTOM_CLASS_COUNT = 5,
  CUSTOM_CLASS_6 = 5,
  CUSTOM_CLASS_7 = 6,
  CUSTOM_CLASS_8 = 7,
  CUSTOM_CLASS_9 = 8,
  CUSTOM_CLASS_10 = 9,
  CUSTOM_CLASS_COUNT = 10,
  DEFAULT_CLASS_FIRST = 10,
  DEFAULT_CLASS_SMG = 10,
  DEFAULT_CLASS_CQB = 11,
  DEFAULT_CLASS_ASSAULT = 12,
  DEFAULT_CLASS_LMG = 13,
  DEFAULT_CLASS_SNIPER = 14,
  DEFAULT_CLASS_LAST = 14,
  TOTAL_CLASS_COUNT = 15,
};

union GfxTexture
{
  union
  {
    /* 0x0000 */ struct ID3D11ShaderResourceView* basemap;
    /* 0x0000 */ struct GfxImageLoadDef* loadDef;
  }; /* size: 0x0004 */
}; /* size: 0x0004 */

struct Picmip
{
  /* 0x0000 */ unsigned char platform[2];
}; /* size: 0x0002 */

struct CardMemory
{
  /* 0x0000 */ int platform[2];
}; /* size: 0x0008 */

struct GfxImage
{
  /* 0x0000 */ union GfxTexture texture;
  /* 0x0004 */ unsigned char mapType;
  /* 0x0005 */ unsigned char semantic;
  /* 0x0006 */ unsigned char category;
  /* 0x0007 */ BOOL delayLoadPixels;
  /* 0x0008 */ struct Picmip picmip;
  /* 0x000a */ BOOL noPicmip;
  /* 0x000b */ unsigned char track;
  /* 0x000c */ struct CardMemory cardMemory;
  /* 0x0014 */ unsigned short width;
  /* 0x0016 */ unsigned short height;
  /* 0x0018 */ unsigned short depth;
  /* 0x001a */ unsigned char levelCount;
  /* 0x001b */ unsigned char streaming;
  /* 0x001c */ unsigned int baseSize;
  /* 0x0020 */ unsigned char* pixels;
  /* 0x0024 */ struct GfxStreamedPartInfo streamedParts[1];
  /* 0x003c */ unsigned char streamedPartCount;
  /* 0x003d */ char Padding_28[3];
  /* 0x0040 */ unsigned int loadedSize;
  /* 0x0044 */ unsigned char skippedMipLevels;
  /* 0x0045 */ char Padding_29[3];
  /* 0x0048 */ const char* name;
  /* 0x004c */ unsigned int hash;
}; /* size: 0x0050 */

class pulse_sum_point
{
  /* 0x0000 */ long Padding_30[4];
  /* 0x0010 */ class phys_vec3 m_b1_r;
  /* 0x0020 */ class phys_vec3 m_b2_r;
  /* 0x0030 */ class phys_vec3 m_b1_apx;
  /* 0x0040 */ class phys_vec3 m_b2_apx;
  /* 0x0050 */ class phys_vec3 m_b1_apy;
  /* 0x0060 */ class phys_vec3 m_b2_apy;
  /* 0x0070 */ class phys_vec3 m_b1_apz;
  /* 0x0080 */ class phys_vec3 m_b2_apz;
  /* 0x0090 */ class phys_vec3 m_pulse_sum;
  /* 0x00a0 */ class phys_vec3 m_right_side;
  /* 0x00b0 */ class phys_vec3 m_big_dirt;
  /* 0x00c0 */ class phys_vec3 m_cr23;
  /* 0x00d0 */ class phys_vec3 m_cr31;
  /* 0x00e0 */ class phys_vec3 m_cr12;
  /* 0x00f0 */ class phys_vec3 m_denom;
  /* 0x0100 */ float m_cfm;
  /* 0x0104 */ class pulse_sum_node* m_b1;
  /* 0x0108 */ class pulse_sum_node* m_b2;
  /* 0x010c */ class pulse_sum_cache* m_pulse_sum_cache;
}; /* size: 0x0110 */

class bdSecurityID
{
  /* 0x0000 */ unsigned char ab[8];
}; /* size: 0x0008 */

struct XNADDR
{
  /* 0x0000 */ unsigned char addrBuff[37];
}; /* size: 0x0025 */

class bdSecurityKey
{
  /* 0x0000 */ unsigned char ab[16];
}; /* size: 0x0010 */

struct XSESSION_INFO
{
  /* 0x0000 */ class bdSecurityID sessionID;
  /* 0x0008 */ struct XNADDR hostAddress;
  /* 0x002d */ class bdSecurityKey keyExchangeKey;
}; /* size: 0x003d */

enum netadrtype_t
{
  NA_BOT = 0,
  NA_BAD = 1,
  NA_LOOPBACK = 2,
  NA_BROADCAST = 3,
  NA_IP = 4,
};

enum netsrc_t
{
  NS_NULL = -1,
  NS_CLIENT1 = 0,
  NS_CLIENT2 = 1,
  NS_CLIENT3 = 2,
  NS_CLIENT4 = 3,
  NS_SERVER = 4,
  NS_MAXCLIENTS = 4,
  NS_PACKET = 5,
};

struct netadr_t
{
  union
  {
    /* 0x0000 */ unsigned char ip[4];
    /* 0x0000 */ unsigned int inaddr;
  }; /* size: 0x0004 */
  /* 0x0004 */ unsigned short port;
  /* 0x0006 */ char Padding_31[2];
  /* 0x0008 */ enum netadrtype_t type;
  /* 0x000c */ enum netsrc_t localNetID;
  /* 0x0010 */ unsigned short serverID;
  /* 0x0012 */ char __PADDING__[2];
}; /* size: 0x0014 */

struct ClientInfo
{
  /* 0x0000 */ BOOL registered;
  /* 0x0001 */ BOOL voiceRegistered;
  /* 0x0002 */ char Padding_32[6];
  /* 0x0008 */ unsigned __int64 xuid;
  /* 0x0010 */ int natType;
  /* 0x0014 */ struct netadr_t addr;
  /* 0x0028 */ int voiceConnectivityBits;
  /* 0x002c */ int lastConnectivityTestTime[1];
  /* 0x0030 */ BOOL friends;
  /* 0x0031 */ char Padding_33[3];
  /* 0x0034 */ int flags;
  /* 0x0038 */ BOOL muted;
  /* 0x0039 */ char Padding_34[3];
  /* 0x003c */ int performanceValue;
  /* 0x0040 */ BOOL privateSlot;
  /* 0x0041 */ char __PADDING__[7];
}; /* size: 0x0048 */

enum ControllerIndex_t
{
  INVALID_CONTROLLER_PORT = -1,
  CONTROLLER_INDEX_FIRST = 0,
  CONTROLLER_INDEX_0 = 0,
  CONTROLLER_INDEX_COUNT = 1,
};

struct RegisteredUser
{
  /* 0x0000 */ BOOL active;
  /* 0x0001 */ char Padding_35[7];
  /* 0x0008 */ unsigned __int64 xuid;
  /* 0x0010 */ BOOL privateSlot;
  /* 0x0011 */ char Padding_36[3];
  /* 0x0014 */ int performanceValue;
}; /* size: 0x0018 */

struct SessionDynamicData
{
  /* 0x0000 */ BOOL sessionHandle;
  /* 0x0001 */ struct XSESSION_INFO sessionInfo;
  /* 0x003e */ BOOL keysGenerated;
  /* 0x003f */ BOOL sessionStartCalled;
  /* 0x0040 */ unsigned __int64 sessionNonce;
  /* 0x0048 */ int privateSlots;
  /* 0x004c */ int publicSlots;
  /* 0x0050 */ int flags;
  /* 0x0054 */ BOOL qosListenEnabled;
  /* 0x0055 */ char Padding_37[3];
  /* 0x0058 */ struct ClientInfo users[19];
  /* 0x05b0 */ enum ControllerIndex_t sessionCreateController;
  /* 0x05b4 */ int sessionDeleteTime;
  /* 0x05b8 */ int actualPublicSlots;
  /* 0x05bc */ int voiceConnectivityBits;
  /* 0x05c0 */ struct RegisteredUser internalRegisteredUsers[19];
}; /* size: 0x0788 */

enum weapPositionAnimNum_t
{
  WEAPPOS_HIP_TO_ADS = 0,
  WEAPPOS_ADS_TO_HIP = 1,
  NUM_WEAPPOS_ANIMS = 2,
};

class bdReference<bdByteBuffer>
{
  /* 0x0000 */ class bdByteBuffer* m_ptr;
}; /* size: 0x0004 */

class bdBoolResult
{
  /* 0x0000 */ long Padding_38;
  /* 0x0004 */ BOOL m_result;
}; /* size: 0x0008 */

struct zbarrier_piece_t
{
  /* 0x0000 */ unsigned char state;
  /* 0x0001 */ unsigned char scalar;
  /* 0x0002 */ unsigned char nextState;
  /* 0x0003 */ char Padding_39;
  /* 0x0004 */ int startTime;
}; /* size: 0x0008 */

enum XAUDIO2_WINDOWS_PROCESSOR_SPECIFIER
{
  Processor1 = 1,
  Processor2 = 2,
  Processor3 = 4,
  Processor4 = 8,
  Processor5 = 16,
  Processor6 = 32,
  Processor7 = 64,
  Processor8 = 128,
  Processor9 = 256,
  Processor10 = 512,
  Processor11 = 1024,
  Processor12 = 2048,
  Processor13 = 4096,
  Processor14 = 8192,
  Processor15 = 16384,
  Processor16 = 0xffff8000,
  Processor17 = 0x10000,
  Processor18 = 0x20000,
  Processor19 = 0x40000,
  Processor20 = 0x80000,
  Processor21 = 0x100000,
  Processor22 = 0x200000,
  Processor23 = 0x400000,
  Processor24 = 0x800000,
  Processor25 = 0x1000000,
  Processor26 = 0x2000000,
  Processor27 = 0x4000000,
  Processor28 = 0x8000000,
  Processor29 = 0x10000000,
  Processor30 = 0x20000000,
  Processor31 = 0x40000000,
  Processor32 = -2147483648,
  XAUDIO2_ANY_PROCESSOR = -1,
  XAUDIO2_DEFAULT_PROCESSOR = -1,
};

enum consoleChannel_e
{
  CON_CHANNEL_DONT_FILTER = 0,
  CON_CHANNEL_ERROR = 1,
  CON_CHANNEL_GAMENOTIFY = 2,
  CON_CHANNEL_BOLDGAME = 3,
  CON_CHANNEL_OBJNOTIFY = 4,
  CON_CHANNEL_SUBTITLE = 5,
  CON_CHANNEL_OBITUARY = 6,
  CON_CHANNEL_COOPINFO = 7,
  CON_CHANNEL_LOGFILEONLY = 8,
  CON_CHANNEL_CONSOLEONLY = 9,
  CON_CHANNEL_SYSTEM = 10,
  CON_CHANNEL_NETWORK = 11,
  CON_CHANNEL_TASK = 12,
  CON_CHANNEL_GFX = 13,
  CON_CHANNEL_SOUND = 14,
  CON_CHANNEL_FILES = 15,
  CON_CHANNEL_UI = 16,
  CON_CHANNEL_AI = 17,
  CON_CHANNEL_ANIM = 18,
  CON_CHANNEL_PHYS = 19,
  CON_CHANNEL_FX = 20,
  CON_CHANNEL_SCRIPT = 21,
  CON_CHANNEL_TL = 22,
  CON_CHANNEL_PERFORMANCE = 23,
  CON_CHANNEL_DEVGUI = 24,
  CON_CHANNEL_CLIENT = 25,
  CON_CHANNEL_SERVER = 26,
  CON_CHANNEL_PLAYERWEAP = 27,
  CON_CHANNEL_LIVE = 28,
  CON_CHANNEL_FROMSCRIPT = 29,
  CON_CHANNEL_SPAWNSYSTEM = 30,
  CON_CHANNEL_LEADERBOARDS = 31,
  CON_CHANNEL_DDL = 32,
  CON_CHANNEL_SPU = 33,
  CON_CHANNEL_GAMERPROFILE = 34,
  CON_CHANNEL_PRESENCE = 35,
  CON_CHANNEL_RUMBLE = 36,
  CON_CHANNEL_UNLOCKABLES = 37,
  CON_CHANNEL_VOICE = 38,
  CON_CHANNEL_HTTP = 39,
  CON_CHANNEL_GFWL = 40,
  CON_CHANNEL_IPAK = 41,
  CON_CHANNEL_WEBM = 42,
  CON_CHANNEL_PROBER = 43,
  CON_CHANNEL_MIPSTER = 44,
  CON_CHANNEL_STEAM = 45,
  CON_CHANNEL_SOCIAL = 46,
  CON_CHANNEL_DCACHE = 47,
  CON_CHANNEL_RSTREAM = 48,
  CON_CHANNEL_SCHEDULER = 49,
  CON_CHANNEL_MATCHRECORD = 50,
  CON_CHANNEL_MIGRATE = 51,
  CON_BUILTIN_CHANNEL_COUNT = 52,
  CON_FIRST_DEBUG_CHANNEL = 46,
};

enum D3D10_RESOURCE_DIMENSION
{
};

typedef struct _XMDHENN3
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ int x : 10; /* bit position: 0 */
      /* 0x0000 */ int y : 11; /* bit position: 10 */
      /* 0x0000 */ int z : 11; /* bit position: 21 */
    }; /* bitfield */
    /* 0x0000 */ unsigned int v;
  }; /* size: 0x0004 */
} XMDHENN3, *PXMDHENN3; /* size: 0x0004 */

enum IdentityParam
{
  IDENTITY_ID = 0,
  IDENTITY_TITLE_ID = 1,
  IDENTITY_AUTH_ADDR = 2,
  IDENTITY_LSG_ADDR = 3,
  IDENTITY_DW_KEY = 4,
  IDENTITY_ENVIRONMENT = 5,
  IDENTITY_PLATFORM = 6,
  IDENTITY_PARAM_COUNT = 7,
};

enum WeapAccuracyType
{
  WEAP_ACCURACY_AI_VS_AI = 0,
  WEAP_ACCURACY_AI_VS_PLAYER = 1,
  WEAP_ACCURACY_COUNT = 2,
};

typedef enum _TAG_UNNAMED_48
{
  CF_INVALID = -1,
  CF_WORLDFIELDS = 0,
  CF_ACTORFIELDS = 1,
  CF_VEHICLEFIELDS = 2,
  CF_PLAYERFIELDS_CLIENTSIDE = 3,
  CF_PLAYERFIELDS_SERVERSIDE = 4,
  CF_PLAYERSTATEFIELDS = 5,
  CF_SCRIPTMOVERFIELDS = 6,
  CF_HELICOPTERFIELDS = 7,
  CF_PLANEFIELDS = 8,
  CF_TURRETFIELDS = 9,
  CF_MISSILEFIELDS = 10,
  CF_ZBARRIERFIELDS = 11,
  MAX_CLIENTFIELD_SETS = 12,
} TAG_UNNAMED_48, *PTAG_UNNAMED_48;

enum D3D10_RTV_DIMENSION
{
};

enum D3D11_FILTER
{
  D3D11_FILTER_MIN_MAG_MIP_POINT = 0,
  D3D11_FILTER_MIN_MAG_POINT_MIP_LINEAR = 1,
  D3D11_FILTER_MIN_POINT_MAG_LINEAR_MIP_POINT = 4,
  D3D11_FILTER_MIN_POINT_MAG_MIP_LINEAR = 5,
  D3D11_FILTER_MIN_LINEAR_MAG_MIP_POINT = 16,
  D3D11_FILTER_MIN_LINEAR_MAG_POINT_MIP_LINEAR = 17,
  D3D11_FILTER_MIN_MAG_LINEAR_MIP_POINT = 20,
  D3D11_FILTER_MIN_MAG_MIP_LINEAR = 21,
  D3D11_FILTER_ANISOTROPIC = 85,
  D3D11_FILTER_COMPARISON_MIN_MAG_MIP_POINT = 128,
  D3D11_FILTER_COMPARISON_MIN_MAG_POINT_MIP_LINEAR = 129,
  D3D11_FILTER_COMPARISON_MIN_POINT_MAG_LINEAR_MIP_POINT = 132,
  D3D11_FILTER_COMPARISON_MIN_POINT_MAG_MIP_LINEAR = 133,
  D3D11_FILTER_COMPARISON_MIN_LINEAR_MAG_MIP_POINT = 144,
  D3D11_FILTER_COMPARISON_MIN_LINEAR_MAG_POINT_MIP_LINEAR = 145,
  D3D11_FILTER_COMPARISON_MIN_MAG_LINEAR_MIP_POINT = 148,
  D3D11_FILTER_COMPARISON_MIN_MAG_MIP_LINEAR = 149,
  D3D11_FILTER_COMPARISON_ANISOTROPIC = 213,
};

typedef enum _NVAPI_DITHER_BITS
{
  NVAPI_DITHER_BITS_6BITS = 0,
  NVAPI_DITHER_BITS_8BITS = 1,
} NVAPI_DITHER_BITS, *PNVAPI_DITHER_BITS;

struct CRCscan
{
  /* 0x0000 */ unsigned int goal_crc;
  /* 0x0004 */ int bytes_left;
  /* 0x0008 */ unsigned int crc_so_far;
  /* 0x000c */ int bytes_done;
  /* 0x0010 */ unsigned int sample_loc;
}; /* size: 0x0014 */

typedef enum _TAG_UNNAMED_49
{
  _BUF_SIZE = 8,
} TAG_UNNAMED_49, *PTAG_UNNAMED_49;

typedef enum _TAG_UNNAMED_50
{
  REQUEST_MULTI_LB_READ_COMBAT_RECORD_DATA = 1,
  REQUEST_MULTI_LB_READ_MINI_LBS = 2,
} TAG_UNNAMED_50, *PTAG_UNNAMED_50;

typedef enum _D3D_SHADER_CBUFFER_FLAGS
{
  D3D_CBF_USERPACKED = 1,
  D3D10_CBF_USERPACKED = 1,
  D3D_CBF_FORCE_DWORD = 0x7fffffff,
} D3D_SHADER_CBUFFER_FLAGS, *PD3D_SHADER_CBUFFER_FLAGS;

typedef enum _TAG_UNNAMED_51
{
  CFT_TYPE = 18,
  CFT_NUM = 19,
} TAG_UNNAMED_51, *PTAG_UNNAMED_51;

enum XAnimFlags
{
  XANIM_LOOP_SYNC_TIME = 1,
  XANIM_NONLOOP_SYNC_TIME = 2,
  XANIM_SYNC_ROOT = 4,
  XANIM_COMPLETE = 8,
  XANIM_ADDITIVE = 16,
  XANIM_CLIENT = 32,
  XANIM_SEPARATE = 64,
  XANIM_FORCELOAD = 128,
  XANIM_PROPOGATE_FLAGS = 99,
};

enum weapAnimNumber_t
{
  WEAP_IDLE = 0,
  WEAP_FORCE_IDLE = 1,
  WEAP_ATTACK = 2,
  WEAP_ATTACK_LEFT = 3,
  WEAP_ATTACK_LASTSHOT = 4,
  WEAP_ATTACK_LASTSHOT_LEFT = 5,
  WEAP_RECHAMBER = 6,
  WEAP_ADS_ATTACK = 7,
  WEAP_ADS_ATTACK_LASTSHOT = 8,
  WEAP_ADS_RECHAMBER = 9,
  WEAP_MELEE_ATTACK = 10,
  WEAP_MELEE_ATTACK_EMPTY = 11,
  WEAP_MELEE_CHARGE = 12,
  WEAP_MELEE_CHARGE_EMPTY = 13,
  WEAP_DROP = 14,
  WEAP_RAISE = 15,
  WEAP_FIRST_RAISE = 16,
  WEAP_RELOAD = 17,
  WEAP_RELOAD_EMPTY = 18,
  WEAP_RELOAD_START = 19,
  WEAP_RELOAD_END = 20,
  WEAP_RELOAD_QUICK = 21,
  WEAP_RELOAD_QUICK_EMPTY = 22,
  WEAP_ALTSWITCHFROM = 23,
  WEAP_ALTSWITCHTO = 24,
  WEAP_QUICK_DROP = 25,
  WEAP_QUICK_RAISE = 26,
  WEAP_EMPTY_DROP = 27,
  WEAP_EMPTY_RAISE = 28,
  WEAP_SPRINT_IN = 29,
  WEAP_SPRINT_LOOP = 30,
  WEAP_SPRINT_OUT = 31,
  WEAP_SPRINT_EMPTY_IN = 32,
  WEAP_SPRINT_EMPTY_LOOP = 33,
  WEAP_SPRINT_EMPTY_OUT = 34,
  WEAP_LOWREADY_IN = 35,
  WEAP_LOWREADY_LOOP = 36,
  WEAP_LOWREADY_OUT = 37,
  WEAP_CONT_FIRE_IN = 38,
  WEAP_CONT_FIRE_LOOP = 39,
  WEAP_CONT_FIRE_OUT = 40,
  WEAP_HOLD_FIRE = 41,
  WEAP_DETONATE = 42,
  WEAP_NIGHTVISION_WEAR = 43,
  WEAP_NIGHTVISION_REMOVE = 44,
  WEAP_DEPLOYING = 45,
  WEAP_BREAKING_DOWN = 46,
  WEAP_DTP_IN = 47,
  WEAP_DTP_LOOP = 48,
  WEAP_DTP_OUT = 49,
  WEAP_DTP_EMPTY_IN = 50,
  WEAP_DTP_EMPTY_LOOP = 51,
  WEAP_DTP_EMPTY_OUT = 52,
  WEAP_SLIDE_IN = 53,
  WEAP_MANTLE = 54,
  WEAP_JAM = 55,
  WEAP_CRAWL_IN = 56,
  WEAP_CRAWL_FORWARD = 57,
  WEAP_CRAWL_BACK = 58,
  WEAP_CRAWL_RIGHT = 59,
  WEAP_CRAWL_LEFT = 60,
  WEAP_CRAWL_OUT = 61,
  WEAP_CRAWL_EMPTY_IN = 62,
  WEAP_CRAWL_EMPTY_FORWARD = 63,
  WEAP_CRAWL_EMPTY_BACK = 64,
  WEAP_CRAWL_EMPTY_RIGHT = 65,
  WEAP_CRAWL_EMPTY_LEFT = 66,
  WEAP_CRAWL_EMPTY_OUT = 67,
  MAX_WP_ANIMATIONS = 68,
};

enum typeEnumLB
{
  LB_SERVER = 0,
  LB_OWNERSHIP_PLAYED = 1,
  LB_OWNERSHIP_OWNED = 2,
  LB_OWNERSHIP_DENIED = 3,
};

class bdGroup
{
  /* 0x0000 */ class bdRemoteTaskManager* m_remoteTaskManager;
}; /* size: 0x0004 */

enum itemGroup_t
{
  ITEMGROUP_SMG = 0,
  ITEMGROUP_FIRST = 0,
  ITEMGROUP_ASSAULT = 1,
  ITEMGROUP_CQB = 2,
  ITEMGROUP_LMG = 3,
  ITEMGROUP_SNIPER = 4,
  ITEMGROUP_PISTOL = 5,
  ITEMGROUP_LAUNCHER = 6,
  ITEMGROUP_SPECIAL = 7,
  ITEMGROUP_SHOTGUN = 8,
  ITEMGROUP_EXPLOSIVE = 9,
  ITEMGROUP_GRENADE = 10,
  ITEMGROUP_MASTERKEY = 11,
  ITEMGROUP_GRENADELAUNCHER = 12,
  ITEMGROUP_FLAMETHROWER = 13,
  ITEMGROUP_SPECIALTY = 14,
  ITEMGROUP_SPECIALGRENADE = 15,
  ITEMGROUP_MISCWEAPON = 16,
  ITEMGROUP_FEATURE = 17,
  ITEMGROUP_BONUSCARD = 18,
  ITEMGROUP_GLOBAL_ITEMS_START = 19,
  ITEMGROUP_KILLSTREAK = 19,
  ITEMGROUP_COUNT = 20,
  ITEMGROUP_INVALID = -1,
};

typedef enum _D3D_CBUFFER_TYPE
{
  D3D_CT_CBUFFER = 0,
  D3D_CT_TBUFFER = 1,
  D3D_CT_INTERFACE_POINTERS = 2,
  D3D_CT_RESOURCE_BIND_INFO = 3,
  D3D10_CT_CBUFFER = 0,
  D3D10_CT_TBUFFER = 1,
  D3D11_CT_CBUFFER = 0,
  D3D11_CT_TBUFFER = 1,
  D3D11_CT_INTERFACE_POINTERS = 2,
  D3D11_CT_RESOURCE_BIND_INFO = 3,
} D3D_CBUFFER_TYPE, *PD3D_CBUFFER_TYPE;

struct IRecordInfo
{
}; /* size: 0x0004 */

enum weaponAltModel_t
{
  WEAP_ALT_MODEL0 = 0,
  WEAP_ALT_MODEL1 = 1,
  WEAP_ALT_MODEL2 = 2,
  WEAP_ALT_MODEL3 = 3,
  WEAP_ALT_MODEL4 = 4,
  WEAP_ALT_MODEL5 = 5,
  WEAP_ALT_MODEL6 = 6,
  WEAP_ALT_MODEL7 = 7,
  WEAP_ALT_MODEL8 = 8,
  WEAP_ALT_MODEL9 = 9,
  WEAP_ALT_MODEL10 = 10,
  WEAP_ALT_MODEL11 = 11,
  WEAP_ALT_MODEL12 = 12,
  WEAP_ALT_MODEL13 = 13,
  WEAP_ALT_MODEL14 = 14,
  WEAP_ALT_MODEL15 = 15,
  NUM_WEAP_ALTMODELS = 16,
};

enum D3D11_TEXTURE_ADDRESS_MODE
{
  D3D11_TEXTURE_ADDRESS_WRAP = 1,
  D3D11_TEXTURE_ADDRESS_MIRROR = 2,
  D3D11_TEXTURE_ADDRESS_CLAMP = 3,
  D3D11_TEXTURE_ADDRESS_BORDER = 4,
  D3D11_TEXTURE_ADDRESS_MIRROR_ONCE = 5,
};

typedef enum _NV_GPU_OUTPUT_TYPE
{
  NVAPI_GPU_OUTPUT_UNKNOWN = 0,
  NVAPI_GPU_OUTPUT_CRT = 1,
  NVAPI_GPU_OUTPUT_DFP = 2,
  NVAPI_GPU_OUTPUT_TV = 3,
} NV_GPU_OUTPUT_TYPE, *PNV_GPU_OUTPUT_TYPE;

typedef enum _TAG_UNNAMED_52
{
  PTR_LIST_SIZE = 256,
} TAG_UNNAMED_52, *PTAG_UNNAMED_52;

typedef enum _TAG_UNNAMED_53
{
  XANIM_NOTIFY_NO_ONE = 0,
  XANIM_NOTIFY_SERVER = 1,
  XANIM_NOTIFY_CLIENT = 2,
  XANIM_NOTIFY_BOTH = 3,
} TAG_UNNAMED_53, *PTAG_UNNAMED_53;

typedef enum _TAG_UNNAMED_54
{
  VFT_TYPE = 18,
  VFT_CAMERAMODE = 19,
  VFT_TRACTION_TYPE = 20,
  VFT_MPH_TO_INCHES_PER_SECOND = 21,
  VFT_POUNDS_TO_GAME_MASS = 22,
  VFT_TEAM = 23,
  VFT_KEY_BINDING = 24,
  VFT_GRAPH = 25,
  VFT_WIIUCONTROLOVERRIDE = 26,
  VFT_NUM = 27,
} TAG_UNNAMED_54, *PTAG_UNNAMED_54;

typedef enum _TAG_UNNAMED_55
{
  MT_NODE_SIZE = 24,
} TAG_UNNAMED_55, *PTAG_UNNAMED_55;

typedef enum _NVAPI_VIDEO_FEATURE
{
  NVAPI_VF_UNKNOWN = 0,
  NVAPI_VF_MPEG2SDDecodeAcceleration = 1,
  NVAPI_VF_MPEG2HDDecodeAcceleration = 2,
  NVAPI_VF_VC1SDDecodeAcceleration = 3,
  NVAPI_VF_VC1HDDecodeAcceleration = 4,
  NVAPI_VF_H264SDDecodeAcceleration = 5,
  NVAPI_VF_H264HDDecodeAcceleration = 6,
  NVAPI_VF_WMV9SDDecodeAcceleration = 7,
  NVAPI_VF_WMV9HDDecodeAcceleration = 8,
  NVAPI_VF_ProcAmp = 9,
  NVAPI_VF_ColorTemperatureCorrection = 10,
  NVAPI_VF_ColorSpaceConversion = 11,
  NVAPI_VF_GammaCorrection = 12,
  NVAPI_VF_OverDrive = 13,
  NVAPI_VF_DynamicContrastEnhancement = 14,
  NVAPI_VF_StretchBlueGreenSkin = 15,
  NVAPI_VF_AdaptiveDeInterlacing = 16,
  NVAPI_VF_NoiseReduction = 17,
  NVAPI_VF_EdgeEnhancement = 18,
  NVAPI_VF_InverseTelecine = 19,
  NVAPI_VF_Scaling = 20,
  NVAPI_VF_VideoMirror = 21,
  NVAPI_VF_Blend = 22,
  NVAPI_VF_DxvaHDTest = 23,
  NVAPI_VF_GamutRemap = 24,
  NVAPI_VF_MftXcode = 25,
  NVAPI_VF_SkinToneCorrection = 26,
  NVAPI_VF_MftYUY2Xcode = 27,
  NVAPI_VF_MftDivxXcode = 28,
  NVAPI_VF_MftWmv9Encode = 29,
  NVAPI_VF_DynamicPState = 30,
  NVAPI_VF_PostProcessVIC = 31,
  NVAPI_VF_MVCHDDecodeAcceleration = 32,
  NVAPI_VF_SVCHDDecodeAcceleration = 33,
  NVAPI_VF_SimpleScaling = 34,
  NVAPI_VF_ID_LAST = 35,
} NVAPI_VIDEO_FEATURE, *PNVAPI_VIDEO_FEATURE;

union vec2_t
{
  union
  {
    /* 0x0000 */ float v[2];
    struct
    {
      /* 0x0000 */ float x;
      /* 0x0004 */ float y;
    }; /* size: 0x0008 */
  }; /* size: 0x0008 */
}; /* size: 0x0008 */

struct bot_steering_t
{
  /* 0x0000 */ union vec2_t anglesDesired;
  /* 0x0008 */ union vec2_t anglesAverage;
  /* 0x0010 */ union vec2_t anglesBase;
  /* 0x0018 */ float yawDelta;
  /* 0x001c */ float pitchDelta;
}; /* size: 0x0020 */

enum D3D_NAME
{
  D3D_NAME_UNDEFINED = 0,
  D3D_NAME_POSITION = 1,
  D3D_NAME_CLIP_DISTANCE = 2,
  D3D_NAME_CULL_DISTANCE = 3,
  D3D_NAME_RENDER_TARGET_ARRAY_INDEX = 4,
  D3D_NAME_VIEWPORT_ARRAY_INDEX = 5,
  D3D_NAME_VERTEX_ID = 6,
  D3D_NAME_PRIMITIVE_ID = 7,
  D3D_NAME_INSTANCE_ID = 8,
  D3D_NAME_IS_FRONT_FACE = 9,
  D3D_NAME_SAMPLE_INDEX = 10,
  D3D_NAME_FINAL_QUAD_EDGE_TESSFACTOR = 11,
  D3D_NAME_FINAL_QUAD_INSIDE_TESSFACTOR = 12,
  D3D_NAME_FINAL_TRI_EDGE_TESSFACTOR = 13,
  D3D_NAME_FINAL_TRI_INSIDE_TESSFACTOR = 14,
  D3D_NAME_FINAL_LINE_DETAIL_TESSFACTOR = 15,
  D3D_NAME_FINAL_LINE_DENSITY_TESSFACTOR = 16,
  D3D_NAME_TARGET = 64,
  D3D_NAME_DEPTH = 65,
  D3D_NAME_COVERAGE = 66,
  D3D_NAME_DEPTH_GREATER_EQUAL = 67,
  D3D_NAME_DEPTH_LESS_EQUAL = 68,
  D3D10_NAME_UNDEFINED = 0,
  D3D10_NAME_POSITION = 1,
  D3D10_NAME_CLIP_DISTANCE = 2,
  D3D10_NAME_CULL_DISTANCE = 3,
  D3D10_NAME_RENDER_TARGET_ARRAY_INDEX = 4,
  D3D10_NAME_VIEWPORT_ARRAY_INDEX = 5,
  D3D10_NAME_VERTEX_ID = 6,
  D3D10_NAME_PRIMITIVE_ID = 7,
  D3D10_NAME_INSTANCE_ID = 8,
  D3D10_NAME_IS_FRONT_FACE = 9,
  D3D10_NAME_SAMPLE_INDEX = 10,
  D3D10_NAME_TARGET = 64,
  D3D10_NAME_DEPTH = 65,
  D3D10_NAME_COVERAGE = 66,
  D3D11_NAME_FINAL_QUAD_EDGE_TESSFACTOR = 11,
  D3D11_NAME_FINAL_QUAD_INSIDE_TESSFACTOR = 12,
  D3D11_NAME_FINAL_TRI_EDGE_TESSFACTOR = 13,
  D3D11_NAME_FINAL_TRI_INSIDE_TESSFACTOR = 14,
  D3D11_NAME_FINAL_LINE_DETAIL_TESSFACTOR = 15,
  D3D11_NAME_FINAL_LINE_DENSITY_TESSFACTOR = 16,
  D3D11_NAME_DEPTH_GREATER_EQUAL = 67,
  D3D11_NAME_DEPTH_LESS_EQUAL = 68,
};

enum svscmd_type
{
  SV_CMD_CAN_IGNORE = 0,
  SV_CMD_RELIABLE = 1,
};

enum loadoutSlot_t
{
  LOADOUTSLOT_INVALID = -1,
  LOADOUTSLOT_FIRST = 0,
  LOADOUTSLOT_PRIMARY_WEAPON = 0,
  LOADOUTSLOT_PRIMARY_ATTACHMENT1 = 1,
  LOADOUTSLOT_PRIMARY_ATTACHMENT2 = 2,
  LOADOUTSLOT_PRIMARY_ATTACHMENT3 = 3,
  LOADOUTSLOT_PRIMARY_CAMO = 4,
  LOADOUTSLOT_PRIMARY_RETICLE = 5,
  LOADOUTSLOT_PRIMARY_RETICLE_COLOR = 6,
  LOADOUTSLOT_PRIMARY_LENS = 7,
  LOADOUTSLOT_PRIMARY_EMBLEM = 8,
  LOADOUTSLOT_PRIMARY_TAG = 9,
  LOADOUTSLOT_SECONDARY_WEAPON = 10,
  LOADOUTSLOT_SECONDARY_ATTACHMENT1 = 11,
  LOADOUTSLOT_SECONDARY_ATTACHMENT2 = 12,
  LOADOUTSLOT_SECONDARY_ATTACHMENT3 = 13,
  LOADOUTSLOT_SECONDARY_CAMO = 14,
  LOADOUTSLOT_SECONDARY_RETICLE = 15,
  LOADOUTSLOT_SECONDARY_RETICLE_COLOR = 16,
  LOADOUTSLOT_SECONDARY_LENS = 17,
  LOADOUTSLOT_SECONDARY_EMBLEM = 18,
  LOADOUTSLOT_SECONDARY_TAG = 19,
  LOADOUTSLOT_KNIFE_CAMO = 20,
  LOADOUTSLOT_FIRST_SPECIALTY = 21,
  LOADOUTSLOT_SPECIALTY1 = 21,
  LOADOUTSLOT_SPECIALTY2 = 22,
  LOADOUTSLOT_SPECIALTY3 = 23,
  LOADOUTSLOT_SPECIALTY4 = 24,
  LOADOUTSLOT_SPECIALTY5 = 25,
  LOADOUTSLOT_SPECIALTY6 = 26,
  LOADOUTSLOT_LAST_SPECIALTY = 26,
  LOADOUTSLOT_PRIMARY_GRENADE = 27,
  LOADOUTSLOT_PRIMARY_GRENADE_COUNT = 28,
  LOADOUTSLOT_PRIMARY_GRENADE_STATUS1 = 29,
  LOADOUTSLOT_PRIMARY_GRENADE_STATUS2 = 30,
  LOADOUTSLOT_PRIMARY_GRENADE_STATUS3 = 31,
  LOADOUTSLOT_SPECIAL_GRENADE = 32,
  LOADOUTSLOT_SPECIAL_GRENADE_COUNT = 33,
  LOADOUTSLOT_SPECIAL_GRENADE_STATUS1 = 34,
  LOADOUTSLOT_SPECIAL_GRENADE_STATUS2 = 35,
  LOADOUTSLOT_SPECIAL_GRENADE_STATUS3 = 36,
  LOADOUTSLOT_FIRST_BONUSCARD = 37,
  LOADOUTSLOT_BONUSCARD1 = 37,
  LOADOUTSLOT_BONUSCARD2 = 38,
  LOADOUTSLOT_BONUSCARD3 = 39,
  LOADOUTSLOT_LAST_BONUSCARD = 39,
  LOADOUTSLOT_GLOBAL_ITEMS_START = 40,
  LOADOUTSLOT_KILLSTREAK1 = 40,
  LOADOUTSLOT_KILLSTREAK2 = 41,
  LOADOUTSLOT_KILLSTREAK3 = 42,
  LOADOUTSLOT_KILLSTREAK4 = 43,
  LOADOUTSLOT_GLOBAL_ITEMS_END = 43,
  LOADOUTSLOT_COUNT = 44,
};

typedef enum _TAG_UNNAMED_56
{
  PTR_LIST_SIZE = 256,
} TAG_UNNAMED_56, *PTAG_UNNAMED_56;

enum statsMilestoneTypes_t
{
  MILESTONE_GLOBAL = 0,
  MILESTONE_FIRST = 0,
  MILESTONE_WEAPON = 1,
  MILESTONE_GAMEMODE = 2,
  MILESTONE_GROUP = 3,
  MILESTONE_ATTACHMENTS = 4,
  MILESTONE_COUNT = 5,
  MILESTONE_INVALID = 5,
};

typedef enum _TAG_UNNAMED_57
{
  _BUF_SIZE = 16,
} TAG_UNNAMED_57, *PTAG_UNNAMED_57;

enum MigrationState
{
  MSTATE_INACTIVE = 0,
  MSTATE_STARTING = 1,
  MSTATE_HEADER = 2,
  MSTATE_SENDING = 3,
  MSTATE_FINALIZING = 4,
};

enum dlcIndex_t
{
  CONTENT_DEV_MAP_INDEX = -1,
  CONTENT_ORIGINAL_MAP_INDEX = 0,
  CONTENT_DLC0_INDEX = 1,
  CONTENT_DLCZM0_INDEX = 2,
  CONTENT_DLC1_INDEX = 3,
  CONTENT_DLC2_INDEX = 4,
  CONTENT_DLC3_INDEX = 5,
  CONTENT_DLC4_INDEX = 6,
  CONTENT_DLC5_INDEX = 7,
  CONTENT_DLC0DD_INDEX = 8,
  CONTENT_DLCSEASONPASS_INDEX = 9,
  CONTENT_DLC_INDEX_MAX = 10,
};

enum LocalClientNum_t
{
  INVALID_LOCAL_CLIENT = -1,
  LOCAL_CLIENT_FIRST = 0,
  LOCAL_CLIENT_0 = 0,
  ONLY_LOCAL_CLIENT = 0,
  LOCAL_CLIENT_COUNT = 1,
};

struct ltc_ecc_set_type
{
  /* 0x0000 */ int size;
  /* 0x0004 */ char* name;
  /* 0x0008 */ char* prime;
  /* 0x000c */ char* B;
  /* 0x0010 */ char* order;
  /* 0x0014 */ char* Gx;
  /* 0x0018 */ char* Gy;
}; /* size: 0x001c */

enum DevEventType
{
  EVENT_ACTIVATE = 0,
  EVENT_DEACTIVATE = 1,
  EVENT_ACCEPT = 2,
  EVENT_UPDATE = 3,
  EVENT_DRAW = 4,
  EVENT_SAVE = 5,
};

enum pmoveVehAnimState_t
{
  PMOVE_VEH_ANIM_STATE_PLAYING = 0,
  PMOVE_VEH_ANIM_STATE_END_STAGE = 1,
  PMOVE_VEH_ANIM_STATE_COMPLETE = 2,
};

enum LbZombieGameMode
{
  LB_GAMEMODE_ZGRIEF = 0,
  LB_ZOMBIE_GAMEMODE_START = 0,
  LB_GAMEMODE_ZCLASSIC = 1,
  LB_GAMEMODE_ZSTANDARD = 2,
  LB_GAMEMODE_ZCLEANSED = 3,
  LB_ZOMBIE_GAMEMODE_COUNT = 4,
};

typedef enum _NV_ROTATE
{
  NV_ROTATE_0 = 0,
  NV_ROTATE_90 = 1,
  NV_ROTATE_180 = 2,
  NV_ROTATE_270 = 3,
  NV_ROTATE_IGNORED = 4,
} NV_ROTATE, *PNV_ROTATE;

typedef enum _TAG_UNNAMED_58
{
  PTR_LIST_SIZE = 256,
} TAG_UNNAMED_58, *PTAG_UNNAMED_58;

enum path_type_e
{
  PT_OLD_SPLINE = 0,
  PT_SPLINE = 1,
};

enum tagDESCKIND
{
  DESCKIND_NONE = 0,
  DESCKIND_FUNCDESC = 1,
  DESCKIND_VARDESC = 2,
  DESCKIND_TYPECOMP = 3,
  DESCKIND_IMPLICITAPPOBJ = 4,
  DESCKIND_MAX = 5,
};

typedef enum _NV_STANDARD_COLORSPACE
{
  NV_STANDARD_COLORSPACE_DISABLED = 0,
  NV_STANDARD_COLORSPACE_AUTOSELECT = 1,
  NV_STANDARD_COLORSPACE_sRGB = 2,
  NV_STANDARD_COLORSPACE_MONITOR_RGB = 3,
  NV_STANDARD_COLORSPACE_ADOBE_RGB = 4,
  NV_STANDARD_COLORSPACE_ADOBE_WIDE_GAMUT = 5,
  NV_STANDARD_COLORSPACE_APPLE = 6,
  NV_STANDARD_COLORSPACE_NTSC = 7,
  NV_STANDARD_COLORSPACE_HDTV = 8,
  NV_STANDARD_COLORSPACE_PAL = 9,
  NV_STANDARD_COLORSPACE_DCIP3 = 10,
  NV_STANDARD_COLORSPACE_MAX = 11,
} NV_STANDARD_COLORSPACE, *PNV_STANDARD_COLORSPACE;

enum scoreboardColumnType_t
{
  SB_TYPE_INVALID = 0,
  SB_TYPE_NONE = 1,
  SB_TYPE_SCORE = 2,
  SB_TYPE_KILLS = 3,
  SB_TYPE_DEATHS = 4,
  SB_TYPE_ASSISTS = 5,
  SB_TYPE_DEFENDS = 6,
  SB_TYPE_PLANTS = 7,
  SB_TYPE_DEFUSES = 8,
  SB_TYPE_RETURNS = 9,
  SB_TYPE_CAPTURES = 10,
  SB_TYPE_DESTRUCTIONS = 11,
  SB_TYPE_KDRATIO = 12,
  SB_TYPE_SURVIVED = 13,
  SB_TYPE_STABS = 14,
  SB_TYPE_TOMAHAWKS = 15,
  SB_TYPE_HUMILIATED = 16,
  SB_TYPE_X2SCORE = 17,
  SB_TYPE_HEADSHOTS = 18,
  SB_TYPE_DOWNS = 19,
  SB_TYPE_REVIVES = 20,
  SB_TYPE_AGRKILLS = 21,
  SB_TYPE_HACKS = 22,
  SB_TYPE_POINTS_TO_WIN = 23,
  SB_TYPE_KILLS_CONFIRMED = 24,
  SB_TYPE_KILLS_DENIED = 25,
  NUM_SB_TYPES = 26,
};

enum cacmpshared_type_e
{
  CACMPSHARED_TYPE_NONE = 0,
  CACMPSHARED_TYPE_WEAPON = 1,
};

enum ComSaveLumpBehavior
{
  COM_SAVE_LUMP_AND_CLOSE = 0,
  COM_SAVE_LUMP_AND_REOPEN = 1,
};

enum D3D_RESOURCE_RETURN_TYPE
{
  D3D_RETURN_TYPE_UNORM = 1,
  D3D_RETURN_TYPE_SNORM = 2,
  D3D_RETURN_TYPE_SINT = 3,
  D3D_RETURN_TYPE_UINT = 4,
  D3D_RETURN_TYPE_FLOAT = 5,
  D3D_RETURN_TYPE_MIXED = 6,
  D3D_RETURN_TYPE_DOUBLE = 7,
  D3D_RETURN_TYPE_CONTINUED = 8,
  D3D10_RETURN_TYPE_UNORM = 1,
  D3D10_RETURN_TYPE_SNORM = 2,
  D3D10_RETURN_TYPE_SINT = 3,
  D3D10_RETURN_TYPE_UINT = 4,
  D3D10_RETURN_TYPE_FLOAT = 5,
  D3D10_RETURN_TYPE_MIXED = 6,
  D3D11_RETURN_TYPE_UNORM = 1,
  D3D11_RETURN_TYPE_SNORM = 2,
  D3D11_RETURN_TYPE_SINT = 3,
  D3D11_RETURN_TYPE_UINT = 4,
  D3D11_RETURN_TYPE_FLOAT = 5,
  D3D11_RETURN_TYPE_MIXED = 6,
  D3D11_RETURN_TYPE_DOUBLE = 7,
  D3D11_RETURN_TYPE_CONTINUED = 8,
};

enum STBVorbisError
{
  VORBIS__no_error = 0,
  VORBIS_need_more_data = 1,
  VORBIS_invalid_api_mixing = 2,
  VORBIS_outofmem = 3,
  VORBIS_feature_not_supported = 4,
  VORBIS_too_many_channels = 5,
  VORBIS_file_open_failure = 6,
  VORBIS_seek_without_length = 7,
  VORBIS_unexpected_eof = 10,
  VORBIS_seek_invalid = 11,
  VORBIS_invalid_setup = 20,
  VORBIS_invalid_stream = 21,
  VORBIS_missing_capture_pattern = 30,
  VORBIS_invalid_stream_structure_version = 31,
  VORBIS_continued_packet_flag_invalid = 32,
  VORBIS_incorrect_stream_serial_number = 33,
  VORBIS_invalid_first_page = 34,
  VORBIS_bad_packet_type = 35,
  VORBIS_cant_find_last_page = 36,
  VORBIS_seek_failed = 37,
};

enum UIContextIndex_t
{
  INVALID_UI_CONTEXT = -1,
  UI_CONTEXT_FRONTEND = 0,
  UI_CONTEXT_INDEX_0 = 0,
  UI_CONTEXT_COUNT = 1,
};

enum clanTagFeatureColumn_t
{
  CLANTAG_COL_INDEX = 0,
  CLANTAG_COL_NAME = 1,
  CLANTAG_COL_UNLOCKLVL = 2,
  CLANTAG_COL_UNLOCKPLVL = 3,
  CLANTAG_COL_COST = 4,
  CLANTAG_COL_TYPE = 5,
  CLANTAG_COL_DATA = 6,
  CLANTAG_COL_NUMFRAMES = 7,
  CLANTAG_COL_PHASE = 8,
  CLANTAG_COL_FRAME1 = 9,
  CLANTAG_COL_FRAME2 = 10,
  CLANTAG_COL_FRAME3 = 11,
  CLANTAG_COL_FRAME4 = 12,
  CLANTAG_COL_FRAME5 = 13,
  CLANTAG_COL_FRAME6 = 14,
  CLANTAG_COL_FRAME7 = 15,
  CLANTAG_COL_FRAME8 = 16,
};

enum FF_DIR
{
  FFD_DEFAULT = 0,
};

enum bdLobbyErrorCode
{
  BD_NO_ERROR = 0,
  BD_TOO_MANY_TASKS = 1,
  BD_NOT_CONNECTED = 2,
  BD_SEND_FAILED = 3,
  BD_HANDLE_TASK_FAILED = 4,
  BD_START_TASK_FAILED = 5,
  BD_RESULT_EXCEEDS_BUFFER_SIZE = 100,
  BD_ACCESS_DENIED = 101,
  BD_EXCEPTION_IN_DB = 102,
  BD_MALFORMED_TASK_HEADER = 103,
  BD_INVALID_ROW = 104,
  BD_EMPTY_ARG_LIST = 105,
  BD_PARAM_PARSE_ERROR = 106,
  BD_PARAM_MISMATCHED_TYPE = 107,
  BD_SERVICE_NOT_AVAILABLE = 108,
  BD_CONNECTION_RESET = 109,
  BD_INVALID_USER_ID = 110,
  BD_LOBBY_PROTOCOL_VERSION_FAILURE = 111,
  BD_LOBBY_INTERNAL_FAILURE = 112,
  BD_LOBBY_PROTOCOL_ERROR = 113,
  BD_LOBBY_FAILED_TO_DECODE_UTF8 = 114,
  BD_LOBBY_ASCII_EXPECTED = 115,
  BD_ASYNCHRONOUS_ERROR = 200,
  BD_STREAMING_COMPLETE = 201,
  BD_MEMBER_NO_PROPOSAL = 300,
  BD_TEAMNAME_ALREADY_EXISTS = 301,
  BD_MAX_TEAM_MEMBERSHIPS_LIMITED = 302,
  BD_MAX_TEAM_OWNERSHIPS_LIMITED = 303,
  BD_NOT_A_TEAM_MEMBER = 304,
  BD_INVALID_TEAM_ID = 305,
  BD_INVALID_TEAM_NAME = 306,
  BD_NOT_A_TEAM_OWNER = 307,
  BD_NOT_AN_ADMIN_OR_OWNER = 308,
  BD_MEMBER_PROPOSAL_EXISTS = 309,
  BD_MEMBER_EXISTS = 310,
  BD_TEAM_FULL = 311,
  BD_VULGAR_TEAM_NAME = 312,
  BD_TEAM_USERID_BANNED = 313,
  BD_TEAM_EMPTY = 314,
  BD_INVALID_TEAM_PROFILE_QUERY_ID = 315,
  BD_TEAMNAME_TOO_SHORT = 316,
  BD_UNIQUE_PROFILE_DATA_EXISTS_ALREADY = 317,
  BD_INVALID_LEADERBOARD_ID = 400,
  BD_INVALID_STATS_SET = 401,
  BD_EMPTY_STATS_SET_IGNORED = 403,
  BD_NO_DIRECT_ACCESS_TO_ARBITRATED_LBS = 404,
  BD_STATS_WRITE_PERMISSION_DENIED = 405,
  BD_STATS_WRITE_TYPE_DATA_TYPE_MISMATCH = 406,
  BD_NO_STATS_FOR_USER = 407,
  BD_INVALID_ACCESS_TO_UNRANKED_LB = 408,
  BD_INVALID_EXTERNAL_TITLE_ID = 409,
  BD_DIFFERENT_LEADERBOARD_SCHEMAS = 410,
  BD_TOO_MANY_LEADERBOARDS_REQUESTED = 411,
  BD_ENTITLEMENTS_ERROR = 412,
  BD_ENTITLEMENTS_INVALID_TITLEID = 413,
  BD_ENTITLEMENTS_INVALID_LEADERBOARDID = 414,
  BD_ENTITLEMENTS_INVALID_GET_MODE_FOR_TITLE = 415,
  BD_ENTITLEMENTS_URL_CONNECTION_ERROR = 416,
  BD_ENTITLEMENTS_CONFIG_ERROR = 417,
  BD_ENTITLEMENTS_NAMED_PARENT_ERROR = 418,
  BD_ENTITLEMENTS_NAMED_KEY_ERROR = 419,
  BD_TOO_MANY_ENTITY_IDS_REQUESTED = 420,
  BD_STATS_READ_FAILED = 421,
  BD_INVALID_TITLE_ID = 500,
  BD_MESSAGING_INVALID_MAIL_ID = 600,
  BD_SELF_BLOCK_NOT_ALLOWED = 601,
  BD_GLOBAL_MESSAGE_ACCESS_DENIED = 602,
  BD_GLOBAL_MESSAGES_USER_LIMIT_EXCEEDED = 603,
  BD_AUTH_NO_ERROR = 700,
  BD_AUTH_BAD_REQUEST = 701,
  BD_AUTH_SERVER_CONFIG_ERROR = 702,
  BD_AUTH_BAD_TITLE_ID = 703,
  BD_AUTH_BAD_ACCOUNT = 704,
  BD_AUTH_ILLEGAL_OPERATION = 705,
  BD_AUTH_INCORRECT_LICENSE_CODE = 706,
  BD_AUTH_CREATE_USERNAME_EXISTS = 707,
  BD_AUTH_CREATE_USERNAME_ILLEGAL = 708,
  BD_AUTH_CREATE_USERNAME_VULGAR = 709,
  BD_AUTH_CREATE_MAX_ACC_EXCEEDED = 710,
  BD_AUTH_MIGRATE_NOT_SUPPORTED = 711,
  BD_AUTH_TITLE_DISABLED = 712,
  BD_AUTH_ACCOUNT_EXPIRED = 713,
  BD_AUTH_ACCOUNT_LOCKED = 714,
  BD_AUTH_UNKNOWN_ERROR = 715,
  BD_AUTH_INCORRECT_PASSWORD = 716,
  BD_AUTH_IP_NOT_IN_ALLOWED_RANGE = 717,
  BD_AUTH_WII_TOKEN_VERIFICATION_FAILED = 718,
  BD_AUTH_WII_AUTHENTICATION_FAILED = 719,
  BD_AUTH_IP_KEY_LIMIT_REACHED = 720,
  BD_AUTH_INVALID_GSPID = 721,
  BD_AUTH_INVALID_IP_RANGE_ID = 722,
  BD_AUTH_3DS_TOKEN_VERIFICATION_FAILED = 721,
  BD_AUTH_3DS_AUTHENTICATION_FAILED = 722,
  BD_AUTH_STEAM_APP_ID_MISMATCH = 723,
  BD_AUTH_ABACCOUNTS_APP_ID_MISMATCH = 724,
  BD_AUTH_CODO_USERNAME_NOT_SET = 725,
  BD_AUTH_WIIU_TOKEN_VERIFICATION_FAILED = 726,
  BD_AUTH_WIIU_AUTHENTICATION_FAILED = 727,
  BD_AUTH_CODO_USERNAME_NOT_BASE64 = 728,
  BD_AUTH_CODO_USERNAME_NOT_UTF8 = 729,
  BD_AUTH_TENCENT_TICKET_EXPIRED = 730,
  BD_NO_PROFILE_INFO_EXISTS = 800,
  BD_FRIENDSHIP_NOT_REQUSTED = 900,
  BD_NOT_A_FRIEND = 901,
  BD_SELF_FRIENDSHIP_NOT_ALLOWED = 903,
  BD_FRIENDSHIP_EXISTS = 904,
  BD_PENDING_FRIENDSHIP_EXISTS = 905,
  BD_USERID_BANNED = 906,
  BD_FRIENDS_FULL = 908,
  BD_FRIENDS_NO_RICH_PRESENCE = 909,
  BD_RICH_PRESENCE_TOO_LARGE = 910,
  BD_NO_FILE = 1000,
  BD_PERMISSION_DENIED = 1001,
  BD_FILESIZE_LIMIT_EXCEEDED = 1002,
  BD_FILENAME_MAX_LENGTH_EXCEEDED = 1003,
  BD_CHANNEL_DOES_NOT_EXIST = 1101,
  BD_CHANNEL_ALREADY_SUBSCRIBED = 1102,
  BD_CHANNEL_NOT_SUBSCRIBED = 1103,
  BD_CHANNEL_FULL = 1104,
  BD_CHANNEL_SUBSCRIPTIONS_FULL = 1105,
  BD_CHANNEL_NO_SELF_WHISPERING = 1106,
  BD_CHANNEL_ADMIN_REQUIRED = 1107,
  BD_CHANNEL_TARGET_NOT_SUBSCRIBED = 1108,
  BD_CHANNEL_REQUIRES_PASSWORD = 1109,
  BD_CHANNEL_TARGET_IS_SELF = 1110,
  BD_CHANNEL_PUBLIC_BAN_NOT_ALLOWED = 1111,
  BD_CHANNEL_USER_BANNED = 1112,
  BD_CHANNEL_PUBLIC_PASSWORD_NOT_ALLOWED = 1113,
  BD_CHANNEL_PUBLIC_KICK_NOT_ALLOWED = 1114,
  BD_EVENT_DESC_TRUNCATED = 1200,
  BD_CONTENT_UNLOCK_UNKNOWN_ERROR = 1300,
  BD_UNLOCK_KEY_INVALID = 1301,
  BD_UNLOCK_KEY_ALREADY_USED_UP = 1302,
  BD_SHARED_UNLOCK_LIMIT_REACHED = 1303,
  BD_DIFFERENT_HARDWARE_ID = 1304,
  BD_INVALID_CONTENT_OWNER = 1305,
  BD_CONTENT_UNLOCK_INVALID_USER = 1306,
  BD_KEY_ARCHIVE_INVALID_WRITE_TYPE = 1500,
  BD_KEY_ARCHIVE_EXCEEDED_MAX_IDS_PER_REQUEST = 1501,
  BD_BANDWIDTH_TEST_TRY_AGAIN = 1810,
  BD_BANDWIDTH_TEST_STILL_IN_PROGRESS = 1811,
  BD_BANDWIDTH_TEST_NOT_PROGRESS = 1812,
  BD_BANDWIDTH_TEST_SOCKET_ERROR = 1813,
  BD_INVALID_SESSION_NONCE = 1901,
  BD_ARBITRATION_FAILURE = 1903,
  BD_ARBITRATION_USER_NOT_REGISTERED = 1905,
  BD_ARBITRATION_NOT_CONFIGURED = 1906,
  BD_CONTENTSTREAMING_FILE_NOT_AVAILABLE = 2000,
  BD_CONTENTSTREAMING_STORAGE_SPACE_EXCEEDED = 2001,
  BD_CONTENTSTREAMING_NUM_FILES_EXCEEDED = 2002,
  BD_CONTENTSTREAMING_UPLOAD_BANDWIDTH_EXCEEDED = 2003,
  BD_CONTENTSTREAMING_FILENAME_MAX_LENGTH_EXCEEDED = 2004,
  BD_CONTENTSTREAMING_MAX_THUMB_DATA_SIZE_EXCEEDED = 2005,
  BD_CONTENTSTREAMING_DOWNLOAD_BANDWIDTH_EXCEEDED = 2006,
  BD_CONTENTSTREAMING_NOT_ENOUGH_DOWNLOAD_BUFFER_SPACE = 2007,
  BD_CONTENTSTREAMING_SERVER_NOT_CONFIGURED = 2008,
  BD_CONTENTSTREAMING_INVALID_APPLE_RECEIPT = 2010,
  BD_CONTENTSTREAMING_APPLE_STORE_NOT_AVAILABLE = 2011,
  BD_CONTENTSTREAMING_APPLE_RECEIPT_FILENAME_MISMATCH = 2012,
  BD_CONTENTSTREAMING_HTTP_ERROR = 2020,
  BD_CONTENTSTREAMING_FAILED_TO_START_HTTP = 2021,
  BD_CONTENTSTREAMING_LOCALE_INVALID = 2022,
  BD_CONTENTSTREAMING_LOCALE_MISSING = 2023,
  BD_VOTERANK_ERROR_EMPTY_RATING_SUBMISSION = 2030,
  BD_VOTERANK_ERROR_MAX_VOTES_EXCEEDED = 2031,
  BD_VOTERANK_ERROR_INVALID_RATING = 2032,
  BD_MAX_NUM_TAGS_EXCEEDED = 2090,
  BD_TAGGED_COLLECTION_DOES_NOT_EXIST = 2091,
  BD_EMPTY_TAG_ARRAY = 2092,
  BD_INVALID_QUERY_ID = 2100,
  BD_NO_ENTRY_TO_UPDATE = 2101,
  BD_SESSION_INVITE_EXISTS = 2102,
  BD_INVALID_SESSION_ID = 2103,
  BD_ATTACHMENT_TOO_LARGE = 2104,
  BD_INVALID_GROUP_ID = 2800,
  BD_UCD_SERVICE_ERROR = 3200,
  BD_UCD_SERVICE_DISABLED = 3201,
  BD_UCD_UNINTIALIZED_ERROR = 3202,
  BD_UCD_ACCOUNT_ALREADY_REGISTERED = 3203,
  BD_UCD_ACCOUNT_NOT_REGISTERED = 3204,
  BD_UCD_AUTH_ATTEMPT_FAILED = 3205,
  BD_UCD_ACCOUNT_LINKING_ERROR = 3206,
  BD_UCD_ENCRYPTION_ERROR = 3207,
  BD_UCD_ACCOUNT_DATA_INVALID = 3208,
  BD_UCD_ACCOUNT_DATA_INVALID_FIRSTNAME = 3209,
  BD_UCD_ACCOUNT_DATA_INVALID_LASTNAME = 3210,
  BD_UCD_ACCOUNT_DATA_INVALID_DOB = 3211,
  BD_UCD_ACCOUNT_DATA_INVALID_EMAIL = 3212,
  BD_UCD_ACCOUNT_DATA_INVALID_COUNTRY = 3213,
  BD_UCD_ACCOUNT_DATA_INVALID_POSTCODE = 3214,
  BD_UCD_ACCOUNT_NAME_ALREADY_RESISTERED = 3220,
  BD_UCD_ACCOUNT_EMAIL_ALREADY_RESISTERED = 3221,
  BD_TWITCH_SERVICE_ERROR = 3101,
  BD_TWITCH_ACCOUNT_ALREADY_LINKED = 3102,
  BD_TWITCH_NO_LINKED_ACCOUNT = 3103,
  BD_YOUTUBE_SERVICE_ERROR = 3301,
  BD_YOUTUBE_SERVICE_COMMUNICATION_ERROR = 3302,
  BD_YOUTUBE_USER_DENIED_AUTHORIZATION = 3303,
  BD_YOUTUBE_AUTH_MAX_TIME_EXCEEDED = 3304,
  BD_YOUTUBE_USER_UNAUTHORIZED = 3305,
  BD_YOUTUBE_UPLOAD_MAX_TIME_EXCEEDED = 3306,
  BD_YOUTUBE_DUPLICATE_UPLOAD = 3307,
  BD_YOUTUBE_FAILED_UPLOAD = 3308,
  BD_YOUTUBE_ACCOUNT_ALREADY_REGISTERED = 3309,
  BD_YOUTUBE_ACCOUNT_NOT_REGISTERED = 3310,
  BD_YOUTUBE_CONTENT_SERVER_ERROR = 3311,
  BD_YOUTUBE_UPLOAD_DOES_NOT_EXIST = 3312,
  BD_YOUTUBE_NO_LINKED_ACCOUNT = 3313,
  BD_YOUTUBE_DEVELOPER_TAGS_INVALID = 3314,
  BD_TWITTER_AUTH_ATTEMPT_FAILED = 3501,
  BD_TWITTER_AUTH_TOKEN_INVALID = 3502,
  BD_TWITTER_UPDATE_LIMIT_REACHED = 3503,
  BD_TWITTER_UNAVAILABLE = 3504,
  BD_TWITTER_ERROR = 3505,
  BD_TWITTER_TIMED_OUT = 3506,
  BD_TWITTER_DISABLED_FOR_USER = 3507,
  BD_TWITTER_ACCOUNT_AMBIGUOUS = 3508,
  BD_TWITTER_MAXIMUM_ACCOUNTS_REACHED = 3509,
  BD_TWITTER_ACCOUNT_NOT_REGISTERED = 3510,
  BD_TWITTER_DUPLICATE_STATUS = 3511,
  BD_TWITTER_ACCOUNT_ALREADY_REGISTERED = 3612,
  BD_FACEBOOK_AUTH_ATTEMPT_FAILED = 3601,
  BD_FACEBOOK_AUTH_TOKEN_INVALID = 3602,
  BD_FACEBOOK_PHOTO_DOES_NOT_EXIST = 3603,
  BD_FACEBOOK_PHOTO_INVALID = 3604,
  BD_FACEBOOK_PHOTO_ALBUM_FULL = 3605,
  BD_FACEBOOK_UNAVAILABLE = 3606,
  BD_FACEBOOK_ERROR = 3607,
  BD_FACEBOOK_TIMED_OUT = 3608,
  BD_FACEBOOK_DISABLED_FOR_USER = 3609,
  BD_FACEBOOK_ACCOUNT_AMBIGUOUS = 3610,
  BD_FACEBOOK_MAXIMUM_ACCOUNTS_REACHED = 3611,
  BD_FACEBOOK_INVALID_NUM_PICTURES_REQUESTED = 3612,
  BD_FACEBOOK_VIDEO_DOES_NOT_EXIST = 3613,
  BD_FACEBOOK_ACCOUNT_ALREADY_REGISTERED = 3614,
  BD_APNS_INVALID_PAYLOAD = 3700,
  BD_MAX_CONSOLEID_LENGTH_EXCEEDED = 3809,
  BD_MAX_WHITELIST_LENGTH_EXCEEDED = 3810,
  BD_USERGROUP_NAME_ALREADY_EXISTS = 6000,
  BD_INVALID_USERGROUP_ID = 6001,
  BD_USER_ALREADY_IN_USERGROUP = 6002,
  BD_USER_NOT_IN_USERGROUP = 6003,
  BD_INVALID_USERGROUP_MEMBER_TYPE = 6004,
  BD_TOO_MANY_MEMBERS_REQUESTED = 6005,
  BD_USERGROUP_NAME_TOO_SHORT = 6006,
  BD_RICH_PRESENCE_DATA_TOO_LARGE = 6800,
  BD_RICH_PRESENCE_TOO_MANY_USERS = 6801,
  BD_SUBSCRIPTION_TOO_MANY_USERS = 7000,
  BD_SUBSCRIPTION_TICKET_PARSE_ERROR = 7001,
  BD_CODO_ID_INVALID_DATA = 7100,
  BD_INVALID_MESSAGE_FORMAT = 7101,
  BD_TLOG_TOO_MANY_MESSAGES = 7102,
  BD_CODO_ID_NOT_IN_WHITELIST = 7103,
  BD_TLOG_MESSAGE_TRANSFORMATION_ERROR = 7104,
  BD_MARKETPLACE_ERROR = 8000,
  BD_MARKETPLACE_RESOURCE_NOT_FOUND = 8001,
  BD_MARKETPLACE_INVALID_CURRENCY = 8002,
  BD_MARKETPLACE_INVALID_PARAMETER = 8003,
  BD_MARKETPLACE_RESOURCE_CONFLICT = 8004,
  BD_MARKETPLACE_STORAGE_ERROR = 8005,
  BD_MARKETPLACE_INTEGRITY_ERROR = 8006,
  BD_MARKETPLACE_INSUFFICIENT_FUNDS_ERROR = 8007,
  BD_MARKETPLACE_MMP_SERVICE_ERROR = 8008,
  BD_MARKETPLACE_PRECONDITION_REQUIRED = 8009,
  BD_MARKETPLACE_ITEM_MULTIPLE_PURCHASE_ERROR = 8010,
  BD_MARKETPLACE_MISSING_REQUIRED_ENTITLEMENT = 8011,
  BD_MARKETPLACE_VALIDATION_ERROR = 8012,
  BD_MARKETPLACE_TENCENT_PAYMENT_ERROR = 8013,
  BD_MARKETPLACE_SKU_NOT_COUPON_ENABLED_ERROR = 8014,
  BD_LEAGUE_INVALID_TEAM_SIZE = 8100,
  BD_LEAGUE_INVALID_TEAM = 8101,
  BD_LEAGUE_INVALID_SUBDIVISION = 8102,
  BD_LEAGUE_INVALID_LEAGUE = 8103,
  BD_LEAGUE_TOO_MANY_RESULTS_REQUESTED = 8104,
  BD_LEAGUE_METADATA_TOO_LARGE = 8105,
  BD_LEAGUE_TEAM_ICON_TOO_LARGE = 8106,
  BD_LEAGUE_TEAM_NAME_TOO_LONG = 8107,
  BD_LEAGUE_ARRAY_SIZE_MISMATCH = 8108,
  BD_LEAGUE_SUBDIVISION_MISMATCH = 8200,
  BD_LEAGUE_INVALID_WRITE_TYPE = 8201,
  BD_LEAGUE_INVALID_STATS_DATA = 8202,
  BD_LEAGUE_SUBDIVISION_UNRANKED = 8203,
  BD_LEAGUE_CROSS_TEAM_STATS_WRITE_PREVENTED = 8204,
  BD_LEAGUE_INVALID_STATS_SEASON = 8205,
  BD_COMMERCE_ERROR = 8300,
  BD_COMMERCE_RESOURCE_NOT_FOUND = 8301,
  BD_COMMERCE_STORAGE_INVALID_PARAMETER = 8302,
  BD_COMMERCE_APPLICATION_INVALID_PARAMETER = 8303,
  BD_COMMERCE_RESOURCE_CONFLICT = 8304,
  BD_COMMERCE_STORAGE_ERROR = 8305,
  BD_COMMERCE_INTEGRITY_ERROR = 8306,
  BD_COMMERCE_MMP_SERVICE_ERROR = 8307,
  BD_COMMERCE_PERMISSION_DENIED = 8308,
  BD_COMMERCE_INSUFFICIENT_FUNDS_ERROR = 8309,
  BD_COMMERCE_UNKNOWN_CURRENCY = 8310,
  BD_COMMERCE_INVALID_RECEIPT = 8311,
  BD_COMMERCE_RECEIPT_USED = 8312,
  BD_COMMERCE_TRANSACTION_ALREADY_APPLIED = 8313,
  BD_COMMERCE_INVALID_CURRENCY_TYPE = 8314,
  BD_CONNECTION_COUNTER_ERROR = 8400,
  BD_GMSG_INVALID_CATEGORY_ID = 10200,
  BD_GMSG_CATEGORY_MEMBERSHIPS_LIMIT = 10201,
  BD_GMSG_NONMEMBER_POST_DISALLOWED = 10202,
  BD_GMSG_CATEGORY_DISALLOWS_CLIENT_TYPE = 10203,
  BD_GMSG_PAYLOAD_TOO_BIG = 10204,
  BD_GMSG_MEMBER_POST_DISALLOWED = 10205,
  BD_GMSG_OVERLOADED = 10206,
  BD_GMSG_USER_PERCATEGORY_POST_RATE_EXCEEDED = 10207,
  BD_GMSG_USER_GLOBAL_POST_RATE_EXCEEDED = 10208,
  BD_GMSG_GROUP_POST_RATE_EXCEEDED = 10209,
  BD_MAX_ERROR_CODE = 10210,
};

enum ClientNum_t
{
  INVALID_CLIENT_INDEX = -1,
  CLIENT_INDEX_FIRST = 0,
  CLIENT_INDEX_0 = 0,
  CLIENT_INDEX_1 = 1,
  CLIENT_INDEX_2 = 2,
  CLIENT_INDEX_3 = 3,
  CLIENT_INDEX_4 = 4,
  CLIENT_INDEX_5 = 5,
  CLIENT_INDEX_6 = 6,
  CLIENT_INDEX_7 = 7,
  CLIENT_INDEX_8 = 8,
  CLIENT_INDEX_9 = 9,
  CLIENT_INDEX_10 = 10,
  CLIENT_INDEX_11 = 11,
  CLIENT_INDEX_12 = 12,
  CLIENT_INDEX_13 = 13,
  CLIENT_INDEX_14 = 14,
  CLIENT_INDEX_15 = 15,
  CLIENT_INDEX_16 = 16,
  CLIENT_INDEX_17 = 17,
  CLIENT_INDEX_18 = 18,
  CLIENT_INDEX_19 = 19,
  CLIENT_INDEX_20 = 20,
  CLIENT_INDEX_21 = 21,
  CLIENT_INDEX_22 = 22,
  CLIENT_INDEX_23 = 23,
  CLIENT_INDEX_24 = 24,
  CLIENT_INDEX_25 = 25,
  CLIENT_INDEX_26 = 26,
  CLIENT_INDEX_27 = 27,
  CLIENT_INDEX_28 = 28,
  CLIENT_INDEX_29 = 29,
  CLIENT_INDEX_30 = 30,
  CLIENT_INDEX_31 = 31,
  CLIENT_INDEX_COUNT = 18,
};

struct ID3D11DepthStencilView
{
}; /* size: 0x0004 */

typedef enum _TAG_UNNAMED_59
{
  PART_TYPE_NO_QUAT = 0,
  PART_TYPE_HALF_QUAT = 1,
  PART_TYPE_FULL_QUAT = 2,
  PART_TYPE_HALF_QUAT_NO_SIZE = 3,
  PART_TYPE_FULL_QUAT_NO_SIZE = 4,
  PART_TYPE_SMALL_TRANS = 5,
  PART_TYPE_TRANS = 6,
  PART_TYPE_TRANS_NO_SIZE = 7,
  PART_TYPE_NO_TRANS = 8,
  PART_TYPE_ALL = 9,
  PART_TYPE_COUNT = 10,
} TAG_UNNAMED_59, *PTAG_UNNAMED_59;

typedef enum _TAG_UNNAMED_60
{
  DDL_USERFLAGS_VALUE_CHANGED = 1,
  DDL_USERFLAGS_ONLINE_RANKED_STATS = 2,
  DDL_USERFLAGS_ONLINE_ZOMBIE_STATS = 8,
  DDL_USERFLAGS_ALL = 11,
  DDL_USERFLAGS_COUNT = 3,
} TAG_UNNAMED_60, *PTAG_UNNAMED_60;

enum tag_WBEMSTATUS
{
  WBEM_NO_ERROR = 0,
  WBEM_S_NO_ERROR = 0,
  WBEM_S_SAME = 0,
  WBEM_S_FALSE = 1,
  WBEM_S_ALREADY_EXISTS = 0x40001,
  WBEM_S_RESET_TO_DEFAULT = 0x40002,
  WBEM_S_DIFFERENT = 0x40003,
  WBEM_S_TIMEDOUT = 0x40004,
  WBEM_S_NO_MORE_DATA = 0x40005,
  WBEM_S_OPERATION_CANCELLED = 0x40006,
  WBEM_S_PENDING = 0x40007,
  WBEM_S_DUPLICATE_OBJECTS = 0x40008,
  WBEM_S_ACCESS_DENIED = 0x40009,
  WBEM_S_PARTIAL_RESULTS = 0x40010,
  WBEM_S_SOURCE_NOT_AVAILABLE = 0x40017,
  WBEM_E_FAILED = -2147217407,
  WBEM_E_NOT_FOUND = -2147217406,
  WBEM_E_ACCESS_DENIED = -2147217405,
  WBEM_E_PROVIDER_FAILURE = -2147217404,
  WBEM_E_TYPE_MISMATCH = -2147217403,
  WBEM_E_OUT_OF_MEMORY = -2147217402,
  WBEM_E_INVALID_CONTEXT = -2147217401,
  WBEM_E_INVALID_PARAMETER = -2147217400,
  WBEM_E_NOT_AVAILABLE = -2147217399,
  WBEM_E_CRITICAL_ERROR = -2147217398,
  WBEM_E_INVALID_STREAM = -2147217397,
  WBEM_E_NOT_SUPPORTED = -2147217396,
  WBEM_E_INVALID_SUPERCLASS = -2147217395,
  WBEM_E_INVALID_NAMESPACE = -2147217394,
  WBEM_E_INVALID_OBJECT = -2147217393,
  WBEM_E_INVALID_CLASS = -2147217392,
  WBEM_E_PROVIDER_NOT_FOUND = -2147217391,
  WBEM_E_INVALID_PROVIDER_REGISTRATION = -2147217390,
  WBEM_E_PROVIDER_LOAD_FAILURE = -2147217389,
  WBEM_E_INITIALIZATION_FAILURE = -2147217388,
  WBEM_E_TRANSPORT_FAILURE = -2147217387,
  WBEM_E_INVALID_OPERATION = -2147217386,
  WBEM_E_INVALID_QUERY = -2147217385,
  WBEM_E_INVALID_QUERY_TYPE = -2147217384,
  WBEM_E_ALREADY_EXISTS = -2147217383,
  WBEM_E_OVERRIDE_NOT_ALLOWED = -2147217382,
  WBEM_E_PROPAGATED_QUALIFIER = -2147217381,
  WBEM_E_PROPAGATED_PROPERTY = -2147217380,
  WBEM_E_UNEXPECTED = -2147217379,
  WBEM_E_ILLEGAL_OPERATION = -2147217378,
  WBEM_E_CANNOT_BE_KEY = -2147217377,
  WBEM_E_INCOMPLETE_CLASS = -2147217376,
  WBEM_E_INVALID_SYNTAX = -2147217375,
  WBEM_E_NONDECORATED_OBJECT = -2147217374,
  WBEM_E_READ_ONLY = -2147217373,
  WBEM_E_PROVIDER_NOT_CAPABLE = -2147217372,
  WBEM_E_CLASS_HAS_CHILDREN = -2147217371,
  WBEM_E_CLASS_HAS_INSTANCES = -2147217370,
  WBEM_E_QUERY_NOT_IMPLEMENTED = -2147217369,
  WBEM_E_ILLEGAL_NULL = -2147217368,
  WBEM_E_INVALID_QUALIFIER_TYPE = -2147217367,
  WBEM_E_INVALID_PROPERTY_TYPE = -2147217366,
  WBEM_E_VALUE_OUT_OF_RANGE = -2147217365,
  WBEM_E_CANNOT_BE_SINGLETON = -2147217364,
  WBEM_E_INVALID_CIM_TYPE = -2147217363,
  WBEM_E_INVALID_METHOD = -2147217362,
  WBEM_E_INVALID_METHOD_PARAMETERS = -2147217361,
  WBEM_E_SYSTEM_PROPERTY = -2147217360,
  WBEM_E_INVALID_PROPERTY = -2147217359,
  WBEM_E_CALL_CANCELLED = -2147217358,
  WBEM_E_SHUTTING_DOWN = -2147217357,
  WBEM_E_PROPAGATED_METHOD = -2147217356,
  WBEM_E_UNSUPPORTED_PARAMETER = -2147217355,
  WBEM_E_MISSING_PARAMETER_ID = -2147217354,
  WBEM_E_INVALID_PARAMETER_ID = -2147217353,
  WBEM_E_NONCONSECUTIVE_PARAMETER_IDS = -2147217352,
  WBEM_E_PARAMETER_ID_ON_RETVAL = -2147217351,
  WBEM_E_INVALID_OBJECT_PATH = -2147217350,
  WBEM_E_OUT_OF_DISK_SPACE = -2147217349,
  WBEM_E_BUFFER_TOO_SMALL = -2147217348,
  WBEM_E_UNSUPPORTED_PUT_EXTENSION = -2147217347,
  WBEM_E_UNKNOWN_OBJECT_TYPE = -2147217346,
  WBEM_E_UNKNOWN_PACKET_TYPE = -2147217345,
  WBEM_E_MARSHAL_VERSION_MISMATCH = -2147217344,
  WBEM_E_MARSHAL_INVALID_SIGNATURE = -2147217343,
  WBEM_E_INVALID_QUALIFIER = -2147217342,
  WBEM_E_INVALID_DUPLICATE_PARAMETER = -2147217341,
  WBEM_E_TOO_MUCH_DATA = -2147217340,
  WBEM_E_SERVER_TOO_BUSY = -2147217339,
  WBEM_E_INVALID_FLAVOR = -2147217338,
  WBEM_E_CIRCULAR_REFERENCE = -2147217337,
  WBEM_E_UNSUPPORTED_CLASS_UPDATE = -2147217336,
  WBEM_E_CANNOT_CHANGE_KEY_INHERITANCE = -2147217335,
  WBEM_E_CANNOT_CHANGE_INDEX_INHERITANCE = -2147217328,
  WBEM_E_TOO_MANY_PROPERTIES = -2147217327,
  WBEM_E_UPDATE_TYPE_MISMATCH = -2147217326,
  WBEM_E_UPDATE_OVERRIDE_NOT_ALLOWED = -2147217325,
  WBEM_E_UPDATE_PROPAGATED_METHOD = -2147217324,
  WBEM_E_METHOD_NOT_IMPLEMENTED = -2147217323,
  WBEM_E_METHOD_DISABLED = -2147217322,
  WBEM_E_REFRESHER_BUSY = -2147217321,
  WBEM_E_UNPARSABLE_QUERY = -2147217320,
  WBEM_E_NOT_EVENT_CLASS = -2147217319,
  WBEM_E_MISSING_GROUP_WITHIN = -2147217318,
  WBEM_E_MISSING_AGGREGATION_LIST = -2147217317,
  WBEM_E_PROPERTY_NOT_AN_OBJECT = -2147217316,
  WBEM_E_AGGREGATING_BY_OBJECT = -2147217315,
  WBEM_E_UNINTERPRETABLE_PROVIDER_QUERY = -2147217313,
  WBEM_E_BACKUP_RESTORE_WINMGMT_RUNNING = -2147217312,
  WBEM_E_QUEUE_OVERFLOW = -2147217311,
  WBEM_E_PRIVILEGE_NOT_HELD = -2147217310,
  WBEM_E_INVALID_OPERATOR = -2147217309,
  WBEM_E_LOCAL_CREDENTIALS = -2147217308,
  WBEM_E_CANNOT_BE_ABSTRACT = -2147217307,
  WBEM_E_AMENDED_OBJECT = -2147217306,
  WBEM_E_CLIENT_TOO_SLOW = -2147217305,
  WBEM_E_NULL_SECURITY_DESCRIPTOR = -2147217304,
  WBEM_E_TIMED_OUT = -2147217303,
  WBEM_E_INVALID_ASSOCIATION = -2147217302,
  WBEM_E_AMBIGUOUS_OPERATION = -2147217301,
  WBEM_E_QUOTA_VIOLATION = -2147217300,
  WBEM_E_RESERVED_001 = -2147217299,
  WBEM_E_RESERVED_002 = -2147217298,
  WBEM_E_UNSUPPORTED_LOCALE = -2147217297,
  WBEM_E_HANDLE_OUT_OF_DATE = -2147217296,
  WBEM_E_CONNECTION_FAILED = -2147217295,
  WBEM_E_INVALID_HANDLE_REQUEST = -2147217294,
  WBEM_E_PROPERTY_NAME_TOO_WIDE = -2147217293,
  WBEM_E_CLASS_NAME_TOO_WIDE = -2147217292,
  WBEM_E_METHOD_NAME_TOO_WIDE = -2147217291,
  WBEM_E_QUALIFIER_NAME_TOO_WIDE = -2147217290,
  WBEM_E_RERUN_COMMAND = -2147217289,
  WBEM_E_DATABASE_VER_MISMATCH = -2147217288,
  WBEM_E_VETO_DELETE = -2147217287,
  WBEM_E_VETO_PUT = -2147217286,
  WBEM_E_INVALID_LOCALE = -2147217280,
  WBEM_E_PROVIDER_SUSPENDED = -2147217279,
  WBEM_E_SYNCHRONIZATION_REQUIRED = -2147217278,
  WBEM_E_NO_SCHEMA = -2147217277,
  WBEM_E_PROVIDER_ALREADY_REGISTERED = -2147217276,
  WBEM_E_PROVIDER_NOT_REGISTERED = -2147217275,
  WBEM_E_FATAL_TRANSPORT_ERROR = -2147217274,
  WBEM_E_ENCRYPTED_CONNECTION_REQUIRED = -2147217273,
  WBEM_E_PROVIDER_TIMED_OUT = -2147217272,
  WBEM_E_NO_KEY = -2147217271,
  WBEM_E_PROVIDER_DISABLED = -2147217270,
  WBEMESS_E_REGISTRATION_TOO_BROAD = -2147213311,
  WBEMESS_E_REGISTRATION_TOO_PRECISE = -2147213310,
  WBEMESS_E_AUTHZ_NOT_PRIVILEGED = -2147213309,
  WBEMMOF_E_EXPECTED_QUALIFIER_NAME = -2147205119,
  WBEMMOF_E_EXPECTED_SEMI = -2147205118,
  WBEMMOF_E_EXPECTED_OPEN_BRACE = -2147205117,
  WBEMMOF_E_EXPECTED_CLOSE_BRACE = -2147205116,
  WBEMMOF_E_EXPECTED_CLOSE_BRACKET = -2147205115,
  WBEMMOF_E_EXPECTED_CLOSE_PAREN = -2147205114,
  WBEMMOF_E_ILLEGAL_CONSTANT_VALUE = -2147205113,
  WBEMMOF_E_EXPECTED_TYPE_IDENTIFIER = -2147205112,
  WBEMMOF_E_EXPECTED_OPEN_PAREN = -2147205111,
  WBEMMOF_E_UNRECOGNIZED_TOKEN = -2147205110,
  WBEMMOF_E_UNRECOGNIZED_TYPE = -2147205109,
  WBEMMOF_E_EXPECTED_PROPERTY_NAME = -2147205108,
  WBEMMOF_E_TYPEDEF_NOT_SUPPORTED = -2147205107,
  WBEMMOF_E_UNEXPECTED_ALIAS = -2147205106,
  WBEMMOF_E_UNEXPECTED_ARRAY_INIT = -2147205105,
  WBEMMOF_E_INVALID_AMENDMENT_SYNTAX = -2147205104,
  WBEMMOF_E_INVALID_DUPLICATE_AMENDMENT = -2147205103,
  WBEMMOF_E_INVALID_PRAGMA = -2147205102,
  WBEMMOF_E_INVALID_NAMESPACE_SYNTAX = -2147205101,
  WBEMMOF_E_EXPECTED_CLASS_NAME = -2147205100,
  WBEMMOF_E_TYPE_MISMATCH = -2147205099,
  WBEMMOF_E_EXPECTED_ALIAS_NAME = -2147205098,
  WBEMMOF_E_INVALID_CLASS_DECLARATION = -2147205097,
  WBEMMOF_E_INVALID_INSTANCE_DECLARATION = -2147205096,
  WBEMMOF_E_EXPECTED_DOLLAR = -2147205095,
  WBEMMOF_E_CIMTYPE_QUALIFIER = -2147205094,
  WBEMMOF_E_DUPLICATE_PROPERTY = -2147205093,
  WBEMMOF_E_INVALID_NAMESPACE_SPECIFICATION = -2147205092,
  WBEMMOF_E_OUT_OF_RANGE = -2147205091,
  WBEMMOF_E_INVALID_FILE = -2147205090,
  WBEMMOF_E_ALIASES_IN_EMBEDDED = -2147205089,
  WBEMMOF_E_NULL_ARRAY_ELEM = -2147205088,
  WBEMMOF_E_DUPLICATE_QUALIFIER = -2147205087,
  WBEMMOF_E_EXPECTED_FLAVOR_TYPE = -2147205086,
  WBEMMOF_E_INCOMPATIBLE_FLAVOR_TYPES = -2147205085,
  WBEMMOF_E_MULTIPLE_ALIASES = -2147205084,
  WBEMMOF_E_INCOMPATIBLE_FLAVOR_TYPES2 = -2147205083,
  WBEMMOF_E_NO_ARRAYS_RETURNED = -2147205082,
  WBEMMOF_E_MUST_BE_IN_OR_OUT = -2147205081,
  WBEMMOF_E_INVALID_FLAGS_SYNTAX = -2147205080,
  WBEMMOF_E_EXPECTED_BRACE_OR_BAD_TYPE = -2147205079,
  WBEMMOF_E_UNSUPPORTED_CIMV22_QUAL_VALUE = -2147205078,
  WBEMMOF_E_UNSUPPORTED_CIMV22_DATA_TYPE = -2147205077,
  WBEMMOF_E_INVALID_DELETEINSTANCE_SYNTAX = -2147205076,
  WBEMMOF_E_INVALID_QUALIFIER_SYNTAX = -2147205075,
  WBEMMOF_E_QUALIFIER_USED_OUTSIDE_SCOPE = -2147205074,
  WBEMMOF_E_ERROR_CREATING_TEMP_FILE = -2147205073,
  WBEMMOF_E_ERROR_INVALID_INCLUDE_FILE = -2147205072,
  WBEMMOF_E_INVALID_DELETECLASS_SYNTAX = -2147205071,
};

enum Location
{
  LOC_TIA = 0,
  LOC_PIA_RAM = 1,
  LOC_PIA = 2,
  LOC_ROM = 3,
};

typedef enum _TAG_UNNAMED_61
{
  TOTAL_STRINGLIST_SIZE = 0xffffc000,
  STRINGLIST_SIZE = 0xffffc000,
} TAG_UNNAMED_61, *PTAG_UNNAMED_61;

enum GameTypeSettingsType
{
  GAMETYPE_SETTINGS_FIRST = 0,
  GAMETYPE_SETTINGS_DISALLOW_AIM_SLOWDOWN = 0,
  GAMETYPE_SETTINGS_DISALLOW_PRONE = 1,
  GAMETYPE_SETTINGS_ALLOW_SPECTATING = 2,
  GAMETYPE_SETTINGS_AUTO_TEAM_BALANCE = 3,
  GAMETYPE_SETTINGS_TEAM_COUNT = 4,
  GAMETYPE_SETTINGS_PRESET_CLASSES_PER_TEAM = 5,
  GAMETYPE_SETTINGS_MAX_ALLOCATION = 6,
  GAMETYPE_SETTINGS_HARDCORE_MODE = 7,
  GAMETYPE_SETTINGS_DISABLE_THIRD_PERSON_SPECTATING = 8,
  GAMETYPE_SETTINGS_NUM = 9,
};

enum bonusCards_t
{
  BONUSCARD_INVALID = -1,
  BONUSCARD_FIRST = 0,
  BONUSCARD_PRIMARY_GUNFIGHTER = 0,
  BONUSCARD_SECONDARY_GUNFIGHTER = 1,
  BONUSCARD_OVERKILL = 2,
  BONUSCARD_PERK_1_GREED = 3,
  BONUSCARD_PERK_2_GREED = 4,
  BONUSCARD_PERK_3_GREED = 5,
  BONUSCARD_DANGER_CLOSE = 6,
  BONUSCARD_TWO_TACTICALS = 7,
  BONUSCARD_COUNT = 8,
};

enum D2D1_RENDER_TARGET_TYPE
{
  D2D1_RENDER_TARGET_TYPE_DEFAULT = 0,
  D2D1_RENDER_TARGET_TYPE_SOFTWARE = 1,
  D2D1_RENDER_TARGET_TYPE_HARDWARE = 2,
  D2D1_RENDER_TARGET_TYPE_FORCE_DWORD = -1,
};

struct GfxBlendSaveScreenBlurredParam
{
  /* 0x0000 */ int fadeMsec;
  /* 0x0004 */ float s0;
  /* 0x0008 */ float t0;
  /* 0x000c */ float ds;
  /* 0x0010 */ float dt;
  /* 0x0014 */ int screenTimerId;
  /* 0x0018 */ unsigned char enabled;
  /* 0x0019 */ char __PADDING__[3];
}; /* size: 0x001c */

enum D3D_REGISTER_COMPONENT_TYPE
{
  D3D_REGISTER_COMPONENT_UNKNOWN = 0,
  D3D_REGISTER_COMPONENT_UINT32 = 1,
  D3D_REGISTER_COMPONENT_SINT32 = 2,
  D3D_REGISTER_COMPONENT_FLOAT32 = 3,
  D3D10_REGISTER_COMPONENT_UNKNOWN = 0,
  D3D10_REGISTER_COMPONENT_UINT32 = 1,
  D3D10_REGISTER_COMPONENT_SINT32 = 2,
  D3D10_REGISTER_COMPONENT_FLOAT32 = 3,
};

enum TaskState
{
  TASK_STATE_INVALID = 0,
  TASK_STATE_INIT = 1,
  TASK_STATE_INPROGRESS = 2,
  TASK_STATE_INCALLBACK = 3,
  TASK_STATE_CHILDCOMPLETE = 4,
  TASK_STATE_CHILDFAILED = 5,
  TASK_STATE_COMPLETED = 6,
  TASK_STATE_FAILED = 7,
  TASK_STATE_CANCELLED = 8,
};

typedef enum _TAG_UNNAMED_62
{
  MAX_FILE_IDS = 64,
} TAG_UNNAMED_62, *PTAG_UNNAMED_62;

enum WeaponDobjInfo::Slot
{
  HELD = 0,
  STOWED = 1,
  MELEE = 2,
};

struct WeaponDobjInfo::ModelMask
{
  /* 0x0000 */ enum WeaponDobjInfo::Slot slot;
  /* 0x0004 */ BOOL weapon;
  /* 0x0005 */ char Padding_40[3];
  union
  {
    /* 0x0008 */ const struct WeaponDef* weapDef;
    /* 0x0008 */ const struct WeaponAttachmentUnique* attachment;
  }; /* size: 0x0004 */
  /* 0x000c */ unsigned int dobjModelMask;
}; /* size: 0x0010 */

enum XAssetType
{
  ASSET_TYPE_XMODELPIECES = 0,
  ASSET_TYPE_PHYSPRESET = 1,
  ASSET_TYPE_PHYSCONSTRAINTS = 2,
  ASSET_TYPE_DESTRUCTIBLEDEF = 3,
  ASSET_TYPE_XANIMPARTS = 4,
  ASSET_TYPE_XMODEL = 5,
  ASSET_TYPE_MATERIAL = 6,
  ASSET_TYPE_TECHNIQUE_SET = 7,
  ASSET_TYPE_IMAGE = 8,
  ASSET_TYPE_SOUND = 9,
  ASSET_TYPE_SOUND_PATCH = 10,
  ASSET_TYPE_CLIPMAP = 11,
  ASSET_TYPE_CLIPMAP_PVS = 12,
  ASSET_TYPE_COMWORLD = 13,
  ASSET_TYPE_GAMEWORLD_SP = 14,
  ASSET_TYPE_GAMEWORLD_MP = 15,
  ASSET_TYPE_MAP_ENTS = 16,
  ASSET_TYPE_GFXWORLD = 17,
  ASSET_TYPE_LIGHT_DEF = 18,
  ASSET_TYPE_UI_MAP = 19,
  ASSET_TYPE_FONT = 20,
  ASSET_TYPE_FONTICON = 21,
  ASSET_TYPE_MENULIST = 22,
  ASSET_TYPE_MENU = 23,
  ASSET_TYPE_LOCALIZE_ENTRY = 24,
  ASSET_TYPE_WEAPON = 25,
  ASSET_TYPE_WEAPONDEF = 26,
  ASSET_TYPE_WEAPON_VARIANT = 27,
  ASSET_TYPE_WEAPON_FULL = 28,
  ASSET_TYPE_ATTACHMENT = 29,
  ASSET_TYPE_ATTACHMENT_UNIQUE = 30,
  ASSET_TYPE_WEAPON_CAMO = 31,
  ASSET_TYPE_SNDDRIVER_GLOBALS = 32,
  ASSET_TYPE_FX = 33,
  ASSET_TYPE_IMPACT_FX = 34,
  ASSET_TYPE_AITYPE = 35,
  ASSET_TYPE_MPTYPE = 36,
  ASSET_TYPE_MPBODY = 37,
  ASSET_TYPE_MPHEAD = 38,
  ASSET_TYPE_CHARACTER = 39,
  ASSET_TYPE_XMODELALIAS = 40,
  ASSET_TYPE_RAWFILE = 41,
  ASSET_TYPE_STRINGTABLE = 42,
  ASSET_TYPE_LEADERBOARD = 43,
  ASSET_TYPE_XGLOBALS = 44,
  ASSET_TYPE_DDL = 45,
  ASSET_TYPE_GLASSES = 46,
  ASSET_TYPE_EMBLEMSET = 47,
  ASSET_TYPE_SCRIPTPARSETREE = 48,
  ASSET_TYPE_KEYVALUEPAIRS = 49,
  ASSET_TYPE_VEHICLEDEF = 50,
  ASSET_TYPE_MEMORYBLOCK = 51,
  ASSET_TYPE_ADDON_MAP_ENTS = 52,
  ASSET_TYPE_TRACER = 53,
  ASSET_TYPE_SKINNEDVERTS = 54,
  ASSET_TYPE_QDB = 55,
  ASSET_TYPE_SLUG = 56,
  ASSET_TYPE_FOOTSTEP_TABLE = 57,
  ASSET_TYPE_FOOTSTEPFX_TABLE = 58,
  ASSET_TYPE_ZBARRIER = 59,
  ASSET_TYPE_COUNT = 60,
  ASSET_TYPE_STRING = 60,
  ASSET_TYPE_ASSETLIST = 61,
  ASSET_TYPE_REPORT = 62,
  ASSET_TYPE_DEPEND = 63,
  ASSET_TYPE_FULL_COUNT = 64,
};

enum PIMP_TECHSET
{
  PIMP_TECHSET_DEFAULT = 0,
  PIMP_TECHSET_MODEL = 1,
  PIMP_TECHSET_WORLD = 2,
  PIMP_TECHSET_PACKED_WORLD = 3,
  PIMP_TECHSET_QUANT_WORLD_NO_COLOR = 4,
  PIMP_TECHSET_QUANT_WORLD = 5,
  PIMP_TECHSET_LMAP_VERTEX_MODEL = 6,
  PIMP_TECHSET_COUNT = 7,
};

enum D3D_TESSELLATOR_DOMAIN
{
  D3D_TESSELLATOR_DOMAIN_UNDEFINED = 0,
  D3D_TESSELLATOR_DOMAIN_ISOLINE = 1,
  D3D_TESSELLATOR_DOMAIN_TRI = 2,
  D3D_TESSELLATOR_DOMAIN_QUAD = 3,
  D3D11_TESSELLATOR_DOMAIN_UNDEFINED = 0,
  D3D11_TESSELLATOR_DOMAIN_ISOLINE = 1,
  D3D11_TESSELLATOR_DOMAIN_TRI = 2,
  D3D11_TESSELLATOR_DOMAIN_QUAD = 3,
};

class bdArray<bdAddr>
{
  /* 0x0000 */ class bdAddr* m_data;
  /* 0x0004 */ unsigned int m_capacity;
  /* 0x0008 */ unsigned int m_size;
}; /* size: 0x000c */

enum DXGI_SWAP_EFFECT
{
  DXGI_SWAP_EFFECT_DISCARD = 0,
  DXGI_SWAP_EFFECT_SEQUENTIAL = 1,
};

typedef enum _TAG_UNNAMED_63
{
  COMPRESS_NONE = 0,
  COMPRESS_HUFFMAN = 1,
  COMPRESS_ZLIB = 2,
} TAG_UNNAMED_63, *PTAG_UNNAMED_63;

enum vc_attributes::YesNoMaybe
{
  No = 0xfff0001,
  Maybe = 0xfff0010,
  Yes = 0xfff0100,
};

class phys_simple_allocator<gjk_partition_t>
{
  /* 0x0000 */ int m_count;
}; /* size: 0x0004 */

enum vc_attributes::AccessType
{
  NoAccess = 0,
  Read = 1,
  Write = 2,
  ReadWrite = 3,
};

class phys_simple_link_list<contact_point_info>
{
  /* 0x0000 */ class contact_point_info* m_first;
}; /* size: 0x0004 */

class phys_inplace_avl_tree_node<rigid_body_constraint_contact>
{
  /* 0x0000 */ class rigid_body_constraint_contact* m_left;
  /* 0x0004 */ class rigid_body_constraint_contact* m_right;
  /* 0x0008 */ int m_balance;
}; /* size: 0x000c */

class rigid_body_pair_key
{
  /* 0x0000 */ class rigid_body* m_b1;
  /* 0x0004 */ class rigid_body* m_b2;
}; /* size: 0x0008 */

class rigid_body_constraint_contact
{
  /* 0x0000 */ long Padding_41[3];
  /* 0x000c */ class phys_simple_link_list<contact_point_info> m_list_contact_point_info_buffer_1;
  /* 0x0010 */ class phys_simple_link_list<contact_point_info> m_list_contact_point_info_buffer_2;
  /* 0x0014 */ unsigned int m_solver_priority;
  /* 0x0018 */ class phys_inplace_avl_tree_node<rigid_body_constraint_contact> m_avl_tree_node;
  /* 0x0024 */ class rigid_body_pair_key m_avl_key;
}; /* size: 0x002c */

enum statsTableColumns_t
{
  STATSTABLE_NUMBER = 0,
  STATSTABLE_PASSIVE = 1,
  STATSTABLE_GROUP = 2,
  STATSTABLE_NAME = 3,
  STATSTABLE_REFERENCE = 4,
  STATSTABLE_ITEMCOUNT = 5,
  STATSTABLE_IMAGE = 6,
  STATSTABLE_DESCRIPTION = 7,
  STATSTABLE_ATTACHMENTS_DATA = 8,
  STATSTABLE_SORTKEY = 9,
  STATSTABLE_UNLOCK_LVL = 10,
  STATSTABLE_DEFAULT_CLASS = 11,
  STATSTABLE_ALLOCATION_COST = 12,
  STATSTABLE_LOADOUT_SLOT = 13,
  STATSTABLE_UNLOCK_PLVL = 14,
  STATSTABLE_DLC_INDEX = 15,
  STATSTABLE_MOMENTUM_COST = 16,
  STATSTABLE_COST = 17,
  STATSTABLE_DEMO_VERSION = 18,
  STATSTABLE_ZM_MAPS_TRACKED_BY = 19,
  STATSTABLE_COUNT = 20,
};

enum D3D_TESSELLATOR_PARTITIONING
{
  D3D_TESSELLATOR_PARTITIONING_UNDEFINED = 0,
  D3D_TESSELLATOR_PARTITIONING_INTEGER = 1,
  D3D_TESSELLATOR_PARTITIONING_POW2 = 2,
  D3D_TESSELLATOR_PARTITIONING_FRACTIONAL_ODD = 3,
  D3D_TESSELLATOR_PARTITIONING_FRACTIONAL_EVEN = 4,
  D3D11_TESSELLATOR_PARTITIONING_UNDEFINED = 0,
  D3D11_TESSELLATOR_PARTITIONING_INTEGER = 1,
  D3D11_TESSELLATOR_PARTITIONING_POW2 = 2,
  D3D11_TESSELLATOR_PARTITIONING_FRACTIONAL_ODD = 3,
  D3D11_TESSELLATOR_PARTITIONING_FRACTIONAL_EVEN = 4,
};

enum DWRITE_FONT_WEIGHT
{
};

enum ParseThreadContext
{
  PARSE_THREAD_MAIN = 0,
  PARSE_THREAD_BACKEND = 1,
  PARSE_THREAD_SERVER = 2,
  PARSE_THREAD_FASTFILE = 3,
  PARSE_THREAD_COUNT = 4,
};

enum D3D_TESSELLATOR_OUTPUT_PRIMITIVE
{
  D3D_TESSELLATOR_OUTPUT_UNDEFINED = 0,
  D3D_TESSELLATOR_OUTPUT_POINT = 1,
  D3D_TESSELLATOR_OUTPUT_LINE = 2,
  D3D_TESSELLATOR_OUTPUT_TRIANGLE_CW = 3,
  D3D_TESSELLATOR_OUTPUT_TRIANGLE_CCW = 4,
  D3D11_TESSELLATOR_OUTPUT_UNDEFINED = 0,
  D3D11_TESSELLATOR_OUTPUT_POINT = 1,
  D3D11_TESSELLATOR_OUTPUT_LINE = 2,
  D3D11_TESSELLATOR_OUTPUT_TRIANGLE_CW = 3,
  D3D11_TESSELLATOR_OUTPUT_TRIANGLE_CCW = 4,
};

enum NitrousVehicle::NitrousNotifyFlags
{
  NOTIFY_COLLISION = 1,
  NOTIFY_IN_AIR = 2,
  NOTIFY_LANDED = 4,
  NOTIFY_SUSPENSION_LIMIT_ACTIVATED = 8,
  NOTIFY_ENGINE_STUTTER = 16,
  NOTIFY_REACHED_GOAL = 32,
  NOTIFY_STUCK = 64,
};

enum D3D10_USAGE
{
  D3D10_USAGE_DEFAULT = 0,
  D3D10_USAGE_IMMUTABLE = 1,
  D3D10_USAGE_DYNAMIC = 2,
  D3D10_USAGE_STAGING = 3,
};

enum DWRITE_READING_DIRECTION
{
};

enum D3D11_QUERY
{
  D3D11_QUERY_EVENT = 0,
  D3D11_QUERY_OCCLUSION = 1,
  D3D11_QUERY_TIMESTAMP = 2,
  D3D11_QUERY_TIMESTAMP_DISJOINT = 3,
  D3D11_QUERY_PIPELINE_STATISTICS = 4,
  D3D11_QUERY_OCCLUSION_PREDICATE = 5,
  D3D11_QUERY_SO_STATISTICS = 6,
  D3D11_QUERY_SO_OVERFLOW_PREDICATE = 7,
  D3D11_QUERY_SO_STATISTICS_STREAM0 = 8,
  D3D11_QUERY_SO_OVERFLOW_PREDICATE_STREAM0 = 9,
  D3D11_QUERY_SO_STATISTICS_STREAM1 = 10,
  D3D11_QUERY_SO_OVERFLOW_PREDICATE_STREAM1 = 11,
  D3D11_QUERY_SO_STATISTICS_STREAM2 = 12,
  D3D11_QUERY_SO_OVERFLOW_PREDICATE_STREAM2 = 13,
  D3D11_QUERY_SO_STATISTICS_STREAM3 = 14,
  D3D11_QUERY_SO_OVERFLOW_PREDICATE_STREAM3 = 15,
};

typedef enum _TAG_UNNAMED_64
{
  GEOGRAPHICAL_MATCHMAKING_OVERRIDE_NONE = 0,
  GEOGRAPHICAL_MATCHMAKING_OVERRIDE_ALL_PREFERRED = 1,
  GEOGRAPHICAL_MATCHMAKING_OVERRIDE_FOREIGN_PREFERRED = 2,
} TAG_UNNAMED_64, *PTAG_UNNAMED_64;

enum OffhandSecondaryClass
{
  PLAYER_OFFHAND_SECONDARY_SMOKE = 0,
  PLAYER_OFFHAND_SECONDARY_FLASH = 1,
  PLAYER_OFFHAND_SECONDARIES_TOTAL = 2,
};

enum DynEntityDrawType
{
  DYNENT_DRAW_MODEL = 0,
  DYNENT_DRAW_BRUSH = 1,
  DYNENT_DRAW_COUNT = 2,
};

struct flamePhysics_t
{
  /* 0x0000 */ union vec3_t origin;
  /* 0x000c */ union vec3_t newPos;
  /* 0x0018 */ union vec3_t velocity;
  /* 0x0024 */ float invStartSpeed;
  /* 0x0028 */ float gravity;
  /* 0x002c */ float rotation;
  /* 0x0030 */ float rotVel;
}; /* size: 0x0034 */

struct flameSize_t
{
  /* 0x0000 */ float current;
  /* 0x0004 */ float rate;
}; /* size: 0x0008 */

struct flameAge_t
{
  /* 0x0000 */ int lastUpdateTime;
  /* 0x0004 */ int startTime;
  /* 0x0008 */ int endTime;
}; /* size: 0x000c */

struct flameList_t
{
  /* 0x0000 */ struct flameGeneric_s* prev;
  /* 0x0004 */ struct flameGeneric_s* next;
}; /* size: 0x0008 */

struct flameGeneric_s
{
  /* 0x0000 */ struct flamePhysics_t phys;
  /* 0x0034 */ struct flameSize_t size;
  /* 0x003c */ struct flameAge_t age;
  /* 0x0048 */ struct flameList_t listGlobal;
  /* 0x0050 */ struct flameList_t listLocal;
  /* 0x0058 */ struct flameStream_s* stream;
  struct /* bitfield */
  {
    /* 0x005c */ unsigned long type : 3; /* bit position: 0 */
    /* 0x005c */ unsigned long delete_chunk : 1; /* bit position: 3 */
    /* 0x005c */ unsigned long id : 28; /* bit position: 4 */
  }; /* bitfield */
}; /* size: 0x0060 */

struct flameSmoke_t
{
  /* 0x0000 */ struct flameGeneric_s gen;
  /* 0x0060 */ struct Material* material;
  /* 0x0064 */ float smokeFadein;
  /* 0x0068 */ float smokeFadeout;
  /* 0x006c */ float smokeMaxAlpha;
  /* 0x0070 */ float smokeBrightness;
}; /* size: 0x0074 */

typedef enum _TAG_UNNAMED_65
{
  THREAD_VALUE_PROF_STACK = 0,
  THREAD_VALUE_VA = 1,
  THREAD_VALUE_COM_ERROR = 2,
  THREAD_VALUE_TRACE = 3,
  THREAD_VALUE_CMD = 4,
  THREAD_VALUE_COUNT = 5,
} TAG_UNNAMED_65, *PTAG_UNNAMED_65;

typedef enum _TAG_UNNAMED_66
{
  AI_MOVEMODE_SPRINT = 0,
  AI_MOVEMODE_RUN = 1,
  AI_MOVEMODE_WALK = 2,
  AI_MOVEMODE_CROUCH_RUN = 3,
  AI_MOVEMODE_CROUCH_WALK = 4,
  AI_MOVEMODE_PRONE = 5,
} TAG_UNNAMED_66, *PTAG_UNNAMED_66;

enum OffhandPrimaryClass
{
  PLAYER_OFFHAND_PRIMARY_FRAG = 0,
  PLAYER_OFFHAND_PRIMARY_GEAR = 1,
  PLAYER_OFFHAND_PRIMARIES_TOTAL = 2,
};

enum bdLobbyConnection::RecvState
{
  BD_READ_INIT = 0,
  BD_READ_SIZE = 1,
  BD_READ_ENCRYPT = 2,
  BD_READ_MESSAGE = 3,
  BD_READ_COMPLETE = 4,
};

typedef enum _TAG_UNNAMED_67
{
  FX_ED_FLAG_LOOPING = 1,
  FX_ED_FLAG_USE_RANDOM_COLOR = 2,
  FX_ED_FLAG_USE_RANDOM_ALPHA = 4,
  FX_ED_FLAG_USE_RANDOM_SIZE_0 = 8,
  FX_ED_FLAG_USE_RANDOM_SIZE_1 = 16,
  FX_ED_FLAG_USE_RANDOM_SCALE = 32,
  FX_ED_FLAG_USE_RANDOM_ROTATION_DELTA = 64,
  FX_ED_FLAG_MODULATE_COLOR_BY_ALPHA = 128,
  FX_ED_FLAG_USE_RANDOM_VELOCITY_0 = 256,
  FX_ED_FLAG_USE_RANDOM_VELOCITY_1 = 512,
  FX_ED_FLAG_BACKCOMPAT_VELOCITY = 1024,
  FX_ED_FLAG_ABSOLUTE_VELOCITY_0 = 2048,
  FX_ED_FLAG_ABSOLUTE_VELOCITY_1 = 4096,
  FX_ED_FLAG_PLAY_ON_TOUCH = 8192,
  FX_ED_FLAG_PLAY_ON_DEATH = 16384,
  FX_ED_FLAG_PLAY_ON_RUN = 0xffff8000,
  FX_ED_FLAG_BOUNDING_SPHERE = 0x10000,
  FX_ED_FLAG_PLAY_ATTACHED = 0x40000,
  FX_ED_FLAG_DISABLED = -2147483648,
} TAG_UNNAMED_67, *PTAG_UNNAMED_67;

typedef enum _TAG_UNNAMED_68
{
  THREAD_CONTEXT_MAIN = 0,
  THREAD_CONTEXT_BACKEND = 1,
  THREAD_CONTEXT_WORKER0 = 2,
  THREAD_CONTEXT_WORKER1 = 3,
  THREAD_CONTEXT_WORKER2 = 4,
  THREAD_CONTEXT_WORKER3 = 5,
  THREAD_CONTEXT_WORKER4 = 6,
  THREAD_CONTEXT_WORKER5 = 7,
  THREAD_CONTEXT_WORKER6 = 8,
  THREAD_CONTEXT_WORKER7 = 9,
  THREAD_CONTEXT_SERVER = 10,
  THREAD_CONTEXT_TITLE_SERVER = 11,
  THREAD_CONTEXT_DATABASE = 12,
  THREAD_CONTEXT_TRACE_COUNT = 13,
  THREAD_CONTEXT_TRACE_LAST = 12,
  THREAD_CONTEXT_STREAM = 13,
  THREAD_CONTEXT_SOUND_MIX = 14,
  THREAD_CONTEXT_SOUND_DECODE = 15,
  THREAD_CONTEXT_WEBM_DEC_DECODE = 16,
  THREAD_CONTEXT_COUNT = 17,
  THREAD_CONTEXT_INVALID = -1,
} TAG_UNNAMED_68, *PTAG_UNNAMED_68;

struct XDollBone
{
  /* 0x0000 */ unsigned char index;
  /* 0x0001 */ unsigned char flags;
  /* 0x0002 */ char Padding_42[2];
  /* 0x0004 */ unsigned int name_hash;
  /* 0x0008 */ int rigidBody;
  /* 0x000c */ struct PhysPreset* physPreset;
}; /* size: 0x0010 */

typedef enum _TAG_UNNAMED_69
{
  GAMETYPES_COL_GAME_REF = 1,
  GAMETYPES_COL_GAME_NAMECAPS = 2,
  GAMETYPES_COL_GAME_DESCRIPTION = 3,
  GAMETYPES_COL_GAME_IMAGE = 4,
  GAMETYPES_COL_GAME_INDEX = 5,
  GAMETYPES_COL_GAME_SPLITSCREEN = 6,
  GAMETYPES_COL_GAME_NAMELOWER = 7,
  GAMETYPES_COL_GAME_ISTEAMBASED = 8,
  GAMETYPES_COL_GAME_GROUP = 9,
} TAG_UNNAMED_69, *PTAG_UNNAMED_69;

enum D3D10_QUERY
{
  D3D10_QUERY_EVENT = 0,
  D3D10_QUERY_OCCLUSION = 1,
  D3D10_QUERY_TIMESTAMP = 2,
  D3D10_QUERY_TIMESTAMP_DISJOINT = 3,
  D3D10_QUERY_PIPELINE_STATISTICS = 4,
  D3D10_QUERY_OCCLUSION_PREDICATE = 5,
  D3D10_QUERY_SO_STATISTICS = 6,
  D3D10_QUERY_SO_OVERFLOW_PREDICATE = 7,
};

typedef enum _TAG_UNNAMED_70
{
  FX_MARK_VISUALS_CLASS_MODEL_INDEX = 0,
  FX_MARK_VISUALS_CLASS_WORLD_INDEX = 1,
  FX_MARK_VISUALS_CLASS_COUNT = 2,
} TAG_UNNAMED_70, *PTAG_UNNAMED_70;

typedef enum _TAG_UNNAMED_71
{
  FX_STATUS_REF_COUNT_MASK = 16383,
  FX_STATUS_IS_STALE_ATTACHED_FX = 16384,
  FX_STATUS_BASE_REF_REMOVED = 0xffff8000,
  FX_STATUS_HAS_PENDING_LOOP_ELEMS = 0x10000,
  FX_STATUS_OWNED_EFFECTS_SHIFT = 17,
  FX_STATUS_OWNED_EFFECTS_MASK = 0x7fe0000,
  FX_STATUS_IS_LOCKED = 0x20000000,
  FX_STATUS_IS_LOCKED_MASK = 0x60000000,
} TAG_UNNAMED_71, *PTAG_UNNAMED_71;

class bdPendingBufferTransfer
{
  /* 0x0000 */ long Padding_43[2];
  /* 0x0008 */ class bdReference<bdByteBuffer> m_buffer;
  /* 0x000c */ unsigned char* m_txPtr;
  /* 0x0010 */ unsigned int m_txAvail;
}; /* size: 0x0014 */

enum weaponstate_t
{
  WEAPON_READY = 0,
  WEAPON_RAISING = 1,
  WEAPON_RAISING_ALTSWITCH = 2,
  WEAPON_DROPPING = 3,
  WEAPON_DROPPING_QUICK = 4,
  WEAPON_DROPPING_ALTSWITCH = 5,
  WEAPON_FIRING = 6,
  WEAPON_RECHAMBER_START = 7,
  WEAPON_RECHAMBERING = 8,
  WEAPON_RELOADING_RIGHT = 9,
  WEAPON_RELOADING_LEFT = 10,
  WEAPON_RELOADING = 11,
  WEAPON_RELOADING_INTERUPT = 12,
  WEAPON_RELOAD_START = 13,
  WEAPON_RELOAD_START_RECHAMBER = 14,
  WEAPON_RELOAD_START_INTERUPT = 15,
  WEAPON_RELOAD_END = 16,
  WEAPON_RELOAD_QUICK = 17,
  WEAPON_RELOAD_QUICK_EMPTY = 18,
  WEAPON_MELEE_INIT = 19,
  WEAPON_MELEE_FIRE = 20,
  WEAPON_MELEE_END = 21,
  WEAPON_OFFHAND_INIT = 22,
  WEAPON_OFFHAND_PREPARE = 23,
  WEAPON_OFFHAND_HOLD = 24,
  WEAPON_OFFHAND_DETONATE = 25,
  WEAPON_OFFHAND_START = 26,
  WEAPON_OFFHAND = 27,
  WEAPON_OFFHAND_HOLDUSE = 28,
  WEAPON_OFFHAND_END = 29,
  WEAPON_RIOTSHIELD_PREPARE = 30,
  WEAPON_RIOTSHIELD_START = 31,
  WEAPON_RIOTSHIELD_HOLD = 32,
  WEAPON_RIOTSHIELD = 33,
  WEAPON_RIOTSHIELD_END = 34,
  WEAPON_DETONATING = 35,
  WEAPON_SPRINT_RAISE = 36,
  WEAPON_SPRINT_LOOP = 37,
  WEAPON_SPRINT_DROP = 38,
  WEAPON_CONT_FIRE_IN = 39,
  WEAPON_CONT_FIRE_LOOP = 40,
  WEAPON_CONT_FIRE_OUT = 41,
  WEAPON_NIGHTVISION_WEAR = 42,
  WEAPON_NIGHTVISION_REMOVE = 43,
  WEAPON_DEPLOYING = 44,
  WEAPON_DEPLOYED = 45,
  WEAPON_BREAKING_DOWN = 46,
  WEAPON_SWIM_IN = 47,
  WEAPON_SWIM_OUT = 48,
  WEAPON_DTP_IN = 49,
  WEAPON_DTP_LOOP = 50,
  WEAPON_DTP_OUT = 51,
  WEAPON_SLIDE_IN = 52,
  WEAPON_FIRING_LEFT = 53,
  WEAPON_FIRING_BOTH = 54,
  WEAPON_JAMMED = 55,
  WEAPON_LOWREADY_RAISE = 56,
  WEAPON_LOWREADY_LOOP = 57,
  WEAPON_LOWREADY_DROP = 58,
  WEAPON_CRAWL_IN = 59,
  WEAPON_CRAWL_FORWARD = 60,
  WEAPON_CRAWL_BACK = 61,
  WEAPON_CRAWL_RIGHT = 62,
  WEAPON_CRAWL_LEFT = 63,
  WEAPON_CRAWL_OUT = 64,
  WEAPONSTATES_NUM = 65,
};

struct DXGI_SAMPLE_DESC
{
  /* 0x0000 */ unsigned int Count;
  /* 0x0004 */ unsigned int Quality;
}; /* size: 0x0008 */

struct D3D10_TEXTURE2D_DESC
{
  /* 0x0000 */ unsigned int Width;
  /* 0x0004 */ unsigned int Height;
  /* 0x0008 */ unsigned int MipLevels;
  /* 0x000c */ unsigned int ArraySize;
  /* 0x0010 */ enum DXGI_FORMAT Format;
  /* 0x0014 */ struct DXGI_SAMPLE_DESC SampleDesc;
  /* 0x001c */ enum D3D10_USAGE Usage;
  /* 0x0020 */ unsigned int BindFlags;
  /* 0x0024 */ unsigned int CPUAccessFlags;
  /* 0x0028 */ unsigned int MiscFlags;
}; /* size: 0x002c */

enum D3D11_FILL_MODE
{
  D3D11_FILL_WIREFRAME = 2,
  D3D11_FILL_SOLID = 3,
};

struct tagInfo_t
{
  /* 0x0000 */ struct gentity_t* parent;
  /* 0x0004 */ struct gentity_t* next;
  /* 0x0008 */ unsigned short name;
  /* 0x000a */ BOOL blendToParent;
  /* 0x000b */ BOOL blendOnlyYaw;
  /* 0x000c */ BOOL collisionPhysics;
  /* 0x000d */ char Padding_44[3];
  /* 0x0010 */ int index;
  /* 0x0014 */ union vec3_t axis[4];
  /* 0x0044 */ union vec3_t parentInvAxis[4];
}; /* size: 0x0074 */

enum gjk_query_flags_e
{
  GJK_QUERY_FLAG_TERRAIN = 1,
  GJK_QUERY_FLAG_ENTS = 2,
  GJK_QUERY_FLAG_DENTS = 4,
};

enum D3D11_CULL_MODE
{
  D3D11_CULL_NONE = 1,
  D3D11_CULL_FRONT = 2,
  D3D11_CULL_BACK = 3,
};

enum eBattleChatterPlayStates
{
  BCMP_NONE = 0,
  BCMP_SOUND_ONE = 1,
  BCMP_SOUND_TWO = 2,
};

enum fileshareState_e
{
  FILESHARE_STATE_INVALID = 0,
  FILESHARE_STATE_WORKING = 1,
  FILESHARE_STATE_SLOTS_FETCHED = 2,
  FILESHARE_STATE_VIEWS_FETCHED = 3,
  FILESHARE_STATE_VOTES_FETCHED = 4,
  FILESHARE_STATE_FAILURE = 5,
  FILESHARE_STATE_VALID = 6,
};

enum ActionSlotType
{
  ACTIONSLOTTYPE_DONOTHING = 0,
  ACTIONSLOTTYPE_SPECIFYWEAPON = 1,
  ACTIONSLOTTYPE_ALTWEAPONTOGGLE = 2,
  ACTIONSLOTTYPE_NIGHTVISION = 3,
  ACTIONSLOTTYPECOUNT = 4,
};

struct XAnimDeltaPart
{
  /* 0x0000 */ struct XAnimPartTrans* trans;
  /* 0x0004 */ struct XAnimDeltaPartQuat2* quat2;
  /* 0x0008 */ struct XAnimDeltaPartQuat* quat;
}; /* size: 0x000c */

enum bdNATTypeDiscoveryPacket::bdNATTypeDiscoveryPacketRequest
{
  BD_NTDP_SAME_ADDR = 0,
  BD_NTDP_DIFF_PORT = 1,
  BD_NTDP_DIFF_IP = 2,
  BD_NTDP_DIFF_PORT_IP = 3,
  BD_NTDP_INVALID_TYPE = 4,
};

typedef enum _TAG_UNNAMED_72
{
  DOBJ_MAX_PARTS = 160,
  DOBJ_MAX_PART_BITS = 5,
  MAX_LODS = 4,
} TAG_UNNAMED_72, *PTAG_UNNAMED_72;

enum GridPointAlignType
{
  GRID_TOP_LEFT_ALIGN = 0,
  GRID_TOP_CENTER_ALIGN = 1,
  GRID_TOP_RIGHT_ALIGN = 2,
  GRID_LEFT_ALIGN = 3,
  GRID_CENTER_ALIGN = 4,
  GRID_RIGHT_ALIGN = 5,
  GRID_BOTTOM_LEFT_ALIGN = 6,
  GRID_BOTTOM_CENTER_ALIGN = 7,
  GRID_BOTTOM_RIGHT_ALIGN = 8,
};

typedef enum _tagPARSEACTION
{
  PARSE_CANONICALIZE = 1,
  PARSE_FRIENDLY = 2,
  PARSE_SECURITY_URL = 3,
  PARSE_ROOTDOCUMENT = 4,
  PARSE_DOCUMENT = 5,
  PARSE_ANCHOR = 6,
  PARSE_ENCODE_IS_UNESCAPE = 7,
  PARSE_DECODE_IS_ESCAPE = 8,
  PARSE_PATH_FROM_URL = 9,
  PARSE_URL_FROM_PATH = 10,
  PARSE_MIME = 11,
  PARSE_SERVER = 12,
  PARSE_SCHEMA = 13,
  PARSE_SITE = 14,
  PARSE_DOMAIN = 15,
  PARSE_LOCATION = 16,
  PARSE_SECURITY_DOMAIN = 17,
  PARSE_ESCAPE = 18,
  PARSE_UNESCAPE = 19,
} tagPARSEACTION, *PtagPARSEACTION;

struct GfxPixelShaderLoadDef
{
  /* 0x0000 */ unsigned char* program;
  /* 0x0004 */ unsigned int programSize;
}; /* size: 0x0008 */

struct MaterialPixelShaderProgram
{
  /* 0x0000 */ struct ID3D11PixelShader* ps;
  /* 0x0004 */ struct GfxPixelShaderLoadDef loadDef;
}; /* size: 0x000c */

struct MaterialPixelShader
{
  /* 0x0000 */ const char* name;
  /* 0x0004 */ struct MaterialPixelShaderProgram prog;
}; /* size: 0x0010 */

enum bdConnectionStore::bdConnectionStoreStatus
{
  BD_CONNECTION_STORE_UNINITIALIZED = 0,
  BD_CONNECTION_STORE_INITIALIZED = 1,
  BD_CONNECTION_STORE_SHUTTING_DOWN = 2,
  BD_CONNECTION_STORE_ERROR = 3,
};

enum PhysWorld
{
  PHYS_WORLD_DYNENT = 0,
  PHYS_WORLD_FX = 1,
  PHYS_WORLD_RAGDOLL = 2,
  PHYS_WORLD_COUNT = 3,
};

typedef struct _XMUDECN4
{
  union
  {
    struct /* bitfield */
    {
      /* 0x0000 */ unsigned int x : 10; /* bit position: 0 */
      /* 0x0000 */ unsigned int y : 10; /* bit position: 10 */
      /* 0x0000 */ unsigned int z : 10; /* bit position: 20 */
      /* 0x0000 */ unsigned int w : 2; /* bit position: 30 */
    }; /* bitfield */
    /* 0x0000 */ unsigned int v;
  }; /* size: 0x0004 */
} XMUDECN4, *PXMUDECN4; /* size: 0x0004 */

typedef enum _TAG_UNNAMED_73
{
  ASSERT_TYPE_ASSERT = 0,
  ASSERT_TYPE_SANITY = 1,
  ASSERT_TYPE_STACKTRACE = 2,
} TAG_UNNAMED_73, *PTAG_UNNAMED_73;

enum language_t
{
  LANGUAGE_ENGLISH = 0,
  LANGUAGE_FRENCH = 1,
  LANGUAGE_FRENCHCANADIAN = 2,
  LANGUAGE_GERMAN = 3,
  LANGUAGE_AUSTRIAN = 4,
  LANGUAGE_ITALIAN = 5,
  LANGUAGE_SPANISH = 6,
  LANGUAGE_BRITISH = 7,
  LANGUAGE_RUSSIAN = 8,
  LANGUAGE_POLISH = 9,
  LANGUAGE_KOREAN = 10,
  LANGUAGE_JAPANESE = 11,
  LANGUAGE_CZECH = 12,
  LANGUAGE_FULLJAPANESE = 13,
  LANGUAGE_PORTUGUESE = 14,
  LANGUAGE_MEXICANSPANISH = 15,
  MAX_LANGUAGES = 16,
};

enum tagDOMNodeType
{
  NODE_INVALID = 0,
  NODE_ELEMENT = 1,
  NODE_ATTRIBUTE = 2,
  NODE_TEXT = 3,
  NODE_CDATA_SECTION = 4,
  NODE_ENTITY_REFERENCE = 5,
  NODE_ENTITY = 6,
  NODE_PROCESSING_INSTRUCTION = 7,
  NODE_COMMENT = 8,
  NODE_DOCUMENT = 9,
  NODE_DOCUMENT_TYPE = 10,
  NODE_DOCUMENT_FRAGMENT = 11,
  NODE_NOTATION = 12,
};

enum bdPriority
{
  BD_PRIORITY_VERY_LOW = 0,
  BD_PRIORITY_LOW = 1,
  BD_PRIORITY_NORMAL = 2,
  BD_PRIORITY_HIGH = 3,
  BD_PRIORITY_VERY_HIGH = 4,
  BD_NUM_PRIORITIES = 5,
};

enum FxUpdateEffectType
{
  UPDATE_EFFECT_INDEPENDENT = 0,
  UPDATE_EFFECT_BOLTED = 1,
  UPDATE_EFFECT_NONSPRITE = 2,
  UPDATE_EFFECT_PORTALLED = 3,
  UPDATE_EFFECT_INVALID = 4,
};

struct D3D11_BUFFEREX_SRV
{
  /* 0x0000 */ unsigned int FirstElement;
  /* 0x0004 */ unsigned int NumElements;
  /* 0x0008 */ unsigned int Flags;
}; /* size: 0x000c */

enum GfxLightType
{
  GFX_LIGHT_TYPE_NONE = 0,
  GFX_LIGHT_TYPE_DIR = 1,
  GFX_LIGHT_TYPE_SPOT = 2,
  GFX_LIGHT_TYPE_SPOT_SQUARE = 3,
  GFX_LIGHT_TYPE_SPOT_ROUND = 4,
  GFX_LIGHT_TYPE_OMNI = 5,
  GFX_LIGHT_TYPE_COUNT = 6,
  GFX_LIGHT_TYPE_DIR_SHADOWMAP = 6,
  GFX_LIGHT_TYPE_SPOT_SHADOWMAP = 7,
  GFX_LIGHT_TYPE_SPOT_SQUARE_SHADOWMAP = 8,
  GFX_LIGHT_TYPE_SPOT_ROUND_SHADOWMAP = 9,
  GFX_LIGHT_TYPE_OMNI_SHADOWMAP = 10,
  GFX_LIGHT_TYPE_COUNT_WITH_SHADOWMAP_VERSIONS = 11,
};

typedef enum _tagPSUACTION
{
  PSU_DEFAULT = 1,
  PSU_SECURITY_URL_ONLY = 2,
} tagPSUACTION, *PtagPSUACTION;

struct sockaddr
{
  /* 0x0000 */ unsigned short sa_family;
  /* 0x0002 */ char sa_data[14];
}; /* size: 0x0010 */

typedef enum _TAG_UNNAMED_74
{
  BITS_PER_WORD = 32,
  WORD_COUNT = 2,
} TAG_UNNAMED_74, *PTAG_UNNAMED_74;

enum weaponAttachModel_t
{
  WEAP_ATTACH_MODEL_OPTIC_1 = 0,
  WEAP_ATTACH_MODEL_OPTIC_2 = 1,
  WEAP_ATTACH_MODEL_IRONSIGHTS = 2,
  WEAP_ATTACH_MODEL_MUZZLE = 3,
  WEAP_ATTACH_MODEL_UNDERBARREL = 4,
  WEAP_ATTACH_MODEL_MISC = 5,
  WEAP_ATTACH_MODEL_CLIP = 6,
  WEAP_ATTACH_MODEL_OPTIC_1_ADS = 7,
  NUM_WEAP_ATTACHMODELS = 8,
};

enum GfxExtraCamParms::eExtraCamRenderMode
{
  EXTRA_CAM_NONE = 0,
  EXTRA_CAM_SINGLE = 1,
  EXTRA_CAM_MULTI = 2,
};

typedef enum _TAG_UNNAMED_75
{
  ENUM_NOP = 0,
  ENUM_program = 1,
  ENUM_assignment = 2,
  ENUM_unknown_variable = 3,
  ENUM_duplicate_variable = 4,
  ENUM_local_variable = 5,
  ENUM_local_variable_frozen = 6,
  ENUM_duplicate_expression = 7,
  ENUM_primitive_expression = 8,
  ENUM_integer = 9,
  ENUM_float = 10,
  ENUM_minus_integer = 11,
  ENUM_minus_float = 12,
  ENUM_string = 13,
  ENUM_istring = 14,
  ENUM_array_variable = 15,
  ENUM_unknown_field = 16,
  ENUM_field_variable = 17,
  ENUM_field_variable_frozen = 18,
  ENUM_variable = 19,
  ENUM_function = 20,
  ENUM_call_expression = 21,
  ENUM_local_function = 22,
  ENUM_far_function = 23,
  ENUM_function_pointer = 24,
  ENUM_call = 25,
  ENUM_method = 26,
  ENUM_call_expression_statement = 27,
  ENUM_script_call = 28,
  ENUM_return = 29,
  ENUM_return2 = 30,
  ENUM_wait = 31,
  ENUM_script_thread_call = 32,
  ENUM_script_child_thread_call = 33,
  ENUM_script_builtin_call_pointer = 34,
  ENUM_undefined = 35,
  ENUM_self = 36,
  ENUM_self_frozen = 37,
  ENUM_level = 38,
  ENUM_game = 39,
  ENUM_anim = 40,
  ENUM_if = 41,
  ENUM_if_else = 42,
  ENUM_while = 43,
  ENUM_for = 44,
  ENUM_inc = 45,
  ENUM_dec = 46,
  ENUM_binary_equals = 47,
  ENUM_statement_list = 48,
  ENUM_developer_statement_list = 49,
  ENUM_expression_list = 50,
  ENUM_bool_or = 51,
  ENUM_bool_and = 52,
  ENUM_binary = 53,
  ENUM_bool_not = 54,
  ENUM_bool_complement = 55,
  ENUM_size_field = 56,
  ENUM_self_field = 57,
  ENUM_precachetree = 58,
  ENUM_waittill = 59,
  ENUM_waittillmatch = 60,
  ENUM_waittillFrameEnd = 61,
  ENUM_notify = 62,
  ENUM_endon = 63,
  ENUM_switch = 64,
  ENUM_case = 65,
  ENUM_default = 66,
  ENUM_break = 67,
  ENUM_continue = 68,
  ENUM_expression = 69,
  ENUM_empty_array = 70,
  ENUM_animation = 71,
  ENUM_animation_animtree = 72,
  ENUM_thread = 73,
  ENUM_begin_developer_thread = 74,
  ENUM_end_developer_thread = 75,
  ENUM_usingtree = 76,
  ENUM_false = 77,
  ENUM_true = 78,
  ENUM_animtree = 79,
  ENUM_breakon = 80,
  ENUM_breakpoint = 81,
  ENUM_prof_begin = 82,
  ENUM_prof_end = 83,
  ENUM_vector = 84,
  ENUM_object = 85,
  ENUM_thread_object = 86,
  ENUM_local = 87,
  ENUM_statement = 88,
  ENUM_bad_expression = 89,
  ENUM_bad_statement = 90,
  ENUM_include = 91,
  ENUM_argument = 92,
  ENUM_thisthread = 93,
  ENUM_construct_array = 94,
  ENUM_define_statement = 95,
} TAG_UNNAMED_75, *PTAG_UNNAMED_75;

enum tagExtentMode
{
  DVEXTENT_CONTENT = 0,
  DVEXTENT_INTEGRAL = 1,
};

enum StanceState
{
  CL_STANCE_STAND = 0,
  CL_STANCE_CROUCH = 1,
  CL_STANCE_PRONE = 2,
  CL_STANCE_DIVE_TO_PRONE = 3,
};

enum tagXMLEMEM_TYPE
{
  XMLELEMTYPE_ELEMENT = 0,
  XMLELEMTYPE_TEXT = 1,
  XMLELEMTYPE_COMMENT = 2,
  XMLELEMTYPE_DOCUMENT = 3,
  XMLELEMTYPE_DTD = 4,
  XMLELEMTYPE_PI = 5,
  XMLELEMTYPE_OTHER = 6,
};

typedef enum _NVVIOCOLORSPACE
{
  NVVIOCOLORSPACE_UNKNOWN = 0,
  NVVIOCOLORSPACE_YCBCR = 1,
  NVVIOCOLORSPACE_YCBCRA = 2,
  NVVIOCOLORSPACE_YCBCRD = 3,
  NVVIOCOLORSPACE_GBR = 4,
  NVVIOCOLORSPACE_GBRA = 5,
  NVVIOCOLORSPACE_GBRD = 6,
} NVVIOCOLORSPACE, *PNVVIOCOLORSPACE;

enum AISpecies
{
  AI_SPECIES_DOG = 0,
  AI_SPECIES_BIGDOG = 1,
  AI_SPECIES_ZOMBIE = 2,
  AI_SPECIES_ZOMBIE_DOG = 3,
  MAX_AI_SPECIES = 4,
  AI_SPECIES_ALL = 4,
};

struct D3D11_MAPPED_SUBRESOURCE
{
  /* 0x0000 */ void* pData;
  /* 0x0004 */ unsigned int RowPitch;
  /* 0x0008 */ unsigned int DepthPitch;
}; /* size: 0x000c */

enum clientMigState_t
{
  CMSTATE_INACTIVE = 0,
  CMSTATE_OLDHOSTLEAVING = 1,
  CMSTATE_LIMBO = 2,
  CMSTATE_NEWHOSTCONNECT = 3,
  CMSTATE_COUNT = 4,
};

typedef enum _TAG_UNNAMED_76
{
  TS_IDLE = 0,
  TS_FIRING_HEAD = 1,
  TS_FIRING_FEET = 2,
} TAG_UNNAMED_76, *PTAG_UNNAMED_76;

typedef enum _tagQUERYOPTION
{
  QUERY_EXPIRATION_DATE = 1,
  QUERY_TIME_OF_LAST_CHANGE = 2,
  QUERY_CONTENT_ENCODING = 3,
  QUERY_CONTENT_TYPE = 4,
  QUERY_REFRESH = 5,
  QUERY_RECOMBINE = 6,
  QUERY_CAN_NAVIGATE = 7,
  QUERY_USES_NETWORK = 8,
  QUERY_IS_CACHED = 9,
  QUERY_IS_INSTALLEDENTRY = 10,
  QUERY_IS_CACHED_OR_MAPPED = 11,
  QUERY_USES_CACHE = 12,
  QUERY_IS_SECURE = 13,
  QUERY_IS_SAFE = 14,
  QUERY_USES_HISTORYFOLDER = 15,
} tagQUERYOPTION, *PtagQUERYOPTION;

typedef enum _TAG_UNNAMED_77
{
  BITS_PER_WORD = 32,
  WORD_COUNT = 768,
} TAG_UNNAMED_77, *PTAG_UNNAMED_77;

enum D3D11_DSV_DIMENSION
{
  D3D11_DSV_DIMENSION_UNKNOWN = 0,
  D3D11_DSV_DIMENSION_TEXTURE1D = 1,
  D3D11_DSV_DIMENSION_TEXTURE1DARRAY = 2,
  D3D11_DSV_DIMENSION_TEXTURE2D = 3,
  D3D11_DSV_DIMENSION_TEXTURE2DARRAY = 4,
  D3D11_DSV_DIMENSION_TEXTURE2DMS = 5,
  D3D11_DSV_DIMENSION_TEXTURE2DMSARRAY = 6,
};

enum bdConnectionStore::bdConnectionStoreShutdownType
{
  BD_CONNECTION_STORE_SHUTDOWN_ELEGANT = 0,
  BD_CONNECTION_STORE_SHUTDOWN_IMMEDIATE = 1,
};

typedef enum _TAG_UNNAMED_78
{
  VERTS_PER_SPRITE_ELEM = 4,
  INDICES_PER_SPRITE_ELEM = 6,
} TAG_UNNAMED_78, *PTAG_UNNAMED_78;

enum ViewLockTypes
{
  PLAYERVIEWLOCK_NONE = 0,
  PLAYERVIEWLOCK_FULL = 1,
  PLAYERVIEWLOCK_WEAPONJITTER = 2,
  PLAYERVIEWLOCKCOUNT = 3,
};

struct RopeUpdateCmdData
{
  /* 0x0000 */ union vec3_t viewOrg;
  /* 0x000c */ int ropeCount;
  /* 0x0010 */ union vec4_t screenMtx[4];
  /* 0x0050 */ struct rope_t* ropes;
  /* 0x0054 */ long __PADDING__[3];
}; /* size: 0x0060 */

struct XAnimClientNotifyAdder
{
}; /* size: 0x0001 */

enum VehicleAnimState
{
  VEHICLEANIMSTATE_IDLE = 0,
  VEHICLEANIMSTATE_ENTRY = 1,
  VEHICLEANIMSTATE_CHANGEPOS = 2,
  VEHICLEANIMSTATE_EXIT = 3,
  VEHICLEANIMSTATECOUNT = 4,
};

struct XAnimNotifyInfo
{
  /* 0x0000 */ unsigned short name;
  /* 0x0002 */ char Padding_45[2];
  /* 0x0004 */ float time;
}; /* size: 0x0008 */

enum D3D_FEATURE_LEVEL
{
  D3D_FEATURE_LEVEL_9_1 = 0xffff9100,
  D3D_FEATURE_LEVEL_9_2 = 0xffff9200,
  D3D_FEATURE_LEVEL_9_3 = 0xffff9300,
  D3D_FEATURE_LEVEL_10_0 = 0xffffa000,
  D3D_FEATURE_LEVEL_10_1 = 0xffffa100,
  D3D_FEATURE_LEVEL_11_0 = 0xffffb000,
};

typedef enum _TAG_UNNAMED_79
{
  CONTROL_ANGLES_BACK_LOW = 0,
  CONTROL_ANGLES_BACK_MID = 1,
  CONTROL_ANGLES_BACK_UP = 2,
  CONTROL_ANGLES_NECK = 3,
  CONTROL_ANGLES_HEAD = 4,
  CONTROL_ANGLES_PELVIS = 5,
  CONTROL_ANGLES_COUNT = 6,
} TAG_UNNAMED_79, *PTAG_UNNAMED_79;

typedef enum _NVVIOLINKID
{
  NVVIOLINKID_UNKNOWN = 0,
  NVVIOLINKID_A = 1,
  NVVIOLINKID_B = 2,
  NVVIOLINKID_C = 3,
  NVVIOLINKID_D = 4,
} NVVIOLINKID, *PNVVIOLINKID;

typedef enum _TAG_UNNAMED_80
{
